#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AI_Humanoid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ALS_Stance_structs.hpp"
#include "STR_Path_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Team_structs.hpp"
#include "STR_PCStats_structs.hpp"
#include "ALS_Base_CharacterBP_classes.hpp"
#include "ALS_Gait_structs.hpp"
#include "ST_DefaultSteamItem_structs.hpp"
#include "GameMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AI_Humanoid.AI_Humanoid_C
// 0x02B0 (0x0E10 - 0x0B60)
class AAI_Humanoid_C final : public AALS_Base_CharacterBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AI_Humanoid_C;                      // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       DeadView;                                          // 0x0B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0B70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Censor_Face;                                       // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInventory_C*                           Inventory;                                         // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 AIPerception;                                      // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Update_Actor;                                  // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          SightActors;                                       // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<double>                                ActorsDistance;                                    // 0x0BB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      BloodPool;                                         // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FearIndex;                                         // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Team                                        Team;                                              // 0x0BD0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DefaultSteamItem                   SkinInfo;                                          // 0x0BD8(0x0160)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FSTR_Path>                      ExistingPathList;                                  // 0x0D38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AController*                            DamageInstigator;                                  // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SmootherAiming;                                    // 0x0D50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AAI_lookSpot_C*                         LookSpot;                                          // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerUserName;                                    // 0x0D70(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	class AAI_Humanoid_C*                         Dot_Owner;                                         // 0x0D80(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar;                                            // 0x0D88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPathLenght;                                 // 0x0D8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Path_Points;                                       // 0x0D90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Path_Length;                                       // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Teams_Gamemode_;                                   // 0x0DA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA9[0x7];                                      // 0x0DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTR_PCStats                           PlayerStats;                                       // 0x0DB0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class APawn*>                          ListOfOpponant;                                    // 0x0DE0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Confident_;                                        // 0x0DF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF1[0x7];                                      // 0x0DF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentAccuracy;                                   // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BotSkillThreshold;                                 // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void ApplyPointDamage(double Damage, double RagdollForce, class FName BoneName, const struct FVector& Location, const struct FVector& ShotFromDirection, class AController* ControllerInstigator, bool DisableHeadShot);
	void BndEvt__Zombie_AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void BoneDamage(class FName bone, double Damage, bool DisableHeadShot, double* DamageFinal);
	void Bots_Method_(bool* Bots_Method);
	double BotsAim();
	void BPI_Get_Inventory(class UInventory_C** Inventory_0);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void CheckMagEmpty(class AWEP_C* WEP_0, bool* MagEmpty);
	void ClearMap();
	void Uncrouch();
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_AI_Humanoid(int32 EntryPoint);
	void Find_Look_at_Point();
	void FindCoverSpot(struct FVector* CoverSpotLocation);
	void FireTicking();
	void FocusUpdate();
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component_0);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy_0, double* BotSkillThreshold_0, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team_0);
	void GetTeamList(E_Team Team_0, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP_0);
	void HandleSightSense(const struct FAIStimulus& Stimulus, class AActor* Instigator_0);
	void HandleSoundSense(const struct FAIStimulus& Stimulus, class AActor* Instigator_0);
	void Init_Skin__Multicast_(class USkeletalMesh* NewMesh, const TArray<TSoftObjectPtr<class UMaterialInterface>>& Materials);
	void InitDotOwner__Multicast_(class AAI_Humanoid_C* DotOwner, const class FString& Username);
	void InitNameplateWidget();
	void InitScoreBoard();
	void InitVoteNextMap();
	void Is_Confident_();
	void IsCautious();
	void isDangerClose_(class AActor* Instiguator, bool* TakeCareOfDanger);
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void Kick_(const struct FSTR_PCInfo& Target);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnRep_SetPlayer();
	void OnRep_SkinInfo();
	void OnRep_Team();
	void OnTrySelectTeam(E_Team Team_0);
	void PlaySoundLocal(class USoundCue* Audio);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void RefreshMapVoterPlayerID();
	void RefreshPerception();
	void Reload_();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void RoundStart();
	void ServerTravel(double Delay, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void Set_Pre_Initialise_Component();
	void SetPlayerByDistance();
	void Slomo(double Slomo_0);
	void SpawnVoteNextMap_Hud_();
	void StanceUpdate(EALS_Stance Stance_0, double Delay);
	void Talk(bool IsTalking);
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateBotAccuracy();
	void UpdateGamemode(EGameMode GameMode);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdatePathPoint();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTargetActor();
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateWarning(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AI_Humanoid_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AI_Humanoid_C")
	}
	static class AAI_Humanoid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAI_Humanoid_C>();
	}
};

}

