#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodycamGI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SteamCoreShared_structs.hpp"
#include "E_Team_structs.hpp"
#include "Struct_UpdateLeaderboardData_structs.hpp"
#include "STR_Rank_structs.hpp"
#include "StreakSatuts_structs.hpp"
#include "STR_PCStats_structs.hpp"
#include "GameMode_structs.hpp"
#include "ServerSlotEN_structs.hpp"
#include "STR_PCInfo_structs.hpp"
#include "STR_Score_structs.hpp"
#include "Bodycam_structs.hpp"
#include "Bodycam_classes.hpp"
#include "STR_TEST_structs.hpp"
#include "ST_DefaultSteamItem_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_Loadout_structs.hpp"
#include "LeaderboardClassSupp_structs.hpp"
#include "EN_StatUpdateConfig_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BodycamGI.BodycamGI_C
// 0x1090 (0x1250 - 0x01C0)
class UBodycamGI_C final : public UBodycamGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        CurrentPlayTimeTimer;                              // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PlayTimeTimerHandle;                               // 0x01D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_MenuSystemConfig_C*                MenuSystemConfig;                                  // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_SaveGameManager_C>   SaveGameManager;                                   // 0x01E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_SettingsManager_C>   SettingsManager;                                   // 0x0208(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	E_Team                                        Team;                                              // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTR_PCStats                           MyStats;                                           // 0x0238(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSTR_Score                             Score;                                             // 0x0268(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_PCInfo>                    WinningPlayer;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EGameMode                                     GameMode;                                          // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GainReissadScore;                                  // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameLaunch_;                                       // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_PlayerInfo_C*                       SG_Player_Body;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_Rank>                      RankArrayConfigMultiplayer;                        // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         REISSAD_Min;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GainRankScore;                                     // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_TEST                              Player_Body__Client_;                              // 0x02B0(0x02E0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           Player_Custom_List_Temporary;                      // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FST_DefaultSteamItem>           Default_Skin;                                      // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Reissad_Stats_Score;                               // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDef>                  User_Item_Definitions;                             // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSteamItemDef>                  Game_Item_Definitions;                             // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSteamItemDef                          RewardItemDefinition;                              // 0x05D8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SessionToJoin__Client_;                            // 0x05E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         FriendsIDLobby;                                    // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HostAlone_;                                        // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDef>                  Item_with_Prices_Defs;                             // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FST_DefaultSteamItem>           Player_Weapons_List_Temporary;                     // 0x0618(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FST_DefaultSteamItem>           Player_Skin_List_Temporary;                        // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FST_DefaultSteamItem>           FinalPlayerSkinTemp;                               // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FSTR_Rank>                      RankArrayConfigZombie;                             // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLeaderboardFindResult                 Reissad_Scoreboard;                                // 0x0658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FString                                 Currency;                                          // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           Badge_List_Temporary;                              // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Actual_Multiplayer_Global;                         // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Actual_Multiplayer_Score;                          // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Actual_Multiplayer_Text;                           // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Actual_Multiplayer_Integer;                        // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Actual_Zombie_Text;                                // 0x06A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Actual_Zombie_Global;                              // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Actual_Zombie_Score;                               // 0x06BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Actual_Zombie_Integer;                             // 0x06C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Actual_Multiplayer_Color;                          // 0x06C4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSteamID                               Steam_ID;                                          // 0x06D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         Actual_Season;                                     // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Connection_Streak;                                 // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActualReissadScore;                                // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6EC[0x4];                                      // 0x06EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_DefaultSteamItem>           Default_Bagde;                                     // 0x06F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FSteamItemDef>                  User_NotOwned_Item_Definitions;                    // 0x0700(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBlueprintSessionResult                Session_Result;                                    // 0x0710(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_MenuContainer_Silence_C*           WBP_MenuContainer_Silence;                         // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Join_;                                             // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ServerFound;                                       // 0x0839(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83A[0x6];                                      // 0x083A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Search_String;                                     // 0x0840(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Search_Type;                                       // 0x0850(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FBlueprintSessionResult                Array_Element_Result;                              // 0x0860(0x0120)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MostFillServer;                                    // 0x0980(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Session_Password;                                  // 0x0988(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Session_Name;                                      // 0x0998(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 IPCountry;                                         // 0x09A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Session_Max_Players;                               // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Session_Use_LAN;                                   // 0x09BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BD[0x3];                                      // 0x09BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Selected_Level_Name;                               // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCreatingSession;                                // 0x09C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x7];                                      // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        WaitingSoundRef;                                   // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         FIND___Season;                                     // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FIND___Rank_Integer;                               // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStreakSatuts                                 Streak_Status;                                     // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_PlayerInfo_C*                       As_SG_Player_Info;                                 // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Actual_Zombie_Color;                               // 0x09F0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          InLobby_;                                          // 0x0A04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A05[0x3];                                      // 0x0A05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastConnection;                                    // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FST_Loadout                            ST_Actual_Loadout;                                 // 0x0A10(0x0470)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FSteamSessionSetting                   NewVar;                                            // 0x0E80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBodycamLobbySearchResult              Quickplay_LobbySearchResult;                       // 0x0EA8(0x01B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBodycamLobbySearchResult>      Quickplay_SearchResults;                           // 0x1058(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBodycamLobbySearchResult              LobbySearchResult;                                 // 0x1068(0x01B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         GamesWonInARow;                                    // 0x1218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121C[0x4];                                     // 0x121C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MenuContainer_Silence_C*           LoadingScreenContainer;                            // 0x1220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPDA_AnalyticsTrackerInfo_C*            DA_AnalyticsTrackerInfoProd;                       // 0x1228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPDA_AnalyticsTrackerInfo_C*            DA_AnalyticsTrackerInfoTest;                       // 0x1230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MultiplayerRankInitialized_;                       // 0x1238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1239[0x7];                                     // 0x1239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_UpdateLeaderboardData>  UploadLeaderboardQueue;                            // 0x1240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void _OnAnalyticsTrackResponse(bool bSuccess);
	void _OnPublicIpCaptured(const class FString& Response);
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void ClearMap();
	void Completed_B9B8E30F4DF97A2775AEAA9116C519A2(class USaveGame* SaveGame, bool bSuccess);
	void Completed_F233AEC544D6A9F4EDF74FB6412FDE9B(class USaveGame* SaveGame, bool bSuccess);
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_BodycamGI(int32 EntryPoint);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
