#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bodycam_Interface

#include "Basic.hpp"

#include "STR_Loadout_structs.hpp"
#include "STR_VoteNextMapInfo_structs.hpp"
#include "STR_PCInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Team_structs.hpp"
#include "GameMode_structs.hpp"
#include "STR_TEST_structs.hpp"
#include "STR_KickVote_structs.hpp"
#include "STR_GamemodeWinInfo_structs.hpp"
#include "STR_Score_structs.hpp"


namespace SDK::Params
{

// Function Bodycam_Interface.Bodycam_Interface_C.AddVoteNextMap
// 0x0020 (0x0020 - 0x0000)
struct Bodycam_Interface_C_AddVoteNextMap final
{
public:
	struct FSTR_VoteNextMapInfo                   VoteInfo;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Bots Method?
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_Bots_Method_ final
{
public:
	bool                                          Bots_Method;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.BPI Get Inventory
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_BPI_Get_Inventory final
{
public:
	class UInventory_C*                           Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.CanCreateKickVote
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_CanCreateKickVote final
{
public:
	bool                                          CanCreateKickVote_;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.CanKickThisPlayer?
// 0x0018 (0x0018 - 0x0000)
struct Bodycam_Interface_C_CanKickThisPlayer_ final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          True_;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Get BP Menu Controller Component
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_Get_BP_Menu_Controller_Component final
{
public:
	class UBP_MenuControllerComponent_C*          BP_Menu_Controller_Component;                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Get Stamina
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_Get_Stamina final
{
public:
	double                                        Stamina;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetAllowedMap
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetAllowedMap final
{
public:
	TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>> AllowedMap;                                   // 0x0000(0x0010)(Parm, OutParm)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetBlured
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetBlured final
{
public:
	double                                        Blured;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetBotsAccuracy
// 0x0030 (0x0030 - 0x0000)
struct Bodycam_Interface_C_GetBotsAccuracy final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentAccuracy;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BotSkillThreshold;                                 // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetIsPlayer;                                    // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetBurnedRef
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetBurnedRef final
{
public:
	class USceneComponent*                        BurnedMesh;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetCurrentWeaponsGunGame
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetCurrentWeaponsGunGame final
{
public:
	class FName                                   CurrentWeaponsGunGame;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetDeadView
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetDeadView final
{
public:
	class UCameraComponent*                       CameraComponent;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetFlashBangEffect
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetFlashBangEffect final
{
public:
	double                                        FlashEffect;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetGameMode
// 0x00C8 (0x00C8 - 0x0000)
struct Bodycam_Interface_C_GetGameMode final
{
public:
	struct FSTR_GamemodeWinInfo                   GameMode;                                          // 0x0000(0x00C8)(Parm, OutParm, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetHealth
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetHealth final
{
public:
	double                                        Health;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetKickedPlayerVoted
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetKickedPlayerVoted final
{
public:
	TArray<class FString>                         KickplayerAlreadyVote;                             // 0x0000(0x0010)(Parm, OutParm)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetMenuSettings
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetMenuSettings final
{
public:
	class UBP_MenuControllerComponent_C*          Bp_MenuController;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetMutePlayer
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetMutePlayer final
{
public:
	TArray<class FString>                         MutePlayer;                                        // 0x0000(0x0010)(Parm, OutParm)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetPcInfo
// 0x0318 (0x0318 - 0x0000)
struct Bodycam_Interface_C_GetPcInfo final
{
public:
	struct FSTR_PCInfo                            PCInfo;                                            // 0x0000(0x0318)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetPlayerConnected
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetPlayerConnected final
{
public:
	TArray<struct FSTR_PCInfo>                    PlayerConnected;                                   // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetPlayerKickVote
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetPlayerKickVote final
{
public:
	TArray<struct FSTR_KickVote>                  KickVotePlayer;                                    // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetPlayerSkin
// 0x02E8 (0x02E8 - 0x0000)
struct Bodycam_Interface_C_GetPlayerSkin final
{
public:
	struct FSTR_TEST                              Player_Skin;                                       // 0x0000(0x02E0)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Valid_;                                            // 0x02E0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetRagdollSystem
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetRagdollSystem final
{
public:
	class UWW_RagdollSystem_C*                    Ragdoll_System;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetReady?
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_GetReady_ final
{
public:
	bool                                          IsReady_;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetReloadPlayRate
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetReloadPlayRate final
{
public:
	double                                        PlayRate;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetServerSteamID
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetServerSteamID final
{
public:
	class FString                                 SteamID;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetStarterWeapons
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetStarterWeapons final
{
public:
	TArray<struct FSTR_Loadout>                   Weapons;                                           // 0x0000(0x0010)(Parm, OutParm)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetSteamID
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetSteamID final
{
public:
	class FString                                 SteamID;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetSurvivorStatuts
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetSurvivorStatuts final
{
public:
	class UWW_SurvivorStatus_C*                   SurvivorComponant;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetTeam
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_GetTeam final
{
public:
	E_Team                                        Team;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetTeamList
// 0x0018 (0x0018 - 0x0000)
struct Bodycam_Interface_C_GetTeamList final
{
public:
	E_Team                                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_PCInfo>                    Info;                                              // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetTopScore
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_GetTopScore final
{
public:
	TArray<struct FSTR_PCInfo>                    TopScore;                                          // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};

// Function Bodycam_Interface.Bodycam_Interface_C.GetWep
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_GetWep final
{
public:
	class AWEP_C*                                 WEP;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsDead
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsDead final
{
public:
	bool                                          Dead_;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsDestroyabe?
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsDestroyabe_ final
{
public:
	bool                                          Destroyable_;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsPlayerWinning
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsPlayerWinning final
{
public:
	bool                                          Yes_;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsReady?
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsReady_ final
{
public:
	bool                                          IsReady__0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsStress
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsStress final
{
public:
	bool                                          Yes_;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.IsTalking?
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_IsTalking_ final
{
public:
	bool                                          IsTalking__0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Kick?
// 0x0318 (0x0318 - 0x0000)
struct Bodycam_Interface_C_Kick_ final
{
public:
	struct FSTR_PCInfo                            Target;                                            // 0x0000(0x0318)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.KickPlayer
// 0x0320 (0x0320 - 0x0000)
struct Bodycam_Interface_C_KickPlayer final
{
public:
	struct FSTR_KickVote                          PlayerInfo;                                        // 0x0000(0x0320)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.MuteID
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_MuteID final
{
public:
	class FString                                 SteamID;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.NewKickVote
// 0x0318 (0x0318 - 0x0000)
struct Bodycam_Interface_C_NewKickVote final
{
public:
	struct FSTR_PCInfo                            Target;                                            // 0x0000(0x0318)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.OnPlayerDeath
// 0x0318 (0x0318 - 0x0000)
struct Bodycam_Interface_C_OnPlayerDeath final
{
public:
	struct FSTR_PCInfo                            PC;                                                // 0x0000(0x0318)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.OnTrySelectTeam
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_OnTrySelectTeam final
{
public:
	E_Team                                        Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.PlaySoundLocal
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_PlaySoundLocal final
{
public:
	class USoundCue*                              Audio;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Respawn
// 0x0320 (0x0320 - 0x0000)
struct Bodycam_Interface_C_Respawn final
{
public:
	double                                        duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_PCInfo                            Info;                                              // 0x0008(0x0318)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.ServerTravel
// 0x0018 (0x0018 - 0x0000)
struct Bodycam_Interface_C_ServerTravel final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Level;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Set Bomb
// 0x0028 (0x0028 - 0x0000)
struct Bodycam_Interface_C_Set_Bomb final
{
public:
	TSoftObjectPtr<class ABombe_C>                Bomb;                                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Slomo
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_Slomo final
{
public:
	double                                        Slomo_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Talk
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_Talk final
{
public:
	bool                                          IsTalking;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.Update Vote Timer Text
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_Update_Vote_Timer_Text final
{
public:
	double                                        TimerIndex;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateGamemode
// 0x0001 (0x0001 - 0x0000)
struct Bodycam_Interface_C_UpdateGamemode final
{
public:
	EGameMode                                     GameMode;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateKickVote
// 0x0320 (0x0320 - 0x0000)
struct Bodycam_Interface_C_UpdateKickVote final
{
public:
	struct FSTR_PCInfo                            Target;                                            // 0x0000(0x0318)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Yes_;                                              // 0x0318(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateMapSelection
// 0x000C (0x000C - 0x0000)
struct Bodycam_Interface_C_UpdateMapSelection final
{
public:
	class FName                                   Selected_Level_Name;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateScore
// 0x0008 (0x0008 - 0x0000)
struct Bodycam_Interface_C_UpdateScore final
{
public:
	struct FSTR_Score                             Score;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateTeamXP
// 0x000C (0x000C - 0x0000)
struct Bodycam_Interface_C_UpdateTeamXP final
{
public:
	int32                                         Rpoints;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RanksPoints;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AccessReward_;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Winner_;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Bodycam_Interface.Bodycam_Interface_C.UpdateWarning
// 0x0010 (0x0010 - 0x0000)
struct Bodycam_Interface_C_UpdateWarning final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

}

