#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodycamSteamMock

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum BodycamSteamMock.EDiscordPresenceActivityActionTypeBC
// NumValues: 0x0003
enum class EDiscordPresenceActivityActionTypeBC : uint8
{
	Join                                     = 0,
	Spectate                                 = 1,
	EDiscordPresenceActivityActionTypeBC_MAX = 2,
};

// Enum BodycamSteamMock.ESteamPersonaChangeBC
// NumValues: 0x000F
enum class ESteamPersonaChangeBC : uint8
{
	Name                                     = 0,
	Status                                   = 1,
	ComeOnline                               = 2,
	GoneOffline                              = 3,
	GamePlayed                               = 4,
	GameServer                               = 5,
	Avatar                                   = 6,
	JoinedSource                             = 7,
	LeftSource                               = 8,
	RelationshipChanged                      = 9,
	NameFirstSet                             = 10,
	FacebookInfo                             = 11,
	Nickname                                 = 12,
	SteamLevel                               = 13,
	ESteamPersonaChangeBC_MAX                = 14,
};

// Enum BodycamSteamMock.ESteamResultBC
// NumValues: 0x0073
enum class ESteamResultBC : uint8
{
	None                                     = 0,
	OK                                       = 1,
	Fail                                     = 2,
	NoConnection                             = 3,
	sultNoConnectionRetry                    = 4,
	InvalidPassword                          = 5,
	LoggedInElsewhere                        = 6,
	InvalidProtocolVer                       = 7,
	InvalidParam                             = 8,
	FileNotFound                             = 9,
	Busy                                     = 10,
	InvalidState                             = 11,
	InvalidName                              = 12,
	InvalidEmail                             = 13,
	DuplicateName                            = 14,
	AccessDenied                             = 15,
	Timeout                                  = 16,
	Banned                                   = 17,
	AccountNotFound                          = 18,
	InvalidSteamID                           = 19,
	ServiceUnavailable                       = 20,
	NotLoggedOn                              = 21,
	Pending                                  = 22,
	EncryptionFailure                        = 23,
	InsufficientPrivilege                    = 24,
	LimitExceeded                            = 25,
	Revoked                                  = 26,
	Expired                                  = 27,
	AlreadyRedeemed                          = 28,
	DuplicateRequest                         = 29,
	AlreadyOwned                             = 30,
	IPNotFound                               = 31,
	PersistFailed                            = 32,
	LockingFailed                            = 33,
	LogonSessionReplaced                     = 34,
	ConnectFailed                            = 35,
	HandshakeFailed                          = 36,
	IOFailure                                = 37,
	RemoteDisconnect                         = 38,
	ShoppingCartNotFound                     = 39,
	Blocked                                  = 40,
	Ignored                                  = 41,
	NoMatch                                  = 42,
	AccountDisabled                          = 43,
	ServiceReadOnly                          = 44,
	AccountNotFeatured                       = 45,
	AdministratorOK                          = 46,
	ContentVersion                           = 47,
	TryAnotherCM                             = 48,
	PasswordRequiredToKickSession            = 49,
	AlreadyLoggedInElsewhere                 = 50,
	Suspended                                = 51,
	Cancelled                                = 52,
	DataCorruption                           = 53,
	DiskFull                                 = 54,
	RemoteCallFailed                         = 55,
	PasswordUnset                            = 56,
	ExternalAccountUnlinked                  = 57,
	PSNTicketInvalid                         = 58,
	ExternalAccountAlreadyLinked             = 59,
	RemoteFileConflict                       = 60,
	IllegalPassword                          = 61,
	SameAsPreviousValue                      = 62,
	AccountLogonDenied                       = 63,
	CannotUseOldPassword                     = 64,
	InvalidLoginAuthCode                     = 65,
	AccountLogonDeniedNoMail                 = 66,
	HardwareNotCapableOfIPT                  = 67,
	IPTInitError                             = 68,
	ParentalControlRestricted                = 69,
	FacebookQueryError                       = 70,
	ExpiredLoginAuthCode                     = 71,
	IPLoginRestrictionFailed                 = 72,
	AccountLockedDown                        = 73,
	AccountLogonDeniedVerifiedEmailRequired  = 74,
	NoMatchingURL                            = 75,
	BadResponse                              = 76,
	RequirePasswordReEntry                   = 77,
	ValueOutOfRange                          = 78,
	UnexpectedError                          = 79,
	Disabled                                 = 80,
	InvalidCEGSubmission                     = 81,
	RestrictedDevice                         = 82,
	RegionLocked                             = 83,
	RateLimitExceeded                        = 84,
	AccountLoginDeniedNeedTwoFactor          = 85,
	ItemDeleted                              = 86,
	AccountLoginDeniedThrottle               = 87,
	TwoFactorCodeMismatch                    = 88,
	TwoFactorActivationCodeMismatch          = 89,
	AccountAssociatedToMultiplePartners      = 90,
	NotModified                              = 91,
	NoMobileDevice                           = 92,
	TimeNotSynced                            = 93,
	SmsCodeFailed                            = 94,
	AccountLimitExceeded                     = 95,
	AccountActivityLimitExceeded             = 96,
	PhoneActivityLimitExceeded               = 97,
	RefundToWallet                           = 98,
	EmailSendFailure                         = 99,
	NotSettled                               = 100,
	NeedCaptcha                              = 101,
	GSLTDenied                               = 102,
	GSOwnerDenied                            = 103,
	InvalidItemType                          = 104,
	IPBanned                                 = 105,
	GSLTExpired                              = 106,
	InsufficientFunds                        = 107,
	TooManyPending                           = 108,
	NoSiteLicensesFound                      = 109,
	WGNetworkSendExceeded                    = 110,
	AccountNotFriends                        = 111,
	LimitedUserAccount                       = 112,
	CantRemoveItem                           = 113,
	ESteamResultBC_MAX                       = 114,
};

// Enum BodycamSteamMock.ESteamComparisonOpBC
// NumValues: 0x000A
enum class ESteamComparisonOpBC : uint8
{
	Equals                                   = 0,
	NotEquals                                = 1,
	GreaterThan                              = 2,
	GreaterThanEquals                        = 3,
	LessThan                                 = 4,
	LessThanEquals                           = 5,
	Near                                     = 6,
	In                                       = 7,
	NotIn                                    = 8,
	ESteamComparisonOpBC_MAX                 = 9,
};

// Enum BodycamSteamMock.ESteamSessionFindTypeBC
// NumValues: 0x0003
enum class ESteamSessionFindTypeBC : uint8
{
	Listen                                   = 0,
	Dedicated                                = 1,
	ESteamSessionFindTypeBC_MAX              = 2,
};

// Enum BodycamSteamMock.ESteamLobbyDistanceFilterBC
// NumValues: 0x0005
enum class ESteamLobbyDistanceFilterBC : uint8
{
	k_ELobbyDistanceFilterClose              = 0,
	k_ELobbyDistanceFilterDefault            = 1,
	k_ELobbyDistanceFilterFar                = 2,
	k_ELobbyDistanceFilterWorldwide          = 3,
	k_MAX                                    = 4,
};

// Enum BodycamSteamMock.ESteamFriendFlagsBC
// NumValues: 0x000D
enum class ESteamFriendFlagsBC : uint8
{
	None                                     = 0,
	Blocked                                  = 1,
	FriendshipRequested                      = 2,
	Immediate                                = 3,
	ClanMember                               = 4,
	OnGameServer                             = 5,
	RequestingFriendship                     = 6,
	RequestingInfo                           = 7,
	Ignored                                  = 8,
	IgnoredFriend                            = 9,
	ChatMember                               = 10,
	All                                      = 11,
	ESteamFriendFlagsBC_MAX                  = 12,
};

// Enum BodycamSteamMock.ESteamFriendRelationshipBC
// NumValues: 0x0009
enum class ESteamFriendRelationshipBC : uint8
{
	None                                     = 0,
	Blocked                                  = 1,
	RequestRecipient                         = 2,
	Friend                                   = 3,
	RequestInitiator                         = 4,
	Ignored                                  = 5,
	IgnoredFriend                            = 6,
	Suggested_DEPRECATED                     = 7,
	Max                                      = 8,
};

// Enum BodycamSteamMock.ESteamPersonaStateBC
// NumValues: 0x0008
enum class ESteamPersonaStateBC : uint8
{
	Offline                                  = 0,
	Online                                   = 1,
	Busy                                     = 2,
	Away                                     = 3,
	Snooze                                   = 4,
	LookingToTrade                           = 5,
	LookingToPlay                            = 6,
	Max                                      = 7,
};

// Enum BodycamSteamMock.ESteamChatEntryTypeBC
// NumValues: 0x000D
enum class ESteamChatEntryTypeBC : uint8
{
	Invalid                                  = 0,
	ChatMsg                                  = 1,
	Typing                                   = 2,
	InviteGame                               = 3,
	Emote                                    = 4,
	LeftConversation                         = 6,
	Entered                                  = 7,
	WasKicked                                = 8,
	WasBanned                                = 9,
	Disconnected                             = 10,
	HistoricalChat                           = 11,
	LinkBlocked                              = 14,
	ESteamChatEntryTypeBC_MAX                = 15,
};

// Enum BodycamSteamMock.ESteamCoreProIdenticalBC
// NumValues: 0x0003
enum class ESteamCoreProIdenticalBC : uint8
{
	Identical                                = 0,
	NotIdentical                             = 1,
	ESteamCoreProIdenticalBC_MAX             = 2,
};

// Enum BodycamSteamMock.ESteamCoreProItemFlagsBC
// NumValues: 0x0004
enum class ESteamCoreProItemFlagsBC : uint8
{
	ENoTrade                                 = 0,
	ERemoved                                 = 8,
	EConsumed                                = 9,
	ESteamCoreProItemFlagsBC_MAX             = 10,
};

// Enum BodycamSteamMock.ESteamLeaderboardDataRequestBC
// NumValues: 0x0005
enum class ESteamLeaderboardDataRequestBC : uint8
{
	Global                                   = 0,
	GlobalAroundUser                         = 1,
	Friends                                  = 2,
	Users                                    = 3,
	ESteamLeaderboardDataRequestBC_MAX       = 4,
};

// Enum BodycamSteamMock.ESteamLeaderboardUploadScoreMethodBC
// NumValues: 0x0004
enum class ESteamLeaderboardUploadScoreMethodBC : uint8
{
	None                                     = 0,
	KeepBest                                 = 1,
	ForceUpdate                              = 2,
	ESteamLeaderboardUploadScoreMethodBC_MAX = 3,
};

// ScriptStruct BodycamSteamMock.SteamSessionSettingBC
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FSteamSessionSettingBC final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamSessionResultBC
// 0x0130 (0x0130 - 0x0000)
struct FSteamSessionResultBC final
{
public:
	struct FBlueprintSessionResult                Result;                                            // 0x0000(0x0120)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FSteamSessionSettingBC>         SessionSettings;                                   // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamLeaderboardEntriesBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamLeaderboardEntriesBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.DiscordActivityInfoBC
// 0x00A8 (0x00A8 - 0x0000)
struct FDiscordActivityInfoBC final
{
public:
	class FString                                 Details;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 State;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LargeImageKey;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LargeImageTooltip;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SmallImageKey;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SmallImageTooltip;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              StartTime;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              EndTime;                                           // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartySize;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartyMaxSize;                                      // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyID;                                           // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JoinSecret;                                        // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpectateSecret;                                    // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamUGCHandleBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamUGCHandleBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamLeaderboardBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamLeaderboardBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.DiscordUserBC
// 0x0038 (0x0038 - 0x0000)
struct FDiscordUserBC final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Username;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Discriminator;                                     // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBot;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamSessionSearchSettingBC
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSteamSessionSearchSettingBC final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.LeaderboardScoresDownloadedBC
// 0x0018 (0x0018 - 0x0000)
struct FLeaderboardScoresDownloadedBC final
{
public:
	struct FSteamLeaderboardBC                    SteamLeaderboard;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FSteamLeaderboardEntriesBC             SteamLeaderboardEntries;                           // 0x0008(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         EntryCount;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.LeaderboardScoresDownloadedForUsersBC
// 0x0018 (0x0018 - 0x0000)
struct FLeaderboardScoresDownloadedForUsersBC final
{
public:
	struct FSteamLeaderboardBC                    SteamLeaderboard;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FSteamLeaderboardEntriesBC             SteamLeaderboardEntries;                           // 0x0008(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         EntryCount;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.LeaderboardFindResultBC
// 0x0010 (0x0010 - 0x0000)
struct FLeaderboardFindResultBC final
{
public:
	struct FSteamLeaderboardBC                    SteamLeaderboard;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLeaderboardFound;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamIDBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamIDBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.GameConnectedFriendChatMsgBC
// 0x0010 (0x0010 - 0x0000)
struct FGameConnectedFriendChatMsgBC final
{
public:
	struct FSteamIDBC                             SteamIDUser;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MessageID;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.GameOverlayActivatedBC
// 0x0008 (0x0008 - 0x0000)
struct FGameOverlayActivatedBC final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUserInitiated;                                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AppID;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.PersonaStateChangeBC
// 0x0018 (0x0018 - 0x0000)
struct FPersonaStateChangeBC final
{
public:
	struct FSteamIDBC                             SteamID;                                           // 0x0000(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<ESteamPersonaChangeBC>                 Flags;                                             // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamGameIDBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamGameIDBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.RequestCurrentStatsDataBC
// 0x0018 (0x0018 - 0x0000)
struct FRequestCurrentStatsDataBC final
{
public:
	struct FSteamGameIDBC                         GameID;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	ESteamResultBC                                Result;                                            // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamIDBC                             SteamIDUser;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamInventoryRequestPricesResultBC
// 0x0018 (0x0018 - 0x0000)
struct FSteamInventoryRequestPricesResultBC final
{
public:
	ESteamResultBC                                Result;                                            // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Currency;                                          // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamInventoryResultBC
// 0x0004 (0x0004 - 0x0000)
struct FSteamInventoryResultBC final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct BodycamSteamMock.SteamInventoryResultReadyBC
// 0x0008 (0x0008 - 0x0000)
struct FSteamInventoryResultReadyBC final
{
public:
	struct FSteamInventoryResultBC                handle;                                            // 0x0000(0x0004)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ESteamResultBC                                Result;                                            // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamInventoryStartPurchaseResultBC
// 0x0028 (0x0028 - 0x0000)
struct FSteamInventoryStartPurchaseResultBC final
{
public:
	ESteamResultBC                                Result;                                            // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OrderID;                                           // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TransactionId;                                     // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.LeaderboardScoreUploadedBC
// 0x0020 (0x0020 - 0x0000)
struct FLeaderboardScoreUploadedBC final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamLeaderboardBC                    SteamLeaderboard;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScoreChanged;                                     // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GlobalRankNew;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GlobalRankPrevious;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamItemInstanceIDBC
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSteamItemInstanceIDBC final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct BodycamSteamMock.SteamItemDefBC
// 0x0004 (0x0004 - 0x0000)
struct FSteamItemDefBC final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct BodycamSteamMock.SteamItemDetailsBC
// 0x0020 (0x0020 - 0x0000)
struct FSteamItemDetailsBC final
{
public:
	struct FSteamItemInstanceIDBC                 InstanceId;                                        // 0x0000(0x0008)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSteamItemDefBC                        Definition;                                        // 0x0008(0x0004)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<ESteamCoreProItemFlagsBC>              Flags;                                             // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct BodycamSteamMock.SteamLeaderboardEntryBC
// 0x0020 (0x0020 - 0x0000)
struct FSteamLeaderboardEntryBC final
{
public:
	struct FSteamIDBC                             SteamID;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GlobalRank;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Details;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamUGCHandleBC                      UGCHandle;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};

}

