#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bodycam

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Bodycam.EAchievementValueType
// NumValues: 0x0003
enum class EAchievementValueType : uint8
{
	Int                                      = 0,
	Float                                    = 1,
	EAchievementValueType_MAX                = 2,
};

// Enum Bodycam.ELobbySearchDistanceFilter
// NumValues: 0x0002
enum class ELobbySearchDistanceFilter : uint8
{
	WorldWide                                = 0,
	ELobbySearchDistanceFilter_MAX           = 1,
};

// Enum Bodycam.EPS5MatchLeaveReason
// NumValues: 0x0005
enum class EPS5MatchLeaveReason : uint8
{
	Invalid                                  = 0,
	Disconnect                               = 1,
	Finished                                 = 2,
	Quit                                     = 3,
	EPS5MatchLeaveReason_MAX                 = 4,
};

// Enum Bodycam.EBodycamPersonaState
// NumValues: 0x0008
enum class EBodycamPersonaState : uint8
{
	Offline                                  = 0,
	Online                                   = 1,
	Busy                                     = 2,
	Away                                     = 3,
	Snooze                                   = 4,
	LookingToTrade                           = 5,
	LookingToPlay                            = 6,
	Max                                      = 7,
};

// Enum Bodycam.EPS5MatchType
// NumValues: 0x0004
enum class EPS5MatchType : uint8
{
	Cooperative                              = 0,
	FreeForAll                               = 1,
	TeamBased                                = 2,
	EPS5MatchType_MAX                        = 3,
};

// Enum Bodycam.EOverlayType
// NumValues: 0x0010
enum class EOverlayType : uint8
{
	UNSPECIFIED                              = 0,
	ACCOUNT_CREATION                         = 1,
	ACCOUNT_UPGRADE                          = 2,
	ACHIEVEMENTS                             = 3,
	FRIENDS                                  = 4,
	INVITE                                   = 5,
	LEADERBOARDS                             = 6,
	LOGIN                                    = 7,
	LOGIN_WITH_SKIP                          = 8,
	PLATFORM_MESSAGE_BOX                     = 9,
	PROFILE_UI                               = 10,
	SEND_MESSAGE_TO_USER                     = 11,
	SEND_MESSAGE                             = 12,
	STORE                                    = 13,
	WEB_URL                                  = 14,
	EOverlayType_MAX                         = 15,
};

// ScriptStruct Bodycam.BodycamLobbyId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FBodycamLobbyId final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.BodycamAccountId
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FBodycamAccountId final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.BodycamLobbyAttribute
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FBodycamLobbyAttribute final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.BodycamLobbySearchResult
// 0x01B0 (0x01B0 - 0x0000)
struct FBodycamLobbySearchResult final
{
public:
	struct FBodycamLobbyId                        LobbyID;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FBodycamAccountId                      LeaderId;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 LobbyName;                                         // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMembers;                                        // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentMembers;                                    // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PingInMs;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FBodycamLobbyAttribute> LobbySettings;                                  // 0x0040(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x120];                                     // 0x0090(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.OverlayOpenParams
// 0x0040 (0x0040 - 0x0000)
struct FOverlayOpenParams final
{
public:
	struct FUniqueNetIdRepl                       TargetNetID;                                       // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.BodycamLobbyInvite
// 0x0050 (0x0050 - 0x0000)
struct FBodycamLobbyInvite final
{
public:
	class FString                                 SenderName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOverlayOpenParams                     OverlayOpenParams;                                 // 0x0010(0x0040)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.AchievementStat
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FAchievementStat final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.AchievementDefinition
// 0x0018 (0x0020 - 0x0008)
struct FAchievementDefinition final : public FTableRowBase
{
public:
	struct FGameplayTag                           AchievementTag;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TrackedStatTag;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequiredValue;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAchievementValueType                         ValueType;                                         // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.AchievementDefinitionArray
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAchievementDefinitionArray final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.OnlineProfile
// 0x0018 (0x0018 - 0x0000)
struct FOnlineProfile final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Icon;                                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.PS5MatchHandle
// 0x0048 (0x0048 - 0x0000)
struct FPS5MatchHandle final
{
public:
	class FString                                 MatchID;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LevelName;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameMode;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPS5MatchType                                 MatchType;                                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TeamNames;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.BodycamPS5MatchStat
// 0x0030 (0x0030 - 0x0000)
struct FBodycamPS5MatchStat final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x20];                                      // 0x0010(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct Bodycam.BodycamPS5MatchStorage
// 0x0010 (0x0010 - 0x0000)
struct FBodycamPS5MatchStorage final
{
public:
	TArray<struct FBodycamPS5MatchStat>           Array;                                             // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.LegacySteamPresenceEntry
// 0x0018 (0x0018 - 0x0000)
struct FLegacySteamPresenceEntry final
{
public:
	struct FGameplayTag                           PresenceId;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FormatString;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.PresenceProperty
// 0x0018 (0x0018 - 0x0000)
struct FPresenceProperty final
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct Bodycam.SetPresenceParams
// 0x0018 (0x0018 - 0x0000)
struct FSetPresenceParams final
{
public:
	struct FGameplayTag                           StatusId;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPresenceProperty>              Properties;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

}

