#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bombe

#include "Basic.hpp"

#include "AI_BombAction_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Team_structs.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "E_Detection_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Bombe.Bombe_C
// 0x0098 (0x0340 - 0x02A8)
class ABombe_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       WidgetFocus;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        FuzeTimer;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BombeActive;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             PlayerAttached;                                    // 0x02E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATaserCable_C*                          Cable;                                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanStick;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Max_Animation_Speed;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FuseDelay;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Explode;                                           // 0x0310(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGT_Bodycam_C*                          gt;                                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Bomb_Have_Been_Active;                             // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABombZone_C*                            ZoneActor;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	E_Team                                        TeamHasBomb;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             DefuseAnouncerSound;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AI_UpdateBombAction();
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanSwap_(bool* IsItemSwap_);
	void Client___UnlockClutchAchievement();
	void Defuse_0();
	void DefuseAnouncerMessage__Multicast_();
	void Drop(double Delay);
	void Drop__Server_();
	void ExecuteUbergraph_Bombe(int32 EntryPoint);
	void Explode__mutlicast_();
	void Explode__Server_();
	void FusingEffect__Multicast_();
	void Get_attach_Taser_Point(class FName* Attach_Point1, class FName* Attach_Point2);
	void GetItemPriority(int32* Priority);
	void GetOffset(struct FTransform* Offset);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetSocketToAttach(class FName* SocketToAttach);
	void Defuse();
	void Interract(class APawn* Owner_0);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void Is_Planting_Bomb_(bool* Yes_);
	void Is_Stickable_(bool* Stickable_);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void Item_Focus(class AActor* Instigator_0);
	void Left_Click_Release__Client_();
	void Left_Client_event__Client_();
	void LeftClickEvent();
	void LeftClickReleaseEvent();
	void Loop_Im_Here();
	void OnRep_BombeActive();
	void OnRep_ZoneActor();
	void Pickup(class AActor* Owner_0);
	void Pickup__Server_(class AActor* PlayerAttached_0);
	void PlantAnouncerMessage__Multicast_();
	void ReceiveBeginPlay();
	void SecurityTimer();
	void Set_Simulate_Physics__Multicast_(bool bSimulate);
	void Start_Fuse();
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Bombe_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bombe_C")
	}
	static class ABombe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABombe_C>();
	}
};

}

