#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BC_ShowCase

#include "Basic.hpp"

#include "EN_ShopItemSupClass_structs.hpp"
#include "EN_ShopItemClass_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_SaveType_structs.hpp"
#include "ST_DefaultSteamItem_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BC_ShowCase.BP_BC_ShowCase_C
// 0x0290 (0x08E0 - 0x0650)
class ABP_BC_ShowCase_C final : public ACharacter
{
public:
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Censor_Face;                                       // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapons;                                           // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       WidgetFocus;                                       // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Rotation;                                          // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Steam_ID;                                          // 0x0688(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	bool                                          Ready_;                                            // 0x0698(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTalking;                                         // 0x0699(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOIPTalker*                            Voip;                                              // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Upload_Steam_Save_Done;                            // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EN_SaveType                                   EN_SaveType;                                       // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USG_PlayerCustomization_C*              SG_PlayerItemGear_REF;                             // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   As_Cine_Camera_Component;                          // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_Weapons_Pistol;                               // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_Weapons_AK47;                                 // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_No_Weapons;                                   // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_Gloves;                                       // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_Head;                                         // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_Foot;                                         // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Anim_BackPack;                                     // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           PlayerSkin__RepNotify_;                            // 0x0708(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	EN_ShopItemSupClass                           ItemClassSup_Local;                                // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodycamGI_C*                           As_Bodycam_GI;                                     // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyItemInClass;                                // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CurrentSkeletelMesh;                               // 0x0730(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	EN_ShopItemSupClass                           ItemClassSup_Temporary;                            // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   Sequence_Player;                                   // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           PlayerCurrentSkin;                                 // 0x0750(0x0028)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, HasGetValueTypeHash)
	struct FST_DefaultSteamItem                   Badge;                                             // 0x0778(0x0160)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void Apply_SAVED___TEMPORARY();
	void Apply_TEMPORARY___SAVED();
	void ChangeAnim(class ULevelSequence* LevelSequence);
	void Create_Save_Local();
	void DestroyVOIP();
	void Download_Steam_Save();
	void ExecuteUbergraph_BP_BC_ShowCase(int32 EntryPoint);
	void Init();
	void InitUserName__Multicast_(const class FString& SteamID);
	void InitUserName__Server_(const class FString& SteamID);
	void InitVOIP();
	void Is_Spawn_Point_Valid(const struct FTransform& Spawn_Transform, bool* Valid_);
	void IsTalking___Server_(bool IsTalking_);
	void OnBlendOut_286DF58A484E2FD546809EACD187D7A5(class FName NotifyName);
	void OnCompleted_286DF58A484E2FD546809EACD187D7A5(class FName NotifyName);
	void OnFileRead(const struct FRemoteStorageFileReadAsyncComplete& Data, bool bWasSuccessful);
	void OnFileWrite(const struct FRemoteStorageFileWriteAsyncComplete& Data, bool bWasSuccessful);
	void OnInterrupted_286DF58A484E2FD546809EACD187D7A5(class FName NotifyName);
	void OnNotifyBegin_286DF58A484E2FD546809EACD187D7A5(class FName NotifyName);
	void OnNotifyEnd_286DF58A484E2FD546809EACD187D7A5(class FName NotifyName);
	void OnRep_PlayerCurrentSkin();
	void OnRep_Ready_();
	void OnRep_Steam_ID();
	void Play_Sounds__Server_(class USoundBase* Sound);
	void PlayerPlacement();
	void PlayerSkin__Server_(TArray<struct FST_DefaultSteamItem>& PlayerSkin);
	void PlayMontage();
	void Preview(bool ShowPreview, const struct FST_DefaultSteamItem& Item);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void RemovePreview();
	void UpdateAvatar(TSoftObjectPtr<class UTexture> Icon);
	void UpdateBadge__Server_(const struct FST_DefaultSteamItem& Badge_0);
	void UpdateFInalSkin__Client_();
	void UpdateInventory(const struct FST_DefaultSteamItem& NewItem);
	void UpdateMovement(const struct FST_DefaultSteamItem& ItemInfo, bool UpdateAnim_, bool UpdateCamera_);
	void UpdatePlayerSkin__Client_();
	void UpdateReady_HUD(bool Ready__0);
	void UpdateSaveCharacterSkin();
	void UpdateSkel__multicast_(TSoftObjectPtr<class USkeletalMesh> NewMesh);
	void UpdateSkel__Server_(TSoftObjectPtr<class USkeletalMesh> NewMesh);
	void UpdateWep__Multicast_(TSoftObjectPtr<class USkeletalMesh> NewMesh, const TArray<TSoftObjectPtr<class UMaterialInterface>>& CustomMaterials);
	void Upload_Steam_Save();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BC_ShowCase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BC_ShowCase_C")
	}
	static class ABP_BC_ShowCase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BC_ShowCase_C>();
	}
};

}

