#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ElectircalDoor

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ElectircalDoor.BP_ElectircalDoor_C
// 0x0070 (0x0318 - 0x02A8)
class ABP_ElectircalDoor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorClose;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorOpen_;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SphereConnection;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DoorOpen_Open_887FAB1C42295A9FB40B9BB20355C9E4;    // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DoorOpen__Direction_887FAB1C42295A9FB40B9BB20355C9E4; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DoorOpen;                                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          On_;                                               // 0x0300(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            DoorMesh;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DoesDoorAutoClose_;                                // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Open_;                                             // 0x0311(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void UpdatePowerGen__Multicast_();
	void UpdatePower(bool On__0, class AActor* Provider);
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);
	void SetLastSpecialZombieSpawnWave();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void ReceiveBeginPlay();
	void Pickup(class AActor* Owner_0);
	void OnRep_Open_();
	void OnRep_On_();
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void LeftClickReleaseEvent();
	void LeftClickEvent();
	void Item_Focus(class AActor* Instigator_0);
	void IsZombieCapReached_(bool* Yes);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void Interract(class APawn* Owner_0);
	void IncreaseTotalZombiesToSpawnInWave();
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void GetSocketToAttach(class FName* SocketToAttach);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetOffset(struct FTransform* Offset);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetItemPriority(int32* Priority);
	void ExecuteUbergraph_BP_ElectircalDoor(int32 EntryPoint);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ElectricalAction();
	void Drop(double Delay);
	void DoorOpen__UpdateFunc();
	void DoorOpen__FinishedFunc();
	void ConnectionInfos(const struct FLinearColor& Color);
	void CanSwap_(bool* IsItemSwap_);
	void CanSpawnSpecialZombie(bool* Yes);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void BossAlreadyInMap_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ElectircalDoor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ElectircalDoor_C")
	}
	static class ABP_ElectircalDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ElectircalDoor_C>();
	}
};

}

