#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Gear

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Gear.BP_Gear_C
// 0x0050 (0x02F8 - 0x02A8)
class ABP_Gear_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       WidgetFocus;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Mesh;                                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          PickedUp;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ID;                                                // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void AreAllWaveZombiesSpawned_(bool* Yes);
	void BossAlreadyInMap_(bool* Yes);
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanSpawnSpecialZombie(bool* Yes);
	void CanSwap_(bool* IsItemSwap_);
	void ConnectionInfos(const struct FLinearColor& Color);
	void Drop(double Delay);
	void ElectricalAction();
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ExecuteUbergraph_BP_Gear(int32 EntryPoint);
	void GetItemPriority(int32* Priority);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetOffset(struct FTransform* Offset);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetSocketToAttach(class FName* SocketToAttach);
	void GetWaves(int32* CurrentWaves);
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void IncreaseTotalZombiesToSpawnInWave();
	void Interact__Runs_On_Server_();
	void Interract(class APawn* Owner_0);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void IsZombieCapReached_(bool* Yes);
	void Item_Focus(class AActor* Instigator_0);
	void LeftClickEvent();
	void LeftClickReleaseEvent();
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void Pickup(class AActor* Owner_0);
	void ReceiveBeginPlay();
	void RegisterNewZombie();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void SetLastSpecialZombieSpawnWave();
	void SimulatePhysics(bool Yes_);
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);
	void UpdateGearVisibility__MultiCast_();
	void UpdatePower(bool On_, class AActor* Provider);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Gear_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Gear_C")
	}
	static class ABP_Gear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Gear_C>();
	}
};

}

