#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuSystemActor

#include "Basic.hpp"

#include "EInputDeviceType_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MenuSystemActor.BP_MenuSystemActor_C
// 0x0060 (0x0308 - 0x02A8)
class ABP_MenuSystemActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bLevelIsMainMenu;                                  // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UUserWidget>             MenuContainerInstantiator;                         // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   MenuCameras;                                       // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ACameraActor*>                   MenuCameras2;                                      // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void CreateAndShowMenu(class APlayerController* PlayerController, EInputDeviceType CurrentInputDevice, TSoftClassPtr<class UClass> FirstShownMenu, class UObject* Payload, bool IsMainMenuLevel);
	void CreateMenuContainer(EInputDeviceType ContainerInputDeviceType, TSoftClassPtr<class UClass> FirstShownMenu, class UObject* Payload, EInputDeviceType CurrentInputDevice, class APlayerController* PlayerController, bool IsMainMenuLevel);
	void DestroyMenu();
	void ExecuteUbergraph_BP_MenuSystemActor(int32 EntryPoint);
	void OnSetupErrorCheck(int32 CreatedByPlayerIndex);
	void Pause(class APlayerController* PlayerController, EInputDeviceType InputDeviceType);
	void ReceiveBeginPlay();
	void Resume(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MenuSystemActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MenuSystemActor_C")
	}
	static class ABP_MenuSystemActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MenuSystemActor_C>();
	}
};

}

