#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MenuSystemGameModeComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MenuSystemGameModeComponent.BP_MenuSystemGameModeComponent_C
// 0x0030 (0x00D0 - 0x00A0)
class UBP_MenuSystemGameModeComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bIsMainMenu;                                       // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              PlayerControllers;                                 // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerStart*>                   PlayerSpawnpoints;                                 // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_MenuSystemGameModeComponent(int32 EntryPoint);
	void GetPlayerStarts();
	void ReceiveBeginPlay();
	void RemoveLocalPlayers();
	void RemoveMainMenuPlayerAtIndex(int32 LocalPlayerIndex);
	void SpawnIngamePlayers(int32 LocalPlayerCount);
	void SpawnMainMenuPlayers(int32 LocalPlayerCount);
	void SpawnPlayers(int32 LocalPlayerCount);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MenuSystemGameModeComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MenuSystemGameModeComponent_C")
	}
	static class UBP_MenuSystemGameModeComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MenuSystemGameModeComponent_C>();
	}
};

}

