#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SettingsManager

#include "Basic.hpp"

#include "FEnhanchedActionKeyMappingWithContext_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EValueDataType_structs.hpp"
#include "Engine_structs.hpp"
#include "JsonUtilities_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SettingsManager.BP_SettingsManager_C
// 0x0110 (0x0138 - 0x0028)
class UBP_SettingsManager_C final : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPDA_MenuSystemConfig_C*                MenuSystemConfig;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bGameRequiresResolutionApply;                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWindowMode                                   WindowModeToApply;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              ResolutionToApply;                                 // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FKey>                CustomInputBindings;                               // 0x0048(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FFEnhanchedActionKeyMappingWithContext> CombinedInputBindings;          // 0x0098(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTimerHandle                           ApplyGameUserSettingsTimer;                        // 0x00E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 CustomInputMapName;                                // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FJsonObjectWrapper                     PlayerSystemConfigJson;                            // 0x0100(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPDA_SettingsData_C*                    WindowMode;                                        // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DelayedSaveTimer;                                  // 0x0128(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DelayedSoundClassApplyTimer;                       // 0x0130(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_and_Save_Custom_Settings_to_File();
	void ApplyConsoleCommand(const class FString& Command_Value, const struct FFConsoleCommandParameters& FConsoleCommandParameters, class UPDA_SettingsData_C* CurrentData);
	void ApplyGameUserSettingsToFile();
	void ConvertDataValueToUIValue(const class UPDA_SettingsData_C*& SettingsData, double DataValue, double UI_Value_Min, double UI_Value_Max, double* UI_Value);
	void ConvertMappedBooleanToUI_Index(class UPDA_SettingsData_C* SettingsData, const bool& StringValue, int32* Index_0);
	void ConvertMappedFloatToUI_Index(class UPDA_SettingsData_C* SettingsData, const double& FloatValue, int32* Index_0);
	void ConvertMappedIntegerToUI_Index(class UPDA_SettingsData_C* SettingsData, const int32& IntegerValue, bool bUseIntegerValueIfRawValue, int32* Index_0);
	void ConvertMappedStringToUI_Index(class UPDA_SettingsData_C* SettingsData, const class FString& StringValue, int32* Index_0);
	void ConvertUI_IndexToDataValueWithMapping(class UPDA_SettingsData_C* SettingsData, int32 Index_0, struct FFValueTypes* Value);
	double ConvertUIValueToDataValue(const class UPDA_SettingsData_C*& SettingsData, double UI_Value, double UI_Value_RangeMin, double UI_Value_RangeMax);
	void CreateCustomInputsConfigFile();
	void CreateDefaultInputBindings();
	void ExecuteUbergraph_BP_SettingsManager(int32 EntryPoint);
	void GetBooleanValue(class UPDA_SettingsData_C* SettingsData, bool* Success, bool* Value);
	void GetFloatValue(class UPDA_SettingsData_C* SettingsData, bool* Success, double* Value);
	void GetGameUserSettingsValue(const class UPDA_SettingsData_C*& SettingsData, int32* Index_0, double* Value, class FString* StringValue);
	void GetInputMap(const class FString& FieldName, TMap<class FName, struct FKey>* InputMap, bool* Success);
	void GetIntegerValue(class UPDA_SettingsData_C* SettingsData, bool* Success, int32* Value);
	void GetJsonConfigFilePath(struct FFilePath* FilePath);
	void GetStringValue(class UPDA_SettingsData_C* SettingsData, bool* Success, class FString* Value);
	void InitialApplySoundClasses();
	void Initialize();
	void LoadCustomSettingsFromFile();
	void LoadInputBindings(bool* bSuccess);
	void OnDelayedSaveToSettings();
	void OnFirstTimeSetup();
	void OnInitSoundClasses();
	void OnInitSoundClassesWithDelay();
	void OnSaveToSettings();
	void ResetCustomInputBindingsToDefault();
	void ResolutionToAspectRatio(const struct FIntPoint& Resolution, class FString* AspectRatio);
	void ResolutionToString(const struct FIntPoint& Resolution, class FString* String);
	void SaveCustomSettingsToFile(bool* Success);
	void SetAudioSettingsParameter(class UPDA_SettingsData_C* SettingsData, double CurrentValue);
	void SetBooleanValue(class UPDA_SettingsData_C* SettingsData, bool NewValue, bool* Success);
	void SetCombinedInputBindings(const TMap<class FName, struct FFEnhanchedActionKeyMappingWithContext>& CombinedInputBindings_0);
	void SetCustomInputBindings(const TMap<class FName, struct FKey>& CustomInputBindings_0);
	void SetFloatValue(class UPDA_SettingsData_C* SettingsData, double NewValue, bool* Success);
	void SetGameUserSettingsValue(const class UPDA_SettingsData_C*& SettingsData, const struct FFValueTypes& Value);
	void SetInputBindings(bool* bSuccess);
	void SetInputMap(const class FString& FieldName, const TMap<class FName, struct FFEnhanchedActionKeyMappingWithContext>& FieldValue, bool* Success);
	void SetIntegerValue(class UPDA_SettingsData_C* SettingsData, int32 NewValue, bool* Success);
	void SetStringValue(class UPDA_SettingsData_C* SettingsData, const class FString& NewValue, bool* Success);
	void StringToResolution(const class FString& ResolutionString, struct FIntPoint* Resolution);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SettingsManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SettingsManager_C")
	}
	static class UBP_SettingsManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SettingsManager_C>();
	}
};

}

