#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SprinterTraitComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseTraitComponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SprinterTraitComponent.BP_SprinterTraitComponent_C
// 0x0030 (0x00F0 - 0x00C0)
class UBP_SprinterTraitComponent_C final : public UBP_BaseTraitComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SprinterTraitComponent_C;        // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BoxCollision;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        JumperProbability;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumperCheckInterval;                               // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsJumper;                                          // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle_CheckJump;                             // 0x00E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Grab();
	void OnNotifyEnd_F41A724C4D7EFF541A34F480AC5D4B35(class FName NotifyName);
	void OnNotifyBegin_F41A724C4D7EFF541A34F480AC5D4B35(class FName NotifyName);
	void OnInterrupted_F41A724C4D7EFF541A34F480AC5D4B35(class FName NotifyName);
	void OnBlendOut_F41A724C4D7EFF541A34F480AC5D4B35(class FName NotifyName);
	void OnCompleted_F41A724C4D7EFF541A34F480AC5D4B35(class FName NotifyName);
	void ActivateTrait();
	void HandleBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void DeactivateTrait();
	void JumpAttack(class AActor* HitActor, double Distance, const struct FVector& VelocityDirection);
	void CheckForJumpAttack();
	void HandleRagdollStart();
	void HandleRagdollEnd();
	void ExecuteUbergraph_BP_SprinterTraitComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SprinterTraitComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SprinterTraitComponent_C")
	}
	static class UBP_SprinterTraitComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SprinterTraitComponent_C>();
	}
};

}

