#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponsBox

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponsBox.BP_WeaponsBox_C
// 0x0128 (0x03D0 - 0x02A8)
class ABP_WeaponsBox_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        LootBox_Open;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        WepSpawn;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_WeaponsBox;                                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        LootBox_Cue;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hay01_5;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hay01_4;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hay01_3;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_LightUpdate_F2CA54E04AA3794BAEA8468290AC0B3F; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_F2CA54E04AA3794BAEA8468290AC0B3F; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Float_862F109F468663F6212208A38FB686D0;   // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_862F109F468663F6212208A38FB686D0; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Weapons;                                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RespawnTime;                                       // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWeaponsBoxPreview_C*>           RandomLocation;                                    // 0x0348(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, ExposeOnSpawn)
	bool                                          Open_;                                             // 0x0358(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Location;                                          // 0x0360(0x0060)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ZombieSkin;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePower(bool On_, class AActor* Provider);
	void UpdateDoor__Multicast_();
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);
	void SpawnWep();
	void SetLastSpecialZombieSpawnWave();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void ReceiveBeginPlay();
	void RandomLocation__Server_();
	void Pickup(class AActor* Owner_0);
	void OnRep_Open_();
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void LeftClickReleaseEvent();
	void LeftClickEvent();
	void Item_Focus(class AActor* Instigator_0);
	void IsZombieCapReached_(bool* Yes);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void Interract(class APawn* Owner_0);
	void InitLightingAnimation();
	void InitBoxMusicSound();
	void IncreaseTotalZombiesToSpawnInWave();
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void GetSocketToAttach(class FName* SocketToAttach);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetOffset(struct FTransform* Offset);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetItemPriority(int32* Priority);
	void ExecuteUbergraph_BP_WeaponsBox(int32 EntryPoint);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ElectricalAction();
	void Drop(double Delay);
	void ConnectionInfos(const struct FLinearColor& Color);
	void CanSwap_(bool* IsItemSwap_);
	void CanSpawnSpecialZombie(bool* Yes);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void BossAlreadyInMap_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponsBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponsBox_C")
	}
	static class ABP_WeaponsBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponsBox_C>();
	}
};

}

