#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZombieSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Struct_SpawnData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZombieSpawner.BP_ZombieSpawner_C
// 0x0118 (0x03C0 - 0x02A8)
class ABP_ZombieSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Available_Speeds;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UPDA_Zombie_C*>                  PDAZombies;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         CurrentSpawned;                                    // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDelayBetweenSpawns;                             // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurrentSpawnLocation;                              // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDelayBetweenSpawns;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_SpawnData>              SpawnQueue;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStruct_SpawnData                      CurrentSpawnData;                                  // 0x0318(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShouldOverrideSpeed;                               // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                ForcedSpeeds;                                      // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsBusy;                                            // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WaveManagerComponent_C*             WaveManager;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         InvalidTries;                                      // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddToQueue(const struct FStruct_SpawnData& SpawnData);
	void CheckPlayerVisiblity(const struct FVector& SpawnLocation, bool* ValidSpawner);
	void Debug___QueueSize();
	void ExecuteUbergraph_BP_ZombieSpawner(int32 EntryPoint);
	void GetActiveTraitsForThisSpawn(TArray<class UClass*>* Traits);
	void InvalidBatch();
	void OverrideSpeed(TArray<double>& NewSpeeds);
	void PopFromQueue();
	void ReceiveBeginPlay();
	void ResetSpawnSoundAvailability();
	void SpawnGroup(int32 GroupSize, const TArray<double>& AvailableSpeeds, const TMap<class UClass*, int32>& SpawnTraitList, double ExpectedHealth, bool ShouldCommunicateDeath);
	void SpawnGroupInternal(const struct FStruct_SpawnData& SpawnData);
	void SpawnSingle(class UPDA_Zombie_C* ZombiePDA, TArray<class UClass*>& ActiveSpawnTraits, bool ShouldCommunicateDeath, class AZombie_C** Zombie);
	void TrySpawnSingle();
	void ZombieSounds__Multicast_(bool IsSprinter);

	struct FVector GetRandomSpawnLocation() const;
	void IsSpawnerBusy(bool* IsBusy_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ZombieSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ZombieSpawner_C")
	}
	static class ABP_ZombieSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZombieSpawner_C>();
	}
};

}

