#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPi_ProgressBars

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_Effects_structs.hpp"
#include "EMarqueeMask_structs.hpp"
#include "Slate_structs.hpp"
#include "EGradientTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EProgressMethod_structs.hpp"


namespace SDK::Params
{

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_AddEffect
// 0x0090 (0x0090 - 0x0000)
struct BPi_ProgressBars_C_PB_AddEffect final
{
public:
	struct FS_Effects                             Effect;                                            // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetEffects
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetEffects final
{
public:
	TArray<struct FS_Effects>                     Effects;                                           // 0x0000(0x0010)(Parm, OutParm)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetFillColor
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetFillColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetInterpTimeCurrent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_GetInterpTimeCurrent final
{
public:
	double                                        CurrentInterpTime;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetInterpTimeTarget
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_GetInterpTimeTarget final
{
public:
	double                                        TargetInterpTime;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetIsCustomMarquee
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_GetIsCustomMarquee final
{
public:
	bool                                          IsMarquee;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetIsMarquee
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_GetIsMarquee final
{
public:
	bool                                          IsMarquee;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetPercent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_GetPercent final
{
public:
	double                                        Percent;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetProgressMethod
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_GetProgressMethod final
{
public:
	EProgressMethod                               EProgressMethod;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetSeparationSteps
// 0x0004 (0x0004 - 0x0000)
struct BPi_ProgressBars_C_PB_GetSeparationSteps final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetSize
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetTargetFillColor_Negative
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetTargetFillColor_Negative final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetTargetFillColor_Positive
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_GetTargetFillColor_Positive final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetTargetPercent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_GetTargetPercent final
{
public:
	double                                        TargetPercent;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetThickness
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_GetThickness final
{
public:
	double                                        Thickness;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetUseGradientFillColor
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_GetUseGradientFillColor final
{
public:
	bool                                          UseGradientFillColor;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_GetUseTargetPercent
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_GetUseTargetPercent final
{
public:
	bool                                          UseTargetPercent;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_RemoveEffect
// 0x0004 (0x0004 - 0x0000)
struct BPi_ProgressBars_C_PB_RemoveEffect final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetAllEffectsEnabled
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetAllEffectsEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetBackgroundBlurStrength
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetBackgroundBlurStrength final
{
public:
	double                                        BlurStrength;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetBackgroundBrushTiling
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetBackgroundBrushTiling final
{
public:
	ESlateBrushTileType                           Tiling;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetBackgroundColorMask
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetBackgroundColorMask final
{
public:
	class UTexture2D*                             Mask;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetBlendMask
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetBlendMask final
{
public:
	class UTexture2D*                             BlendMask;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetCustomMarqueeImage
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetCustomMarqueeImage final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetCustomMarqueeMaskType
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetCustomMarqueeMaskType final
{
public:
	EMarqueeMask                                  MaskType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetEffectEnabled
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetEffectEnabled final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetEffects
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetEffects final
{
public:
	TArray<struct FS_Effects>                     Effects;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillColor
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillColorBrushTiling
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillColorBrushTiling final
{
public:
	ESlateBrushTileType                           Tiling;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillColorGradientPower
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillColorGradientPower final
{
public:
	double                                        GradientPower;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillColorGradientType
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillColorGradientType final
{
public:
	EGradientTypes                                GradientType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillColorMask
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillColorMask final
{
public:
	class UObject*                                Mask;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillFromCenterSpacing
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillFromCenterSpacing final
{
public:
	double                                        Spacing;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetFillType
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetFillType final
{
public:
	EProgressBarFillType                          FillType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetInterpTimeCurrent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetInterpTimeCurrent final
{
public:
	double                                        CurrentInterpTime;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetInterpTimeTarget
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetInterpTimeTarget final
{
public:
	double                                        TargetInterpTime;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetIsCustomMarquee
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetIsCustomMarquee final
{
public:
	bool                                          IsMarquee;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetIsMarquee
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetIsMarquee final
{
public:
	bool                                          IsMarquee;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetMarqueeImage
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetMarqueeImage final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetPercent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetPercent final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetProgressMethod
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetProgressMethod final
{
public:
	EProgressMethod                               EProgressMethod;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetSeparationAbsoluteFill
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetSeparationAbsoluteFill final
{
public:
	bool                                          AbsoluteFillMethod;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetSeparationSteps
// 0x0004 (0x0004 - 0x0000)
struct BPi_ProgressBars_C_PB_SetSeparationSteps final
{
public:
	int32                                         Steps;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetSeparationStepsSpacing
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetSeparationStepsSpacing final
{
public:
	double                                        Spacing;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetSize
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetSize final
{
public:
	struct FVector2D                              Size;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetTargetFillColor_Negative
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetTargetFillColor_Negative final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetTargetFillColor_Positive
// 0x0010 (0x0010 - 0x0000)
struct BPi_ProgressBars_C_PB_SetTargetFillColor_Positive final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetTargetPercent
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetTargetPercent final
{
public:
	double                                        TargetPercent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetThickness
// 0x0008 (0x0008 - 0x0000)
struct BPi_ProgressBars_C_PB_SetThickness final
{
public:
	double                                        Thickness;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetUseGradientFillColor
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetUseGradientFillColor final
{
public:
	bool                                          UseGradientFillColor;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPi_ProgressBars.BPi_ProgressBars_C.PB_SetUseTargetPercent
// 0x0001 (0x0001 - 0x0000)
struct BPi_ProgressBars_C_PB_SetUseTargetPercent final
{
public:
	bool                                          UseTargetPercent;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

