#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_GameInstanceExtension

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JsonUtilities_structs.hpp"


namespace SDK::Params
{

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.GetCurrentLevel
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceExtension_C_GetCurrentLevel final
{
public:
	class FName                                   CurrentLevelName;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.GetCurrentPlayTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceExtension_C_GetCurrentPlayTime final
{
public:
	double                                        PlayTimeInSeconds;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.GetSaveGameManager
// 0x0028 (0x0028 - 0x0000)
struct BPI_GameInstanceExtension_C_GetSaveGameManager final
{
public:
	TSoftObjectPtr<class UBP_SaveGameManager_C>   SaveGameManager;                                   // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.GetSettingsManager
// 0x0028 (0x0028 - 0x0000)
struct BPI_GameInstanceExtension_C_GetSettingsManager final
{
public:
	TSoftObjectPtr<class UBP_SettingsManager_C>   SettingsManager;                                   // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.OnLoadSettingsFromFile
// 0x0010 (0x0010 - 0x0000)
struct BPI_GameInstanceExtension_C_OnLoadSettingsFromFile final
{
public:
	struct FFilePath                              FilePath;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.OnOpenLevel
// 0x0020 (0x0020 - 0x0000)
struct BPI_GameInstanceExtension_C_OnOpenLevel final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAbsolute;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Options;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.OnSaveSettingsToFile
// 0x0030 (0x0030 - 0x0000)
struct BPI_GameInstanceExtension_C_OnSaveSettingsToFile final
{
public:
	struct FJsonObjectWrapper                     JsonObject;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFilePath                              FilePath;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.OnSetCurrentPlayTime
// 0x0008 (0x0008 - 0x0000)
struct BPI_GameInstanceExtension_C_OnSetCurrentPlayTime final
{
public:
	double                                        PlayTimeInSeconds;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_GameInstanceExtension.BPI_GameInstanceExtension_C.OnSetSoundClassVolume
// 0x0010 (0x0010 - 0x0000)
struct BPI_GameInstanceExtension_C_OnSetSoundClassVolume final
{
public:
	class USoundClass*                            SoundClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Volume;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

