#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraControlTable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_OverlayState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraControlTable.CameraControlTable_C
// 0x0060 (0x0308 - 0x02A8)
class ACameraControlTable_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       WidgetFocus;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraIndexMax;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CameraIndex;                                       // 0x02CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            Controller;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AALS_AnimMan_CharacterBP_C*             BaseCharacter;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCameraTransititon_C*                   CameraTransition__HUD_;                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACamera_C*                              Camera;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AALS_AnimMan_CharacterBP_C*>     Out_Actors;                                        // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         ActualCamIndex;                                    // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanSwap_(bool* IsItemSwap_);
	void Drop(double Delay);
	void ExecuteUbergraph_CameraControlTable(int32 EntryPoint);
	void Exit();
	void GetItemPriority(int32* Priority);
	void GetListOfPlayer(TArray<class AALS_AnimMan_CharacterBP_C*>* PlayersReturn);
	void GetOffset(struct FTransform* Offset);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetSocketToAttach(class FName* SocketToAttach);
	void Interract(class APawn* Owner_0);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void Interreact__Server_(class APawn* Target);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void Item_Focus(class AActor* Instigator_0);
	void LeftClickEvent();
	void LeftClickReleaseEvent();
	void Pickup(class AActor* Owner_0);
	void ReceiveBeginPlay();
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);
	void SwitchCamera(int32 Index_0);
	void Update_Nearest_Camera_to_Player(class APawn* Player, class ACamera_C** Camera_0);
	void UpdateTranistion__HUD_();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CameraControlTable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CameraControlTable_C")
	}
	static class ACameraControlTable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraControlTable_C>();
	}
};

}

