#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetEngine

#include "Basic.hpp"

#include "DataflowSimulation_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ChaosClothAssetEngine.ChaosClothComponent
// 0x00C0 (0x0950 - 0x0890)
class UChaosClothComponent final : public USkinnedMeshComponent
{
public:
	struct FDataflowSimulationAsset               SimulationAsset;                                   // 0x0890(0x0058)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         bUseAttachedParentAsPoseComponent : 1;             // 0x08E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bWaitForParallelTask : 1;                          // 0x08E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEnableSimulation : 1;                             // 0x08E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bSuspendSimulation : 1;                            // 0x08E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bBindToLeaderComponent : 1;                        // 0x08E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bTeleport : 1;                                     // 0x08E8(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bReset : 1;                                        // 0x08E8(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_8E9[0x3];                                      // 0x08E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendWeight;                                       // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ClothGeometryScale;                                // 0x08F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosClothAssetInteractor*             ClothOutfitInteractor;                             // 0x08F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_900[0x50];                                     // 0x0900(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollisionSource(class USkinnedMeshComponent* SourceComponent, const class UPhysicsAsset* SourcePhysicsAsset, bool bUseSphylsOnly);
	void ForceNextUpdateTeleport();
	void ForceNextUpdateTeleportAndReset();
	class UChaosClothAssetInteractor* GetClothOutfitInteractor();
	void RecreateClothSimulationProxy();
	void RemoveCollisionSource(const class USkinnedMeshComponent* SourceComponent, const class UPhysicsAsset* SourcePhysicsAsset);
	void RemoveCollisionSources(const class USkinnedMeshComponent* SourceComponent);
	void ResetCollisionSources();
	void ResetConfigProperties();
	void ResetTeleportMode();
	void ResumeSimulation();
	void SetClothAsset(class UChaosClothAsset* InClothAsset);
	void SetEnableSimulation(bool bEnable);
	void SuspendSimulation();

	class UChaosClothAsset* GetClothAsset() const;
	bool IsSimulationEnabled() const;
	bool IsSimulationSuspended() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosClothComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosClothComponent")
	}
	static class UChaosClothComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosClothComponent>();
	}
};

// Class ChaosClothAssetEngine.ChaosClothAsset
// 0x02A0 (0x0370 - 0x00D0)
class UChaosClothAsset final : public USkinnedAsset
{
public:
	uint8                                         Pad_D0[0x20];                                      // 0x00D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataflow*                              DataflowAsset;                                     // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FString                                 DataflowTerminal;                                  // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSkeletalMaterial>              Materials;                                         // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class USkeleton*                              Skeleton;                                          // 0x0118(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<struct FSkeletalMeshLODInfo>           LODInfo;                                           // 0x0128(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	struct FPerQualityLevelInt                    MinQualityLevelLOD;                                // 0x0138(0x0068)(Edit, NativeAccessSpecifierPrivate)
	struct FPerPlatformBool                       DisableBelowMinLodStripping;                       // 0x01A0(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerPlatformInt                        MinLOD;                                            // 0x01A4(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         bSupportRayTracing : 1;                            // 0x01A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RayTracingMinLOD;                                  // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSmoothTransition;                                 // 0x01B0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseMultipleInfluences;                            // 0x01B1(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkinningKernelRadius;                              // 0x01B4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicsAsset*                          ShadowPhysicsAsset;                                // 0x01B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FGuid                                  AssetGuid;                                         // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x1A0];                                    // 0x01D0(0x01A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPhysicsAsset* GetShadowPhysicsAsset() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosClothAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosClothAsset")
	}
	static class UChaosClothAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosClothAsset>();
	}
};

// Class ChaosClothAssetEngine.ChaosClothAssetInteractor
// 0x0010 (0x0038 - 0x0028)
class UChaosClothAssetInteractor final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFloatValue(const class FString& PropertyName, int32 LODIndex, float Value);
	void SetHighFloatValue(const class FString& PropertyName, int32 LODIndex, float Value);
	void SetIntValue(const class FString& PropertyName, int32 LODIndex, int32 Value);
	void SetLowFloatValue(const class FString& PropertyName, int32 LODIndex, float Value);
	void SetStringValue(const class FString& PropertyName, int32 LODIndex, const class FString& Value);
	void SetVectorValue(const class FString& PropertyName, int32 LODIndex, const struct FVector& Value);
	void SetWeightedFloatValue(const class FString& PropertyName, int32 LODIndex, const struct FVector2D& Value);

	TArray<class FString> GetAllProperties(int32 LODIndex) const;
	float GetFloatValue(const class FString& PropertyName, int32 LODIndex, float DefaultValue) const;
	float GetHighFloatValue(const class FString& PropertyName, int32 LODIndex, float DefaultValue) const;
	int32 GetIntValue(const class FString& PropertyName, int32 LODIndex, int32 DefaultValue) const;
	float GetLowFloatValue(const class FString& PropertyName, int32 LODIndex, float DefaultValue) const;
	class FString GetStringValue(const class FString& PropertyName, int32 LODIndex, const class FString& DefaultValue) const;
	struct FVector GetVectorValue(const class FString& PropertyName, int32 LODIndex, const struct FVector& DefaultValue) const;
	struct FVector2D GetWeightedFloatValue(const class FString& PropertyName, int32 LODIndex, const struct FVector2D& DefaultValue) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChaosClothAssetInteractor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosClothAssetInteractor")
	}
	static class UChaosClothAssetInteractor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosClothAssetInteractor>();
	}
};

}

