#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DAC_WeaponAttachment

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "BPE_WeaponSlots_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DAC_WeaponAttachment.DAC_WeaponAttachment_C
// 0x0078 (0x00A8 - 0x0030)
class UDAC_WeaponAttachment_C final : public UPrimaryDataAsset
{
public:
	EBPE_WeaponSlots                              Slot;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ItemName;                                          // 0x0038(0x0010)(Edit, BlueprintVisible)
	class FText                                   ItemDescription;                                   // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Pros;                                              // 0x0058(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Cons;                                              // 0x0068(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UStaticMesh>             StaticMeshReference;                               // 0x0078(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bShowStatsInUI;                                    // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DAC_WeaponAttachment_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DAC_WeaponAttachment_C")
	}
	static class UDAC_WeaponAttachment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDAC_WeaponAttachment_C>();
	}
};

}

