#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DAC_Weapon

#include "Basic.hpp"

#include "BPE_WeaponSlots_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DAC_Weapon.DAC_Weapon_C
// 0x0068 (0x0098 - 0x0030)
class UDAC_Weapon_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class USkeletalMesh>           MainWeaponMeshReference;                           // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   WeaponName;                                        // 0x0058(0x0010)(Edit, BlueprintVisible)
	class FText                                   WeaponDescription;                                 // 0x0068(0x0010)(Edit, BlueprintVisible)
	TArray<class UDAC_WeaponAttachment_C*>        AvailableAttachments;                              // 0x0078(0x0010)(Edit, BlueprintVisible)
	class FText                                   WeaponCategory;                                    // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void GetAttachmentsForSlot(EBPE_WeaponSlots Slot, TArray<class UDAC_WeaponAttachment_C*>* Attachments);

	void GetDefaultOptions(TMap<EBPE_WeaponSlots, class UDAC_WeaponAttachment_C*>* DefaultOptions) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DAC_Weapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DAC_Weapon_C")
	}
	static class UDAC_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDAC_Weapon_C>();
	}
};

}

