#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowSimulation

#include "Basic.hpp"

#include "DataflowCore_structs.hpp"


namespace SDK
{

// ScriptStruct DataflowSimulation.DataflowSimulationProxy
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FDataflowSimulationProxy
{
public:
	uint8                                         Pad_0[0x78];                                       // 0x0000(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowSimulation.DataflowCollisionObjectProxy
// 0x0000 (0x0078 - 0x0078)
struct FDataflowCollisionObjectProxy final : public FDataflowSimulationProxy
{
};

// ScriptStruct DataflowSimulation.DataflowConstraintObjectProxy
// 0x0000 (0x0078 - 0x0078)
struct FDataflowConstraintObjectProxy final : public FDataflowSimulationProxy
{
};

// ScriptStruct DataflowSimulation.DataflowPhysicsObjectProxy
// 0x0000 (0x0078 - 0x0078)
struct FDataflowPhysicsObjectProxy final : public FDataflowSimulationProxy
{
};

// ScriptStruct DataflowSimulation.DataflowPhysicsSolverProxy
// 0x0000 (0x0078 - 0x0078)
struct FDataflowPhysicsSolverProxy : public FDataflowSimulationProxy
{
};

// ScriptStruct DataflowSimulation.DataflowSimulationAsset
// 0x0058 (0x0058 - 0x0000)
struct FDataflowSimulationAsset final
{
public:
	class UDataflow*                              DataflowAsset;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSet<class FString>                           SimulationGroups;                                  // 0x0008(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowSimulation.DataflowSimulationProperty
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FDataflowSimulationProperty final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowSimulation.DataflowSimulationNode
// 0x0000 (0x0198 - 0x0198)
struct FDataflowSimulationNode : public FDataflowNode
{
};

// ScriptStruct DataflowSimulation.DataflowInvalidNode
// 0x0000 (0x0198 - 0x0198)
struct FDataflowInvalidNode : public FDataflowSimulationNode
{
};

// ScriptStruct DataflowSimulation.DataflowExecutionNode
// 0x0000 (0x0198 - 0x0198)
struct FDataflowExecutionNode : public FDataflowSimulationNode
{
};

// ScriptStruct DataflowSimulation.DataflowSimulationTime
// 0x000C (0x000C - 0x0000)
struct FDataflowSimulationTime final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTime;                                       // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeOffset;                                        // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowSimulation.GetSimulationTimeDataflowNode
// 0x0010 (0x01A8 - 0x0198)
struct FGetSimulationTimeDataflowNode final : public FDataflowInvalidNode
{
public:
	struct FDataflowSimulationTime                SimulationTime;                                    // 0x0198(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct DataflowSimulation.GetPhysicsSolversDataflowNode
// 0x0020 (0x01B8 - 0x0198)
struct FGetPhysicsSolversDataflowNode final : public FDataflowInvalidNode
{
public:
	TArray<struct FDataflowSimulationProperty>    PhysicsSolvers;                                    // 0x0198(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class FString>                         SimulationGroups;                                  // 0x01A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowSimulation.AdvancePhysicsSolversDataflowNode
// 0x0020 (0x01B8 - 0x0198)
struct FAdvancePhysicsSolversDataflowNode final : public FDataflowSimulationNode
{
public:
	struct FDataflowSimulationTime                SimulationTime;                                    // 0x0198(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataflowSimulationProperty>    PhysicsSolvers;                                    // 0x01A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowSimulation.FilterSimulationProxiesDataflowNode
// 0x0030 (0x01C8 - 0x0198)
struct FFilterSimulationProxiesDataflowNode final : public FDataflowSimulationNode
{
public:
	TArray<struct FDataflowSimulationProperty>    SimulationProxies;                                 // 0x0198(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FDataflowSimulationProperty>    FilteredProxies;                                   // 0x01A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class FString>                         SimulationGroups;                                  // 0x01B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// ScriptStruct DataflowSimulation.SimulationProxiesTerminalDataflowNode
// 0x0010 (0x01A8 - 0x0198)
struct FSimulationProxiesTerminalDataflowNode final : public FDataflowExecutionNode
{
public:
	TArray<struct FDataflowSimulationProperty>    SimulationProxies;                                 // 0x0198(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

}

