#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dragunov

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Dragunov.Dragunov_C
// 0x01E0 (0x05A0 - 0x03C0)
class UDragunov_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03D8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03F8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0440(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0568(0x0020)()
	class AWEP_C*                                 As_WEP;                                            // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        SliderBack;                                        // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Dragunov(int32 EntryPoint);
	void Init_Wep(class AWEP_C* WEP);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Dragunov_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Dragunov_C")
	}
	static class UDragunov_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragunov_C>();
	}
};

}

