#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EarlyBlendOut_NotifyState

#include "Basic.hpp"

#include "ALS_MovementState_structs.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "ALS_Stance_structs.hpp"
#include "ALS_RotationMode_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_Gait_structs.hpp"
#include "ALS_MovementAction_structs.hpp"
#include "ALS_ViewMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass EarlyBlendOut_NotifyState.EarlyBlendOut_NotifyState_C
// 0x0018 (0x0048 - 0x0030)
class UEarlyBlendOut_NotifyState_C final : public UAnimNotifyState
{
public:
	class UAnimMontage*                           ThisMontage;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BlendOutTime;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckMovementState;                                // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EALS_MovementState                            MovementStateEquals;                               // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckStance;                                       // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EALS_Stance                                   StanceEquals;                                      // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckMovementInput;                                // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const;
	bool Received_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EarlyBlendOut_NotifyState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EarlyBlendOut_NotifyState_C")
	}
	static class UEarlyBlendOut_NotifyState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEarlyBlendOut_NotifyState_C>();
	}
};

}

