#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FogZone

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Bodycam_classes.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass FogZone.FogZone_C
// 0x0088 (0x0340 - 0x02B8)
class AFogZone_C final : public ABaseZombieSpecialActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ZoneMesh;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MeshRadius;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartRadius;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        EndRadius;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        ZoneHeight;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MovingAlpha;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentStepRadius;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NextStepRadius;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovingAlphaDelta;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MovingTime;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CurrentStep;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          PawnOutZone;                                       // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        Damage;                                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToSurvive;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AreAllWaveZombiesSpawned_(bool* Yes);
	void BossAlreadyInMap_(bool* Yes);
	void CanSpawnSpecialZombie(bool* Yes);
	void CheckPlayerOutZOne();
	void ConnectionInfos(const struct FLinearColor& Color);
	void ElectricalAction();
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ExecuteUbergraph_FogZone(int32 EntryPoint);
	void FarestPlayers(class AActor** FarestPlayer, float* Distance);
	void Get_Radius(double* CurrentStepRadius_0, double* NextStepRadius_0);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetWaves(int32* CurrentWaves);
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void IncreaseTotalZombiesToSpawnInWave();
	void IsZombieCapReached_(bool* Yes);
	void Move_Zone();
	void MoveZoneTick();
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void ReceiveBeginPlay();
	void RegisterNewZombie();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void SetLastSpecialZombieSpawnWave();
	void SpawnSprinter();
	void UpdatePower(bool On_, class AActor* Provider);
	void UpdateTimingToSurvive();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FogZone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FogZone_C")
	}
	static class AFogZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFogZone_C>();
	}
};

}

