#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FValueConversionParameters

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FValueConversionParameters.FValueConversionParameters
// 0x0050 (0x0050 - 0x0000)
struct FFValueConversionParameters final
{
public:
	struct FVector2D                              NormalizeFloatToRange_23_3C86FD944D0ABC809F9A7382DC88D369; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         IndexToStringMapping_24_3926370145984438807713A36F1825D4; // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 IndexToIntegerMapping_25_F0A487C94069E3E52CA2C69A18973147; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                IndexToFloatMapping_26_78EAEAF745972D99AF7242886CAF5A34; // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<bool>                                  IndexToBooleanMapping_27_5D0C1D1840C2DDAB851AB19E98120624; // 0x0040(0x0010)(Edit, BlueprintVisible)
};

}

