#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_Bodycam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STR_PCInfo_structs.hpp"
#include "GameMode_structs.hpp"
#include "E_Team_structs.hpp"
#include "GM_Statue_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_Bodycam.GM_Bodycam_C
// 0x00C8 (0x0408 - 0x0340)
class AGM_Bodycam_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_MenuControllerComponent_C*          BP_MenuControllerComponent;                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MenuSystemGameModeComponent_C*      BP_MenuSystemGameModeComponent;                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Match_End;                                         // 0x0360(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGT_Bodycam_C*                          As_GT_Bodycam;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ACharacter*>                     DeadBodies;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         MaxDeadBodies;                                     // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_PCInfo>                    WinningTeam;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FSTR_PCInfo>                    LoosingTeam;                                       // 0x0398(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AController*>                    ConnectedPlayers;                                  // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         UniquePlayerID;                                    // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Kick_Reason;                                       // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PartyEnd;                                          // 0x03D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    Exiting_Controller;                                // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Debug_;                                            // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     DebugGamemode;                                     // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodycamGI_C*                           As_Bodycam_GI;                                     // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HostAloneDebug;                                    // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bots_Method;                                       // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugBotsMethod;                                   // 0x03FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB[0x1];                                      // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BotsRpointsDivider;                                // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AccessReward;                                      // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Lobby_Access_Method;                               // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BotsToDestroylater;                                // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void AssignTeam(const struct FSTR_PCInfo& PC, E_Team Team);
	void Bots_Method_(bool* Bots_Method_0);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CalcRankPoint(bool Win_, const struct FSTR_PCInfo& Player, int32* RankPoints);
	void CalcRpoint(TArray<struct FSTR_KillInfo>& KillList, int32* RpointsReturn);
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void Choose_Team(E_Team* Postion);
	void ClearMap();
	void ClearMapAndRestartPlayer(bool RestartMatch_);
	void EndMatch();
	void EndRound(E_Team Force_Team_Win);
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_GM_Bodycam(int32 EntryPoint);
	void FindPlayerSpawn(const class FString& Name_0, struct FTransform* SpawnTransform);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetHealth(double* Health);
	void GetKDPlayer(const struct FSTR_PCInfo& Player, int32* KD);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerNetIDsRanked(TArray<struct FUniqueNetIdRepl>* NetIdsRanked);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetRandomSkinListAI(TArray<struct FST_DefaultSteamItem>* AllSkinListFinalReturn);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetTeamsRankedOrder(E_Team WinningTeam_0, TArray<class FString>* Result);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP);
	void InitScoreBoard();
	void InitVoteNextMap();
	void IsAllRoundFinish();
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void isMatchEnd(bool* MatchEnd_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void K2_OnLogout(class AController* ExitingController);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void Kick_(const struct FSTR_PCInfo& Target);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void OnFailure_8A42DE6347105B39DCAB34917B8E2F88();
	void OnFailure_F5306C1A49ACABB190EB57BD949BFF28();
	void ONLOGOUT(const class AController*& NewItem);
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnSuccess_8A42DE6347105B39DCAB34917B8E2F88();
	void OnSuccess_F5306C1A49ACABB190EB57BD949BFF28();
	void OnTrySelectTeam(E_Team Team);
	void PlaySoundLocal(class USoundCue* Audio);
	void ReceiveBeginPlay();
	void RefreshMapVoterPlayerID();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void SelectBotToDestroy(class APawn** Character, int32* Index_in_Player_Infos);
	void ServerTravel(double Delay, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void Slomo(double Slomo_0);
	void SpawnBots();
	void SpawnVoteNextMap_Hud_();
	void Talk(bool IsTalking);
	void TryClearExtraBots();
	void TryDeathMatchEnd();
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateGamemode(EGameMode GameMode);
	void UpdateIsMatchEnd();
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateWarning(const class FString& String);
	void UpdateXPAndTransition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GM_Bodycam_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GM_Bodycam_C")
	}
	static class AGM_Bodycam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_Bodycam_C>();
	}
};

}

