#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_Zombie

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Team_structs.hpp"
#include "EN_WaveClass_structs.hpp"
#include "STR_ZombieMapInfo_structs.hpp"
#include "GameMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_Zombie.GM_Zombie_C
// 0x00F8 (0x0438 - 0x0340)
class AGM_Zombie_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SpecialZombieManagerComponent_C*    BP_SpecialZombieManagerComponent;                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ZoneManagerComponent_C*             BP_ZoneManagerComponent;                           // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WaveManagerComponent_C*             BP_WaveManagerComponent;                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MenuSystemGameModeComponent_C*      BP_MenuSystemGameModeComponent;                    // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Wave;                                              // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Zombie_Amount;                                     // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalZombiesToSpawnInWave;                         // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAliveZombies;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SPEEDZ;                                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGT_zombie_C*                           GT_Zombie;                                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ZombieDead;                                        // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_WaveClass                                  EN_WaveClass;                                      // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Exiting_Controller;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                AvailableSpeed;                                    // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ZombieHealth;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Chrono;                                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_ZombieMapInfo                     MapZombieInfo;                                     // 0x03C0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    DataTable;                                         // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          SurviveToChrono_;                                  // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ZombieRules                                ZombieRule;                                        // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LatestSpecialZombieSpawnWave;                      // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         minWavesBeforeSpecialZombieRespawn;                // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void AreAllWaveZombiesSpawned_(bool* Yes);
	void BndEvt__GM_Zombie_BP_WaveManagerComponent_K2Node_ComponentBoundEvent_0_OnWaveStarted__DelegateSignature(int32 WaveNumber);
	void BndEvt__GM_Zombie_BP_WaveManagerComponent_K2Node_ComponentBoundEvent_1_OnWaveEnded__DelegateSignature(int32 WaveNumber);
	void BossAlreadyInMap_(bool* Yes);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	bool CanReachDestination(const struct FVector& PathStart, const struct FVector& PathEnd);
	void CanSpawnSpecialZombie(bool* Yes);
	void ClearMap();
	void ConnectionInfos(const struct FLinearColor& Color);
	void DestroyAllDeadbodies();
	void ElectricalAction();
	void EndWave(int32 Wave_0, EN_WaveClass EN_WaveClass_0);
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_GM_Zombie(int32 EntryPoint);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerAlives(TArray<class AALS_AnimMan_CharacterBP_C*>* Players_Alives_Return);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayersDeaths(TArray<class APC_Zombie_C*>* Players_Alives_Return);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetPS5MatchPlayerStats(int32 InputWave, TMap<struct FUniqueNetIdRepl, struct FBodycamPS5MatchStorage>* Stats);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetRandomSpeedForZombies();
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWaves(int32* CurrentWaves);
	void GetWep(class AWEP_C** WEP);
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetZombiesAlives(TArray<class AZombie_C*>* ZombiesAlives_Return);
	void GetZombiesDeaths(TArray<class AZombie_C*>* ZombiesDeaths_Return);
	void IncreaseTotalZombiesToSpawnInWave();
	void InitScoreBoard();
	void InitVoteNextMap();
	void Is_All_Players_Dead(bool* AllPlayersDead_Return);
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void IsZombieCapReached_(bool* Yes);
	void K2_OnLogout(class AController* ExitingController);
	void Kick_(const struct FSTR_PCInfo& Target);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void KillAllZombies();
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void NewWaves(int32 Wave_0, EN_WaveClass EN_WaveClass_0);
	void OnFailure_EEE454FD4EEB963BA475C69C7B4D55FF();
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnSuccess_EEE454FD4EEB963BA475C69C7B4D55FF();
	void OnTrySelectTeam(E_Team Team);
	void PlaySoundLocal(class USoundCue* Audio);
	void ReceiveBeginPlay();
	void RefreshMapVoterPlayerID();
	void RegisterNewZombie();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void RespawnDeadPlayer();
	void ServerTravel(double Delay, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void SetLastSpecialZombieSpawnWave();
	void Slomo(double Slomo_0);
	void SpawnVoteNextMap_Hud_();
	void StopZombie();
	void Talk(bool IsTalking);
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateChrono();
	void UpdateGamemode(EGameMode GameMode);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdatePower(bool On_, class AActor* Provider);
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateWarning(const class FString& String);
	void Victory();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GM_Zombie_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GM_Zombie_C")
	}
	static class AGM_Zombie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_Zombie_C>();
	}
};

}

