#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GT_Bodycam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameMode_structs.hpp"
#include "STR_KickVote_structs.hpp"
#include "STR_GamemodeWinInfo_structs.hpp"
#include "GM_Statue_structs.hpp"
#include "STR_Loadout_structs.hpp"
#include "STR_PCInfo_structs.hpp"
#include "STR_Actor_structs.hpp"
#include "STR_VoteNextMapInfo_structs.hpp"
#include "E_Team_structs.hpp"
#include "Bodycam_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GT_Bodycam.GT_Bodycam_C
// 0x0270 (0x0570 - 0x0300)
class AGT_Bodycam_C final : public AGameStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SlomoCurve_SlomoTrack_986C145944DF5F5EC7A204A24EBAE991; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SlomoCurve__Direction_986C145944DF5F5EC7A204A24EBAE991; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SlomoCurve;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_Loadout>                   StartWeapons;                                      // 0x0320(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	double                                        TimeCount;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_PCInfo>                    Player_Connected;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	EGM_Statue                                    GM_Statue;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerMiss;                                        // 0x0349(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     GameMode;                                          // 0x034A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34B[0x1];                                      // 0x034B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PrimaryScope;                                      // 0x034C(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondaryScope;                                    // 0x0354(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_KickVote>                  Player_KickVote;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   Kick_Reason;                                       // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ServerSteamID;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FirstRound;                                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerHasBombID;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                         ListPlayerKicked;                                  // 0x03A8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                         AttempsToSpawn;                                    // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTR_GamemodeWinInfo                   GamemodeInfo;                                      // 0x03C0(0x00C8)(Edit, BlueprintVisible, Net, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ABombe_C>                Bomb;                                              // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FSTR_Actor>                     RandomMainWeapons;                                 // 0x04B0(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class AGM_Bodycam_C*                          As_GM_Bodycam;                                     // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBodycamGI_C*                           Bodycam_GI;                                        // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimerCurrent;                                      // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IntroTimerCurrent;                                 // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intro_Timer_Goal;                                  // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VoteMapTimer;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	double                                        VoteMapTimerMax;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_VoteNextMapInfo>           PlayerVoteNextMapList;                             // 0x04F8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class FString, int32>                    VotedMapIndex;                                     // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>> Allowed_Levels;                               // 0x0558(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                         HowManyLevelsToShow;                               // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Team                                        Team_Winning_Current_Round;                        // 0x056C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameEnd;                                           // 0x056D(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void AIListInTeam(TArray<struct FSTR_PCInfo>& Team, TArray<struct FSTR_PCInfo>* AIArrayReturn, TArray<struct FSTR_PCInfo>* PlayerArrayReturn);
	void AllowedLevels();
	void AnyBombExist(class ABombe_C** Bomb_0);
	void BombIsActive(class ABombe_C* Bomb_0, bool* BombActive_);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CalcTeamKillTotal(int32* MilitaryKill_Return, int32* TerroristKill_Return, E_Team* Team_Win);
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void ClearMap();
	void DeseableTk__Multicast_();
	void EndVoteNextMap();
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_GT_Bodycam(int32 EntryPoint);
	void Find_Best_Spawn_Point(const struct FSTR_PCInfo& PCInfo, struct FTransform* FarestTransform_return, bool* Success_);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode_0);
	void GetGamemodeInfo(struct FSTR_GamemodeWinInfo* GamemodeInfo_0);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMapVotersPlayerID(const class FString& LevelName, TArray<struct FSTR_VoteNextMapInfo>* VoterId_Return);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMostVotedMap(class FString* MostVotedMap);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP);
	void GlobalUpdate__HUD_PC_();
	void Index_Team_Alive(int32* IndexMilitaryAlive_Return, int32* IndexTerroristAlive_Return, TArray<struct FSTR_PCInfo>* MilitaryTeam_Return, TArray<struct FSTR_PCInfo>* TerroristTeam_Return, E_Team* DominantAliveTeam);
	void InitScoreBoard();
	void InitVoteNextMap();
	void IntroMatch();
	void Is_Match_Point_(bool* Is_Match_Point__0);
	void Is_Player_Already_Voted_Map__(const struct FSTR_VoteNextMapInfo& PlayerVote, bool* Yes_, int32* VoteIndex);
	void Is_Spawn_Point_Valid(const struct FTransform& Spawn_Transform, bool* Valid_);
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void Kick_(const struct FSTR_PCInfo& Target);
	void Kick___Server_(const struct FSTR_PCInfo& PlayerInfo);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void KickPlayer__Server_(const struct FSTR_KickVote& NewItem);
	void Kill_List_Info(TArray<struct FSTR_KillInfo>& KillList, int32* KillIndexReturn, int32* TeamKillIndexReturn);
	void MatchBeginTimer();
	void Multicast___CommunicateServerTravel();
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void Not_Enough_Player_To_Play(bool* NotEnoughPlayer_);
	void OnFailure_CF1F22D2456BC42D0080E898B344F08A();
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnRep_GM_statue();
	void OnRep_PlayerMiss();
	void OnRep_PrimaryScope();
	void OnRep_SecondaryScope();
	void OnRep_VoteMapTimer();
	void OnSuccess_CF1F22D2456BC42D0080E898B344F08A();
	void OnTrySelectTeam(E_Team Team);
	void OppositeTeam(E_Team Team, E_Team* OppositeTeam_0);
	void Pause_Match_Timer();
	void Stop_End_Round_Sound__Multicast_(bool Stop_);
	void PlayerWaitedArray(TArray<struct FSTR_PCInfo>* PlayerWaited_Return, class FString* PlayerSteamName_Return);
	void PlaySoundLocal(class USoundCue* Audio);
	void RandomStuff();
	void ReceiveBeginPlay();
	void RefreshMapVoterPlayerID();
	void RefreshMapVoterPlayerID__Mutlicast_(TArray<struct FSTR_VoteNextMapInfo>& PlayerVoteNextMapList_0);
	void RefreshScoreBoard();
	void ResetIntroTimer();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	E_Team SelectTeam(E_Team FriendTeam, bool IsPlayerAsking);
	void ServerSteamID__Server_();
	void ServerTravel(double Delay, const class FString& Level);
	void ServerTravel__Multicast_();
	void ServerTravel__server_(float duration, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb_0);
	void Slomo(double Slomo_0);
	void Slomo__multicast_();
	void SlomoCurve__FinishedFunc();
	void SlomoCurve__UpdateFunc();
	void SpawnUI();
	void SpawnVoteNextMap_Hud_();
	void SpawnWinHud__server_();
	void StartingWeapons();
	void StartMatch();
	void Talk(bool IsTalking);
	void TeamAlive_(E_Team Team, int32* AlivesIndex_Return, bool* TeamAllDead);
	void TeamFull_(E_Team Team, bool IsPlayerAsking, bool* Full_);
	void TeamHasBomb(E_Team* Team_Has_Bomb);
	void TeamHasBombArray(TArray<struct FSTR_PCInfo>* Team_Has_Bomb_Return, TArray<struct FSTR_PCInfo>* Other_Team_Return);
	void TeamHaveBestScore(E_Team* WinningTeamEnumReturn, TArray<struct FSTR_PCInfo>* WinningTeam_Return, TArray<struct FSTR_PCInfo>* LoosingTeam_Return);
	void TeamIndex(int32* NoneIndex_Return, int32* MilitaryIndex_Return, int32* TerroristIndex_Return, E_Team* TeamNeedPlayer, bool* TeamEmpty_, TArray<struct FSTR_PCInfo>* Military_Return, TArray<struct FSTR_PCInfo>* Terrorist_Return);
	void Teams_Score_Are_Null_(bool* FirstRound_0);
	void TeamScore(E_Team Team, int32* Score);
	void TimerSounds(double Timer);
	void TopScore(TArray<struct FSTR_PCInfo>* TopScorePcArray_Result);
	void TryToStartMatch();
	void Update_MapSelection__Hud_MenuScoreboard_(class FName Selected_Level_Name, int32 Index_0);
	void Update_Match_Timer_();
	void Update_ModeInfo__HUD_PC_();
	void Update_transition__Hud_Transition_();
	void Update_Vote_Timer_Text(double TimerIndex);
	void Update_Waiting_For_Player__HUD_PC_();
	void Update_Warning_Hud_Client_(const class FString& InText);
	void UpdateGamemode(EGameMode GameMode_0);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateMapVoteTimerText(double Vote);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateVote__Server_(const struct FSTR_PCInfo& Player_info, bool Yes_);
	void UpdateVoteMapTimer();
	void UpdateWarning(const class FString& String);
	void WaitingForPlayer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GT_Bodycam_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GT_Bodycam_C")
	}
	static class AGT_Bodycam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGT_Bodycam_C>();
	}
};

}

