#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GT_Lobby

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STR_PCInfo_structs.hpp"
#include "ServerSlotEN_structs.hpp"
#include "STR_KickVote_structs.hpp"
#include "GameMode_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "E_Team_structs.hpp"
#include "SteamCoreShared_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GT_Lobby.GT_Lobby_C
// 0x01B8 (0x04B8 - 0x0300)
class AGT_Lobby_C final : public AGameStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_PCInfo>                    Player_Connected;                                  // 0x0310(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference)
	EGameMode                                     Game_Mode;                                         // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServerSteamID;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Kick_Reason;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTR_KickVote>                  Player_KickVote;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FString>                         Ready_Players;                                     // 0x0358(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FName                                   LevelsName;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                Session_Result;                                    // 0x0370(0x0120)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	struct FSteamID                               Steam_Id_Users;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor)
	class UPDA_LevelMetaData_C*                   Level_Meta_Data;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EServerSlotEN                                 Config;                                            // 0x04A0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeToJump;                                        // 0x04A1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A2[0x6];                                      // 0x04A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamSessionSetting>           Array_Element_Session_Settings;                    // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void AllPlayerJoinSeverByRef__Multicast_(const class FString& SessionToJoin__Client_, const TArray<struct FSTR_PCInfo>& FriendsLobby);
	void AllPlayerJoinSeverByRef__Server_(const class FString& SessionToJoin__Client_);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void ClearMap();
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_GT_Lobby(int32 EntryPoint);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP);
	void InitScoreBoard();
	void InitVoteNextMap();
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void JumpPlane__Server_(class FName LevelsName_0, bool Plane_Jump_);
	void Kick_(const struct FSTR_PCInfo& Target);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void LobbyPlacement();
	void Multicast___CommunicateServerTravel();
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void OnFailure_E2384D204E813F9868BF5D97A5536002();
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnRep_GamemodeIndex();
	void OnRep_MapIndex();
	void OnRep_Player_Connected();
	void OnRep_TimeToJump();
	void OnSuccess_E2384D204E813F9868BF5D97A5536002();
	void OnTrySelectTeam(E_Team Team);
	void OpenGates__Multicast_();
	void PlaySoundLocal(class USoundCue* Audio);
	void ReceiveBeginPlay();
	void RefreshMapVoterPlayerID();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void ServerSteamID__Server_();
	void ServerTravel(double Delay, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void Slomo(double Slomo_0);
	void SpawnVoteNextMap_Hud_();
	void StartServerTravel(bool* CanServerTravel);
	void Talk(bool IsTalking);
	void TeamIndex(int32* NoneIndex_Return, int32* MilitaryIndex_Return, int32* TerroristIndex_Return, E_Team* TeamNeedPlayer, bool* TeamEmpty_);
	void TopScore(TArray<struct FSTR_PCInfo>* TopScorePcArray_Result);
	void Try_Launch_(bool* CanLauch_);
	void Update_Player_Placement();
	void Update_Player_Placement__Multicast_();
	void Update_Player_Placement__Server_();
	void Update_Session_Config(const struct FBlueprintSessionResult& SessionResult, const struct FSteamID& SteamIdUsers, class UPDA_LevelMetaData_C* Level_Meta_Data_0, EServerSlotEN Config_0, EGameMode GameMode, const TArray<struct FSteamSessionSetting>& ArrayElement_Session_Settings);
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateGamemode(EGameMode GameMode);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateWarning(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GT_Lobby_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GT_Lobby_C")
	}
	static class AGT_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGT_Lobby_C>();
	}
};

}

