#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GT_zombie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STR_PCInfo_structs.hpp"
#include "STR_KickVote_structs.hpp"
#include "GM_Statue_structs.hpp"
#include "E_Team_structs.hpp"
#include "GameMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GT_zombie.GT_zombie_C
// 0x0060 (0x0360 - 0x0300)
class AGT_zombie_C final : public AGameStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_PCInfo>                    Player_Connected;                                  // 0x0310(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FSTR_KickVote>                  Player_KickVote;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                   Kick_Reason;                                       // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         ListPlayerKicked;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	EGM_Statue                                    GM_Statue;                                         // 0x0350(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_WaveManagerComponent_C*             WaveManagerComponent;                              // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void ClearMap();
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_GT_zombie(int32 EntryPoint);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetGamemodeInfo(struct FSTR_GamemodeWinInfo* GamemodeInfo);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP);
	void HandleWaveEnded(int32 WaveNumber);
	void HandleWaveStarted(int32 WaveNumber);
	void InitScoreBoard();
	void InitVoteNextMap();
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void Kick_(const struct FSTR_PCInfo& Target);
	void Kick___Server_(const struct FSTR_PCInfo& PlayerInfo);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void KickPlayer__Server_(const struct FSTR_KickVote& NewItem);
	void Multicast___UpdateAchievements(float IncrementValue);
	void MuteID(const class FString& SteamID);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnTrySelectTeam(E_Team Team);
	void PlayEndWaveSound__Multicast_(class USoundBase* Sound, bool IsLocatedSound, const struct FVector& SoundLocation);
	void PlaySoundLocal(class USoundCue* Audio);
	void PlayStartWaveSound__Multicast_(class USoundBase* Sound, bool IsLocatedSound, const struct FVector& SoundLocation);
	void ReceiveBeginPlay();
	void RefreshMapVoterPlayerID();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void ServerTravel(double Delay, const class FString& Level);
	void ServerTravel__Multicast_();
	void ServerTravel__server_(float duration);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void Slomo(double Slomo_0);
	void SpawnVoteNextMap_Hud_();
	void SpawnWinHud__server_(int32 Wave, double Chrono);
	void Talk(bool IsTalking);
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateGamemode(EGameMode GameMode);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateVote__Server_(const struct FSTR_PCInfo& Player_info, bool Yes_);
	void UpdateWarning(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GT_zombie_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GT_zombie_C")
	}
	static class AGT_zombie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGT_zombie_C>();
	}
};

}

