#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hud_ZombieWavesDebug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Hud_ZombieWavesDebug.Hud_ZombieWavesDebug_C
// 0x0028 (0x02F8 - 0x02D0)
class UHud_ZombieWavesDebug_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             WavesIndex;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZombieCurrentIndex;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZombieDied;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ZombieIndex;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Hud_ZombieWavesDebug(int32 EntryPoint);
	void UpdateCurrentZombieDied(const class FString& Index_0);
	void UpdateCurrentZombiesInWaves(const class FString& Index_0);
	void updateDebugInfo(const class FText& InText, const class FText& InText2);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Hud_ZombieWavesDebug_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Hud_ZombieWavesDebug_C")
	}
	static class UHud_ZombieWavesDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHud_ZombieWavesDebug_C>();
	}
};

}

