#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_InteractableMenu_classes.hpp"
#include "E_Team_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_Character.HUD_Character_C
// 0x0098 (0x0470 - 0x03D8)
class UHUD_Character_C final : public UWBP_InteractableMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HUD_Character_C;                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnnonceAnim;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DeadHeadShot;                                      // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DEAD;                                              // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Talk;                                              // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WaitingPlayer;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blur;                                              // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Init;                                              // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Damage;                                            // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CONNECTED;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DISCONNECTED;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_VoipIndicator;                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VHS_TEX;                                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vhs_C*                             WBP_Vhs;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AGT_Bodycam_C*                          As_GT_Bodycam;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayerTarget;                                 // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActualActorsIndicator;                             // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          FirstTimePlayerSpawned_;                           // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void _Loose__Message_Info();
	void ANNONCE(const class FText& Twond_Title_Text, const class FText& Threend_Title_Text, const class FText& Fournd_Title_Text, const class FText& Fivend_Title_Text, const struct FLinearColor& Twond_Title_Text_Color, const struct FLinearColor& Threend_Title_Text_Color, bool Anim_, bool VHS__, class USoundBase* Sound);
	void BlurEvent(double Distance);
	void BreakTimer();
	void CheckVerticalBox();
	void Construct();
	void DamageEvent(double Damage_0);
	void DeadEvent();
	void Destruct();
	void ExecuteUbergraph_HUD_Character(int32 EntryPoint);
	void Finished_431E2FE2467703617477CF9908CB5FA6();
	void RefreshVOIPList(bool Add_, class AActor* ActorRef);
	void Talking(bool Condition);
	void Update_Game_State_Message_Info();
	void UpdateCameraBattery();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HUD_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUD_Character_C")
	}
	static class UHUD_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_Character_C>();
	}
};

}

