#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_Warning

#include "Basic.hpp"


namespace SDK::Params
{

// Function HUD_Warning.HUD_Warning_C.ExecuteUbergraph_HUD_Warning
// 0x0020 (0x0020 - 0x0000)
struct HUD_Warning_C_ExecuteUbergraph_HUD_Warning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0010(0x0010)()
};

// Function HUD_Warning.HUD_Warning_C.Update (Warning)
// 0x0010 (0x0010 - 0x0000)
struct HUD_Warning_C_Update__Warning_ final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

