#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hud_ZombieWavesDebug

#include "Basic.hpp"


namespace SDK::Params
{

// Function Hud_ZombieWavesDebug.Hud_ZombieWavesDebug_C.ExecuteUbergraph_Hud_ZombieWavesDebug
// 0x00E8 (0x00E8 - 0x0000)
struct Hud_ZombieWavesDebug_C_ExecuteUbergraph_Hud_ZombieWavesDebug final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0010)()
	class FText                                   K2Node_CustomEvent_InText2;                        // 0x0018(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0010)()
	class FString                                 K2Node_CustomEvent_Index_1;                        // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00A8(0x0010)()
	class FString                                 K2Node_CustomEvent_Index;                          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x00D8(0x0010)()
};

// Function Hud_ZombieWavesDebug.Hud_ZombieWavesDebug_C.UpdateCurrentZombieDied
// 0x0010 (0x0010 - 0x0000)
struct Hud_ZombieWavesDebug_C_UpdateCurrentZombieDied final
{
public:
	class FString                                 Index_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Hud_ZombieWavesDebug.Hud_ZombieWavesDebug_C.UpdateCurrentZombiesInWaves
// 0x0010 (0x0010 - 0x0000)
struct Hud_ZombieWavesDebug_C_UpdateCurrentZombiesInWaves final
{
public:
	class FString                                 Index_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};

// Function Hud_ZombieWavesDebug.Hud_ZombieWavesDebug_C.updateDebugInfo
// 0x0020 (0x0020 - 0x0000)
struct Hud_ZombieWavesDebug_C_updateDebugInfo final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InText2;                                           // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

}

