#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Inventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STR_Actor_structs.hpp"
#include "GameMode_structs.hpp"
#include "E_Team_structs.hpp"
#include "ALS_OverlayState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Inventory.Inventory_C
// 0x0070 (0x0110 - 0x00A0)
class UInventory_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         InventorySlots;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate)
	int32                                         MaxSlots;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AALS_Base_CharacterBP_C*                Owner;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Index_Equiped;                             // 0x00C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         New_Index_Equiped;                                 // 0x00CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Default;                                           // 0x00D0(0x0010)(Edit, BlueprintVisible, Net)
	bool                                          WheelBlocking;                                     // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NextActorEquiped;                                  // 0x00E8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WheelStillSpinning;                                // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_Actor>                     StarterWeapons;                                    // 0x00F8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	bool                                          IsSwapping;                                        // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     Game_Mode;                                         // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DefineFinalStarterWeapons();
	void IsBomber(bool* IsTheBomber);
	void IsValidItemTeam(E_Team ItemTeam, bool* Return);
	void IsValidIndex(int32 Input);
	void ClearEmptySlot();
	void GetNewIndexEquiped(int32 Index_0, int32* NewIndex);
	void inventory_Organization();
	void HandleItem(class AActor** Handle_Actor);
	void UnEquip();
	void Equip(class AActor* Actor);
	void InventoryFull(bool* Full_);
	void IndexEmpty(int32* Array_Index);
	void VisualAttach(class AActor* Target);
	void UpdateOverlay(class AActor* Actor_Picked);
	void InpActEvt_IA_Slot1_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Slot2_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Slot3_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Slot4_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Slot5_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Slot6_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void Try_Add_To_inventory__Server_(class AActor* New_Actor);
	void Remove_To_Inventory__Server_(class AActor* Actor_To_Remove);
	void Switch__client_(int32 New_Value);
	void Equip__Client_();
	void Try_Drop__Server_();
	void UnEquip__Client_();
	void Equip__Server_();
	void UnEquip__Server_();
	void ReceiveBeginPlay();
	void Spawn_Default__Inventory_();
	void SwapToSpecificActor(class AActor* Actor);
	void Switch__Server_(class AActor* Actor, bool PassSecurity);
	void Death__Server_();
	void SpawnSounds__Multicast_(class USoundBase* Sound, float VolumeMultiplier);
	void SpawnBomb__Server_();
	void Spawn_Default_client__Inventory_();
	void AddWep(class UClass* Class_0);
	void ExecuteUbergraph_Inventory(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Inventory_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Inventory_C")
	}
	static class UInventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventory_C>();
	}
};

}

