#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootBoxPreview

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LootBoxPreview.LootBoxPreview_C
// 0x0028 (0x02D0 - 0x02A8)
class ALootBoxPreview_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Generator_01a1;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Generator_01a;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePower(bool On_, class AActor* Provider);
	void SwitchAnimation(class UAnimMontage** In, class UAnimMontage** Out, class USoundCue** InSound, class USoundCue** OutSound);
	void SetLastSpecialZombieSpawnWave();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void Pickup(class AActor* Owner_0);
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void LeftClickReleaseEvent();
	void LeftClickEvent();
	void Item_Focus(class AActor* Instigator_0);
	void IsZombieCapReached_(bool* Yes);
	void IsDefaultHandle(bool* IsDefaultHandle_);
	void InterractDoor(double Z_Angle, bool ResetDoor);
	void Interract(class APawn* Owner_0);
	void IncreaseTotalZombiesToSpawnInWave();
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void GetSocketToAttach(class FName* SocketToAttach);
	void GetOverlay(EALS_OverlayState* Overlay);
	void GetOffset(struct FTransform* Offset);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetItemPriority(int32* Priority);
	void ExecuteUbergraph_LootBoxPreview(int32 EntryPoint);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ElectricalAction();
	void Drop(double Delay);
	void ConnectionInfos(const struct FLinearColor& Color);
	void CanSwap_(bool* IsItemSwap_);
	void CanSpawnSpecialZombie(bool* Yes);
	void CanPickup(class ACharacter* Player, bool* Pickup_);
	void CanInterract(class AActor* Instigator_0, bool* Interract_);
	void BossAlreadyInMap_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LootBoxPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LootBoxPreview_C")
	}
	static class ALootBoxPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALootBoxPreview_C>();
	}
};

}

