#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaIOCore

#include "Basic.hpp"

#include "MediaIOCore_structs.hpp"
#include "OpenColorIO_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MediaAssets_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ImageWriteQueue_structs.hpp"


namespace SDK
{

// Class MediaIOCore.CaptureCardMediaSource
// 0x0098 (0x0138 - 0x00A0)
class UCaptureCardMediaSource final : public UTimeSynchronizableMediaSource
{
public:
	bool                                          bRenderJIT;                                        // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFramelock;                                        // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaIOSampleEvaluationType                  EvaluationType;                                    // 0x00A2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVideoDeinterlacer*                     Deinterlacer;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EMediaIOInterlaceFieldOrder                   InterlaceFieldOrder;                               // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSourceEncoding;                           // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaIOCoreSourceEncoding                    OverrideSourceEncoding;                            // 0x00B2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSourceColorSpace;                         // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureColorSpace                            OverrideSourceColorSpace;                          // 0x00B4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenColorIOColorConversionSettings    ColorConversionSettings;                           // 0x00B8(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureCardMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureCardMediaSource")
	}
	static class UCaptureCardMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureCardMediaSource>();
	}
};

// Class MediaIOCore.VideoDeinterlacer
// 0x0000 (0x0028 - 0x0028)
class UVideoDeinterlacer : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VideoDeinterlacer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VideoDeinterlacer")
	}
	static class UVideoDeinterlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVideoDeinterlacer>();
	}
};

// Class MediaIOCore.BobDeinterlacer
// 0x0000 (0x0028 - 0x0028)
class UBobDeinterlacer final : public UVideoDeinterlacer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BobDeinterlacer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BobDeinterlacer")
	}
	static class UBobDeinterlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBobDeinterlacer>();
	}
};

// Class MediaIOCore.BlendDeinterlacer
// 0x0000 (0x0028 - 0x0028)
class UBlendDeinterlacer final : public UVideoDeinterlacer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlendDeinterlacer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlendDeinterlacer")
	}
	static class UBlendDeinterlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlendDeinterlacer>();
	}
};

// Class MediaIOCore.DiscardDeinterlacer
// 0x0000 (0x0028 - 0x0028)
class UDiscardDeinterlacer final : public UVideoDeinterlacer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DiscardDeinterlacer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DiscardDeinterlacer")
	}
	static class UDiscardDeinterlacer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscardDeinterlacer>();
	}
};

// Class MediaIOCore.MediaCapture
// 0x0260 (0x0288 - 0x0028)
class UMediaCapture : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnStateChanged;                                    // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaOutput*                           MediaOutput;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_68[0x220];                                     // 0x0068(0x0220)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CaptureActiveSceneViewport(const struct FMediaCaptureOptions& CaptureOptions);
	bool CaptureTextureRenderTarget2D(class UTextureRenderTarget2D* RenderTarget, const struct FMediaCaptureOptions& CaptureOptions);
	void SetMediaOutput(class UMediaOutput* InMediaOutput);
	void StopCapture(bool bAllowPendingFrameToBeProcess);
	bool UpdateTextureRenderTarget2D(class UTextureRenderTarget2D* RenderTarget);

	EPixelFormat GetDesiredPixelFormat() const;
	struct FIntPoint GetDesiredSize() const;
	EMediaCaptureState GetState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaCapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaCapture")
	}
	static class UMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaCapture>();
	}
};

// Class MediaIOCore.FileMediaCapture
// 0x0068 (0x02F0 - 0x0288)
class UFileMediaCapture final : public UMediaCapture
{
public:
	uint8                                         Pad_288[0x68];                                     // 0x0288(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FileMediaCapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FileMediaCapture")
	}
	static class UFileMediaCapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFileMediaCapture>();
	}
};

// Class MediaIOCore.MediaOutput
// 0x0008 (0x0030 - 0x0028)
class UMediaOutput : public UObject
{
public:
	int32                                         NumberOfTextureBuffers;                            // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMediaCapture* CreateMediaCapture();

	bool Validate(class FString* OutFailureReason) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaOutput")
	}
	static class UMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaOutput>();
	}
};

// Class MediaIOCore.FileMediaOutput
// 0x00A0 (0x00D0 - 0x0030)
class UFileMediaOutput final : public UMediaOutput
{
public:
	struct FImageWriteOptions                     WriteOptions;                                      // 0x0030(0x0060)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         FilePath;                                          // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseFileName;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDesiredSize;                              // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              DesiredSize;                                       // 0x00B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverridePixelFormat;                              // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EFileMediaOutputPixelFormat                   DesiredPixelFormat;                                // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertAlpha;                                      // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0xB];                                       // 0x00C5(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FileMediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FileMediaOutput")
	}
	static class UFileMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFileMediaOutput>();
	}
};

// Class MediaIOCore.MediaIOCoreSubsystem
// 0x0080 (0x00B0 - 0x0030)
class UMediaIOCoreSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x80];                                      // 0x0030(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaIOCoreSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaIOCoreSubsystem")
	}
	static class UMediaIOCoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaIOCoreSubsystem>();
	}
};

}

