#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBlend

#include "Basic.hpp"

#include "MeshBlend_structs.hpp"


namespace SDK::Params
{

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendOptionFromActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendOptionFromActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendUserDataFromMesh
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendUserDataFromMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.DisableBlendOnActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_DisableBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MeshBlend.MeshBlendBPLibrary.RefreshBlendOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_RefreshBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoftReset;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MeshBlend.MeshBlendBPLibrary.SetBlendOptionOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendOptionOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MeshBlend.MeshBlendBPLibrary.SetBlendUserDataOnMesh
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendUserDataOnMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

