#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBlend

#include "Basic.hpp"

#include "MeshBlend_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MeshBlend.AutoBlendUserData
// 0x0008 (0x0030 - 0x0028)
class UAutoBlendUserData final : public UAssetUserData
{
public:
	EAutoBlendOption                              AutoBlendOption;                                   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoBlendUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoBlendUserData")
	}
	static class UAutoBlendUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoBlendUserData>();
	}
};

// Class MeshBlend.MeshBlendActivator
// 0x01A8 (0x0450 - 0x02A8)
class AMeshBlendActivator final : public AActor
{
public:
	float                                         ProcessBudget;                                     // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentMaxRadius;                                  // 0x02AC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EProcessStage                                 CurrentProcessStage;                               // 0x02B0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0xA7];                                     // 0x02B1(0x00A7)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMeshBlendPooledActors                 PooledActors;                                      // 0x0358(0x0080)(Transient, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FMeshBlendPCGHelper                    MeshBlendPCGHelper;                                // 0x03D8(0x0018)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPrivate)
	TSet<class FString>                           MaterialsMissingAutoBlendID;                       // 0x03F0(0x0050)(Transient, DuplicateTransient, NativeAccessSpecifierPrivate)
	bool                                          CachedCVarMeshBlendEnable;                         // 0x0440(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          CachedMeshBlendRunInEditor;                        // 0x0441(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsBlendingEnabled;                                 // 0x0442(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsInitialized;                                     // 0x0443(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshBlendProcessor*                    MeshBlendProcessor;                                // 0x0448(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBlendActivator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBlendActivator")
	}
	static class AMeshBlendActivator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshBlendActivator>();
	}
};

// Class MeshBlend.MeshBlendBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UMeshBlendBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearBlendOptionFromActor(class AActor* Actor);
	static void ClearBlendUserDataFromMesh(class UStaticMesh* Mesh);
	static void DisableBlendOnActor(class AActor* Actor);
	static void RefreshBlendOnActor(class AActor* Actor, bool bSoftReset);
	static void SetBlendOptionOnActor(class AActor* Actor, EAutoBlendOption NewBlendOption);
	static void SetBlendUserDataOnMesh(class UStaticMesh* Mesh, EAutoBlendOption NewBlendOption);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBlendBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBlendBPLibrary")
	}
	static class UMeshBlendBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendBPLibrary>();
	}
};

// Class MeshBlend.MeshBlendProcessor
// 0x0068 (0x0090 - 0x0028)
class UMeshBlendProcessor final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint8, struct FBlendValueBucket>         BlendValueBucket;                                  // 0x0040(0x0050)(Transient, DuplicateTransient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBlendProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBlendProcessor")
	}
	static class UMeshBlendProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendProcessor>();
	}
};

// Class MeshBlend.MeshBlendSubSystem
// 0x0018 (0x0048 - 0x0030)
class UMeshBlendSubSystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NoiseTexture;                                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBlendSubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBlendSubSystem")
	}
	static class UMeshBlendSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendSubSystem>();
	}
};

}

