#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFramework

#include "Basic.hpp"


namespace SDK
{

// Enum MLDeformerFramework.EMLDeformerMaskingMode
// NumValues: 0x0003
enum class EMLDeformerMaskingMode : uint8
{
	Generated                                = 0,
	VertexAttribute                          = 1,
	EMLDeformerMaskingMode_MAX               = 2,
};

// Enum MLDeformerFramework.EMLDeformerVizMode
// NumValues: 0x0003
enum class EMLDeformerVizMode : uint8
{
	TrainingData                             = 0,
	TestData                                 = 1,
	EMLDeformerVizMode_MAX                   = 2,
};

// Enum MLDeformerFramework.EMLDeformerHeatMapMode
// NumValues: 0x0003
enum class EMLDeformerHeatMapMode : uint8
{
	Activations                              = 0,
	GroundTruth                              = 1,
	EMLDeformerHeatMapMode_MAX               = 2,
};

// Enum MLDeformerFramework.EMLDeformerMaskChannel
// NumValues: 0x0007
enum class EMLDeformerMaskChannel : uint8
{
	Disabled                                 = 0,
	VertexColorRed                           = 1,
	VertexColorGreen                         = 2,
	VertexColorBlue                          = 3,
	VertexColorAlpha                         = 4,
	VertexAttribute                          = 5,
	EMLDeformerMaskChannel_MAX               = 6,
};

// ScriptStruct MLDeformerFramework.MLDeformerCurveReference
// 0x0008 (0x0008 - 0x0000)
struct FMLDeformerCurveReference final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MLDeformerFramework.MLDeformerTrainingInputAnim
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMLDeformerTrainingInputAnim
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MLDeformerFramework.MLDeformerGeomCacheTrainingInputAnim
// 0x0000 (0x0008 - 0x0008)
struct FMLDeformerGeomCacheTrainingInputAnim final : public FMLDeformerTrainingInputAnim
{
};

// ScriptStruct MLDeformerFramework.MLDeformerMaskInfo
// 0x0020 (0x0020 - 0x0000)
struct FMLDeformerMaskInfo final
{
public:
	TArray<class FName>                           BoneNames;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EMLDeformerMaskingMode                        MaskMode;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VertexAttributeName;                               // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MLDeformerFramework.MLDeformerMorphModelQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct FMLDeformerMorphModelQualityLevel final
{
public:
	int32                                         MaxActiveMorphs;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MLDeformerFramework.MLDeformerCompareActor
// 0x0030 (0x0030 - 0x0000)
struct FMLDeformerCompareActor final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMLDeformerAsset>        DeformerAsset;                                     // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

