#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiUserClientLibrary

#include "Basic.hpp"

#include "ConcertReplicationScripting_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Concert_structs.hpp"


namespace SDK
{

// Enum MultiUserClientLibrary.EMultiUserClientStatus
// NumValues: 0x0004
enum class EMultiUserClientStatus : uint8
{
	Connected                                = 0,
	Disconnected                             = 1,
	Updated                                  = 2,
	EMultiUserClientStatus_MAX               = 3,
};

// Enum MultiUserClientLibrary.EMultiUserObjectReplicationMode
// NumValues: 0x0003
enum class EMultiUserObjectReplicationMode : uint8
{
	SpecifiedRate                            = 0,
	Realtime                                 = 1,
	EMultiUserObjectReplicationMode_MAX      = 2,
};

// Enum MultiUserClientLibrary.EMultiUserPropertyChangeType
// NumValues: 0x0004
enum class EMultiUserPropertyChangeType : uint8
{
	Put                                      = 0,
	Add                                      = 1,
	Remove                                   = 2,
	EMultiUserPropertyChangeType_MAX         = 3,
};

// Enum MultiUserClientLibrary.EMultiUserChangeAuthorityOperationResult
// NumValues: 0x000C
enum class EMultiUserChangeAuthorityOperationResult : uint8
{
	Success                                  = 0,
	NoChanges                                = 1,
	RejectedFullyOrPartially                 = 2,
	Timeout                                  = 3,
	CancelledDueToStreamUpdate               = 4,
	Cancelled                                = 5,
	FailedToSendRequest                      = 6,
	NotInSession                             = 7,
	UnknownClient                            = 8,
	NotOnGameThread                          = 9,
	NotAvailable                             = 10,
	EMultiUserChangeAuthorityOperationResult_MAX = 11,
};

// Enum MultiUserClientLibrary.EMultiUserChangeFrequencyErrorCode
// NumValues: 0x0004
enum class EMultiUserChangeFrequencyErrorCode : uint8
{
	UnregisteredStream                       = 0,
	InvalidReplicationRate                   = 1,
	Count                                    = 2,
	EMultiUserChangeFrequencyErrorCode_MAX   = 3,
};

// Enum MultiUserClientLibrary.EMultiUserPutObjectErrorCode
// NumValues: 0x0004
enum class EMultiUserPutObjectErrorCode : uint8
{
	UnresolvedStream                         = 0,
	MissingData                              = 1,
	Count                                    = 2,
	EMultiUserPutObjectErrorCode_MAX         = 3,
};

// Enum MultiUserClientLibrary.EMultiUserChangeStreamOperationResult
// NumValues: 0x000B
enum class EMultiUserChangeStreamOperationResult : uint8
{
	Success                                  = 0,
	NoChanges                                = 1,
	Rejected                                 = 2,
	Timeout                                  = 3,
	Cancelled                                = 4,
	FailedToSendRequest                      = 5,
	NotInSession                             = 6,
	UnknownClient                            = 7,
	NotOnGameThread                          = 8,
	NotAvailable                             = 9,
	EMultiUserChangeStreamOperationResult_MAX = 10,
};

// Enum MultiUserClientLibrary.EMultiUserConnectionError
// NumValues: 0x000B
enum class EMultiUserConnectionError : uint32
{
	None                                     = 0,
	Canceled                                 = 1,
	ConnectionAttemptAborted                 = 2,
	ServerNotResponding                      = 3,
	ServerError                              = 4,
	WorkspaceValidationUnknown               = 100,
	SourceControlValidationUnknown           = 110,
	SourceControlValidationCanceled          = 111,
	SourceControlValidationError             = 112,
	DirtyPackageValidationError              = 113,
	EMultiUserConnectionError_MAX            = 114,
};

// Enum MultiUserClientLibrary.EMultiUserSourceValidationMode
// NumValues: 0x0004
enum class EMultiUserSourceValidationMode : uint8
{
	Hard                                     = 0,
	Soft                                     = 1,
	SoftAutoProceed                          = 2,
	EMultiUserSourceValidationMode_MAX       = 3,
};

// Enum MultiUserClientLibrary.EMultiUserConnectionStatus
// NumValues: 0x0005
enum class EMultiUserConnectionStatus : uint8
{
	Connecting                               = 0,
	Connected                                = 1,
	Disconnecting                            = 2,
	Disconnected                             = 3,
	EMultiUserConnectionStatus_MAX           = 4,
};

// ScriptStruct MultiUserClientLibrary.MultiUserPropertyChange
// 0x0018 (0x0018 - 0x0000)
struct FMultiUserPropertyChange final
{
public:
	TArray<struct FConcertPropertyChainWrapper>   Properties;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EMultiUserPropertyChangeType                  ChangeType;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserObjectReplicationSettings
// 0x0002 (0x0002 - 0x0000)
struct FMultiUserObjectReplicationSettings final
{
public:
	EMultiUserObjectReplicationMode               Mode;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReplicationRate;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserFrequencyChangeRequest
// 0x00A8 (0x00A8 - 0x0000)
struct FMultiUserFrequencyChangeRequest final
{
public:
	TSet<struct FSoftObjectPath>                  OverridesToRemove;                                 // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FMultiUserObjectReplicationSettings> OverridesToAdd;         // 0x0050(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMultiUserObjectReplicationSettings    NewDefaults;                                       // 0x00A0(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bChangeDefaults;                                   // 0x00A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeStreamRequest
// 0x0148 (0x0148 - 0x0000)
struct FMultiUserChangeStreamRequest final
{
public:
	TMap<class UObject*, struct FMultiUserPropertyChange> PropertyChanges;                           // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  ObjectsToRemove;                                   // 0x0050(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMultiUserFrequencyChangeRequest       FrequencyChanges;                                  // 0x00A0(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeAuthorityRequest
// 0x00A0 (0x00A0 - 0x0000)
struct FMultiUserChangeAuthorityRequest final
{
public:
	TSet<struct FSoftObjectPath>                  ObjectsToStartReplicating;                         // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  ObjectToStopReplicating;                           // 0x0050(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeClientReplicationRequest
// 0x01E8 (0x01E8 - 0x0000)
struct FMultiUserChangeClientReplicationRequest final
{
public:
	struct FMultiUserChangeStreamRequest          StreamChangeRequest;                               // 0x0000(0x0148)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMultiUserChangeAuthorityRequest       AuthorityChangeRequest;                            // 0x0148(0x00A0)(BlueprintVisible, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserBlueprintEventData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FMultiUserBlueprintEventData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserClientInfo
// 0x0040 (0x0040 - 0x0000)
struct FMultiUserClientInfo final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AvatarColor;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.ChangeClientStreamFrequencyResponse
// 0x0058 (0x0058 - 0x0000)
struct FChangeClientStreamFrequencyResponse final
{
public:
	TMap<struct FSoftObjectPath, EMultiUserChangeFrequencyErrorCode> ObjectErrors;                   // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TOptional<EMultiUserChangeFrequencyErrorCode> DefaultChangeErrorCode;                            // 0x0050(0x0002)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeClientStreamResponse
// 0x0108 (0x0108 - 0x0000)
struct FMultiUserChangeClientStreamResponse final
{
public:
	EMultiUserChangeStreamOperationResult         ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FGuid>    AuthorityConflicts;                                // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, EMultiUserPutObjectErrorCode> SemanticErrors;                       // 0x0058(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FChangeClientStreamFrequencyResponse   FrequencyErrors;                                   // 0x00A8(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bFailedStreamCreation;                             // 0x0100(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeClientAuthorityResponse
// 0x0058 (0x0058 - 0x0000)
struct FMultiUserChangeClientAuthorityResponse final
{
public:
	EMultiUserChangeAuthorityOperationResult      ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FSoftObjectPath>                  RejectedObjects;                                   // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserChangeClientReplicationResult
// 0x0160 (0x0160 - 0x0000)
struct FMultiUserChangeClientReplicationResult final
{
public:
	struct FMultiUserChangeClientStreamResponse   StreamResponse;                                    // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMultiUserChangeClientAuthorityResponse AuthorityResponse;                                // 0x0108(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserReplicationRegistrationParams
// 0x0020 (0x0020 - 0x0000)
struct FMultiUserReplicationRegistrationParams final
{
public:
	struct FGuid                                  ClientEndpointId;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IMultiUserReplicationRegistrationContext> Context;                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserClientDisplayInfo
// 0x0010 (0x0010 - 0x0000)
struct FMultiUserClientDisplayInfo final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserSessionInfo
// 0x0048 (0x0048 - 0x0000)
struct FMultiUserSessionInfo final
{
public:
	struct FGuid                                  ServerEndpointId;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndpointName;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.MultiUserConnectionError
// 0x0018 (0x0018 - 0x0000)
struct FMultiUserConnectionError final
{
public:
	EMultiUserConnectionError                     ErrorCode;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ErrorMessage;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// ScriptStruct MultiUserClientLibrary.MultiUserClientConfig
// 0x0038 (0x0038 - 0x0000)
struct FMultiUserClientConfig final
{
public:
	class FString                                 DefaultServerURL;                                  // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionName;                                // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSessionToRestore;                           // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiUserSourceValidationMode                ValidationMode;                                    // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MultiUserClientLibrary.ConcertBlueprintEvent
// 0x0020 (0x0020 - 0x0000)
struct FConcertBlueprintEvent final
{
public:
	struct FConcertSessionSerializedPayload       Data;                                              // 0x0000(0x0020)(NativeAccessSpecifierPublic)
};

}

