#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiUserClientLibrary

#include "Basic.hpp"

#include "MultiUserClientLibrary_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MultiUserClientLibrary.ChangeClientAsyncAction
// 0x0208 (0x0238 - 0x0030)
class UChangeClientAsyncAction final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FMultiUserChangeClientReplicationResult& Response)> OnCompleted; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGuid                                  ClientId;                                          // 0x0040(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMultiUserChangeClientReplicationRequest ReplicationRequest;                              // 0x0050(0x01E8)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UChangeClientAsyncAction* ChangeClient(const struct FGuid& ClientId_0, const struct FMultiUserChangeClientReplicationRequest& Request);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChangeClientAsyncAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChangeClientAsyncAction")
	}
	static class UChangeClientAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeClientAsyncAction>();
	}
};

// Class MultiUserClientLibrary.MultiUserReplicationRegistration
// 0x0000 (0x0000 - 0x0000)
class IMultiUserReplicationRegistration final
{
public:
	void DiscoverReplicationSettings(const struct FMultiUserReplicationRegistrationParams& Params_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserReplicationRegistration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserReplicationRegistration")
	}
	static class IMultiUserReplicationRegistration* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMultiUserReplicationRegistration>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MultiUserClientLibrary.MultiUserReplicationRegistrationContext
// 0x0000 (0x0000 - 0x0000)
class IMultiUserReplicationRegistrationContext final
{
public:
	void AddAdditionalObject(class UObject* Object);
	void AddPropertiesToObject(class UObject* Object, const TArray<struct FConcertPropertyChainWrapper>& PropertiesToAdd);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserReplicationRegistrationContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserReplicationRegistrationContext")
	}
	static class IMultiUserReplicationRegistrationContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMultiUserReplicationRegistrationContext>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};

// Class MultiUserClientLibrary.MultiUserClientSyncDatabase
// 0x0010 (0x0038 - 0x0028)
class UMultiUserClientSyncDatabase final : public UObject
{
public:
	TMulticastInlineDelegate<void(class FName PackageName)> OnPackageSaved;                          // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserClientSyncDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserClientSyncDatabase")
	}
	static class UMultiUserClientSyncDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiUserClientSyncDatabase>();
	}
};

// Class MultiUserClientLibrary.MultiUserClientStatics
// 0x0000 (0x0028 - 0x0028)
class UMultiUserClientStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool ConfigureMultiUserClient(const struct FMultiUserClientConfig& ClientConfig);
	static TArray<class FName> GatherSessionChanges(bool IgnorePersisted);
	static class UMultiUserClientSyncDatabase* GetConcertSyncDatabase();
	static struct FMultiUserConnectionError GetLastMultiUserConnectionError();
	static struct FMultiUserClientInfo GetLocalMultiUserClientInfo();
	static bool GetMultiUserClientInfoByName(const class FString& ClientName, struct FMultiUserClientInfo* ClientInfo);
	static bool GetMultiUserConnectionStatus();
	static EMultiUserConnectionStatus GetMultiUserConnectionStatusDetail();
	static struct FTransform GetMultiUserPresenceTransform(const struct FGuid& ClientEndpointId);
	static struct FMultiUserSessionInfo GetMultiUserSessionInfo();
	static bool GetRemoteMultiUserClientInfos(TArray<struct FMultiUserClientInfo>* ClientInfos);
	static void JumpToMultiUserPresence(const class FString& OtherUserName, const struct FTransform& TransformOffset);
	static void PersistMultiUserSessionChanges();
	static void PersistSpecifiedPackages(const TArray<class FName>& PackagesToPersist);
	static void SetMultiUserPresenceEnabled(const bool IsEnabled);
	static void SetMultiUserPresenceVisibility(const class FString& Name_0, bool Visibility, bool PropagateToAll);
	static void SetMultiUserPresenceVisibilityById(const struct FGuid& ClientEndpointId, bool Visibility, bool PropagateToAll);
	static bool StartMultiUserDefaultConnection();
	static void UpdateWorkspaceModifiedPackages();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserClientStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserClientStatics")
	}
	static class UMultiUserClientStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiUserClientStatics>();
	}
};

// Class MultiUserClientLibrary.MultiUserReplicationRegistrationContextImpl
// 0x0010 (0x0038 - 0x0028)
class UMultiUserReplicationRegistrationContextImpl final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAdditionalObject(class UObject* Object);
	void AddPropertiesToObject(class UObject* Object, const TArray<struct FConcertPropertyChainWrapper>& PropertiesToAdd);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserReplicationRegistrationContextImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserReplicationRegistrationContextImpl")
	}
	static class UMultiUserReplicationRegistrationContextImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiUserReplicationRegistrationContextImpl>();
	}
};

// Class MultiUserClientLibrary.MultiUserReplicationSubsystem
// 0x0050 (0x0080 - 0x0030)
class UMultiUserReplicationSubsystem final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FGuid& EndpointId)> OnClientStreamServerStateChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGuid& EndpointId)> OnClientAuthorityServerStateChanged; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnOfflineClientsChanged;                           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FGuid& EndpointId)> OnOfflineClientContentChanged;    // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetObjectReplicationFrequency(const struct FGuid& ClientId, const struct FSoftObjectPath& ObjectPath, struct FMultiUserObjectReplicationSettings* OutFrequency);

	TArray<struct FGuid> GetOfflineClientIds() const;
	TArray<struct FGuid> GetOwningOfflineClients(const struct FSoftObjectPath& ObjectPath) const;
	TArray<struct FConcertPropertyChainWrapper> GetPropertiesRegisteredToObject(const struct FGuid& ClientId, const struct FSoftObjectPath& ObjectPath) const;
	TArray<struct FSoftObjectPath> GetRegisteredObjects(const struct FGuid& ClientId) const;
	TArray<struct FSoftObjectPath> GetReplicatedObjects(const struct FGuid& ClientId) const;
	bool IsOwnedByOfflineClient(const struct FSoftObjectPath& ObjectPath) const;
	bool IsReplicatingObject(const struct FGuid& ClientId, const struct FSoftObjectPath& ObjectPath) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserReplicationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserReplicationSubsystem")
	}
	static class UMultiUserReplicationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiUserReplicationSubsystem>();
	}
};

// Class MultiUserClientLibrary.MultiUserSubsystem
// 0x0080 (0x00B0 - 0x0030)
class UMultiUserSubsystem final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnSessionConnected;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSessionDisconnected;                             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EMultiUserClientStatus Status, const struct FMultiUserClientInfo& ClientInfo)> OnSessionClientChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x50];                                      // 0x0060(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetRemoteClientIds(TArray<struct FGuid>* OutRemoteClientIds);
	void K2_ExtractEventData(struct FMultiUserBlueprintEventData& EventData, int32& StructOut);
	void K2_SendCustomEvent(const int32& EventData);
	bool RegisterCustomEventHandler(const class UStruct* EventType, TDelegate<void(const struct FMultiUserBlueprintEventData& Data)> InEventHandler);
	bool UnregisterCustomEventHandler(const class UStruct* EventType);

	bool GetLocalClientId(struct FGuid* OutClientId) const;
	bool IsConnectedToSession() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiUserSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiUserSubsystem")
	}
	static class UMultiUserSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiUserSubsystem>();
	}
};

}

