#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Team_structs.hpp"
#include "PC_BodycamBase_classes.hpp"
#include "GameMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PC_Lobby.PC_Lobby_C
// 0x0098 (0x08F8 - 0x0860)
class APC_Lobby_C final : public APC_BodycamBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PC_Lobby_C;                         // 0x0860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioCaptureComponent*                 AudioCaptureVOIP;                                  // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MenuControllerComponent_C*          BP_MenuControllerComponent;                        // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 SteamID;                                           // 0x0878(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UKickOverlay_C*                         HUD_KickOverlay;                                   // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         SteamIDMuted;                                      // 0x0890(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         KickedPlayerVoted;                                 // 0x08A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_Team                                        Team;                                              // 0x08B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CaptureTESTVOIP_;                                  // 0x08B1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_8B2[0x6];                                      // 0x08B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVOIPTalker*                            Voip;                                              // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTalking;                                         // 0x08C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x3];                                      // 0x08C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RankScore;                                         // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rank_;                                             // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CC[0x4];                                      // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Current_Rank;                                      // 0x08D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Kick_Reason;                                       // 0x08E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AGT_Lobby_C*                            As_GT_Lobby;                                       // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void BndEvt__PC_Lobby_AudioCaptureVOIP_K2Node_ComponentBoundEvent_0_OnSynthEnvelopeValue__DelegateSignature(const float EnvelopeValue);
	void Bots_Method_(bool* Bots_Method);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void BreakTimer();
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void Clear_GameInstance__Client_();
	void ClearMap();
	void Event_Ragdoll_End();
	void EventRagdollStart();
	void ExecuteUbergraph_PC_Lobby(int32 EntryPoint);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetBlured(double* Blured);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetCurrentRank(class FName* CurrentRank, int32* Rank__0, int32* RankScore_0, int32* Connection_Streak);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetFlashBangEffect(double* FlashEffect);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetHealth(double* Health);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetNewRank(class FText* Name_0, class UTexture2D** Image, int32* RankScore_0, int32* RankPosition, int32* RankDivision, double* PreviousRankProgress, double* RankProgress, bool* NewRank_, struct FSlateColor* Color, int32* Rank_Integer);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetReady_(bool* IsReady_);
	void GetReloadPlayRate(double* PlayRate);
	void GetServerSteamID(class FString* SteamID_0);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSteamID(class FString* SteamID_0);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetTeam(E_Team* Team_0);
	void GetTeamList(E_Team Team_0, TArray<struct FSTR_PCInfo>* Info);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetWep(class AWEP_C** WEP);
	void Init_Rank();
	void Init_SteamID__Client_();
	void Init_SteamID__Server_(const class FString& SteamID_0, class AController* PC, class APawn* Character_0);
	void InitScoreBoard();
	void InitVoteNextMap();
	void IsDead(bool* Dead_);
	void IsDestroyabe_(bool* Destroyable_);
	void IsPlayerWinning(bool* Yes_);
	void IsReady_(bool IsReady__0);
	void IsStress(bool* Yes_);
	void IsTalking_(bool* IsTalking__0);
	void Kick_(const struct FSTR_PCInfo& Target);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void KillMenu__Client_();
	void LockMap(bool Lock);
	void MuteID(const class FString& SteamID_0);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void OnCallback_14E63BBC438A94FA691929ABFADBEF74(const struct FLeaderboardScoresDownloadedForUsers& Data, bool bWasSuccessful);
	void OnCallback_D2DBA09F41E6113C2A70CF9D8A11AC3D(const struct FLeaderboardFindResult& Data, bool bWasSuccessful);
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void OnRep_Ready_();
	void OnRep_SteamID();
	void OnTrySelectTeam(E_Team Team_0);
	void PlaySoundLocal(class USoundCue* Audio);
	const struct FTransform RandomSpawn();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceivePossess(class APawn* PossessedPawn);
	void RefreshMapVoterPlayerID();
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void ServerTravel(double Delay, const class FString& Level);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void SetActiveTESTVOIP(bool bNewActive);
	void Slomo(double Slomo_0);
	void Spawn_Character__Server_(const struct FTransform& SpawnTransform);
	void Spawn_Customizable_Character__Server_();
	void SpawnVoteNextMap_Hud_();
	void Talk(bool IsTalking_0);
	void Update_ControlRotation(const struct FRotator& NewRotation);
	void Update_Vote_Timer_Text(double TimerIndex);
	void UpdateGamemode(EGameMode GameMode);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void UpdateLobbyList();
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateScoreBoard();
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void UpdateTransitionMap();
	void UpdateWarning(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PC_Lobby_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PC_Lobby_C")
	}
	static class APC_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APC_Lobby_C>();
	}
};

}

