#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_MenuSystemConfig

#include "Basic.hpp"

#include "EDeviceInputSwitchBehavior_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ETransitionAnimation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FFontStyle_structs.hpp"
#include "EFontPalette_structs.hpp"
#include "EColorPalette_structs.hpp"
#include "EPauseBehavior_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_MenuSystemConfig.PDA_MenuSystemConfig_C
// 0x07F8 (0x0828 - 0x0030)
class UPDA_MenuSystemConfig_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class USoundCue>               HighlightSound;                                    // 0x0030(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               AcceptSound;                                       // 0x0058(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               DeclineSound;                                      // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ButtonPressSound;                                  // 0x00A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ForwardSound;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               BackSound;                                         // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ValueChangeSound;                                  // 0x0120(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SliderSound;                                       // 0x0148(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               DecisionDialogPopupSound;                          // 0x0170(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               IngameMenuOpenSound;                               // 0x0198(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               IngameMenuCloseSound;                              // 0x01C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               ClearInputBindingSound;                            // 0x01E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               CameraSwitchSound;                                 // 0x0210(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               SearchGameSound;                                   // 0x0238(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               BackgroundMusic;                                   // 0x0260(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundCue>               CreditsMusic;                                      // 0x0288(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   DisplayedGameTitle;                                // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DisplayedGameVersion;                              // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  MenuLevel;                                         // 0x02C0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  CreateNewGameLevel;                                // 0x02E8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bIntroLogosSkippable;                              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIntroEnabled;                                     // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   MenuContainerClass;                                // 0x0318(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   IngameMenuClass;                                   // 0x0340(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   InventoryMenuClass;                                // 0x0368(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DocumentsMenuClass;                                // 0x0390(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DecisionDialogMenuClass;                           // 0x03B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FooterBarMenuClass;                                // 0x03E0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LoadingScreenMenuClass;                            // 0x0408(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MenuBackgroundClass;                               // 0x0430(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SoundManager;                                      // 0x0458(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bShowLoadingScreen;                                // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowMouseCursor;                                  // 0x0481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMouseLockMode                                MouseLockMode;                                     // 0x0482(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDeviceInputSwitchBehavior                    InputDeviceSwitchBehavior;                         // 0x0483(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MouseCursorDefaultPosition;                        // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EColorPalette, struct FLinearColor>      ColorPalette;                                      // 0x0498(0x0050)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UWorld>                  LocalMultiplayerLevel;                             // 0x04E8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	EPauseBehavior                                SinglePlayerPauseBehavior;                         // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSplitscreenIngame;                             // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFullscreenSplitscreenIngameMenu;                  // 0x0512(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPauseBehavior                                LocalMultiplayerPauseBehavior;                     // 0x0513(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputMappingContext*                   InputMappingContextMenu;                           // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_InputActionData_C*                 KeyboardAndMouseActionData;                        // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UPDA_InputActionData_C*> GamepadActionDataList;                        // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UPlayerMappableInputConfig*>     PlayerBindableInputConfigs;                        // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   SettingsManagerClass;                              // 0x0588(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class UPDA_SettingsData_C*>            SettingsData;                                      // 0x05B0(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, class UPDA_LevelMetaData_C*> LevelMetaData;                                    // 0x05C0(0x0050)(Edit, BlueprintVisible)
	TMap<EFontPalette, struct FFFontStyle>        FontPalette;                                       // 0x0610(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	ETransitionAnimation                          MenuTransitionAnimation;                           // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MenuTransitionAnimationSpeed;                      // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_ScrollBarStyle_C*                  ScrollBarStyle;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SaveGameManagerClass;                              // 0x0678(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   DeveloperNote;                                     // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_MenuStyle_C*                       MenuStyle;                                         // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  OnlineMultiplayerLevel;                            // 0x06B0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FLinearColor                           BodyBomb_Color;                                    // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Versus_Color;                                      // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Death_Match_Color;                                 // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Zombie_Color;                                      // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Training_Color;                                    // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Empty_Color;                                       // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GunGame_Color;                                     // 0x0738(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Team_DeathMatch_Color;                             // 0x0748(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Versus_Desc;                                       // 0x0758(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 BodyBomb_Desc;                                     // 0x0768(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Death_Match_Desc;                                  // 0x0778(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Training_Desc;                                     // 0x0788(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 GunGame_Desc;                                      // 0x0798(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Zombie_Desc;                                       // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Team_Death_Match_Desc;                             // 0x07B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UInputMappingContext*>           RegisteredInputMappingsContexts;                   // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UInputMappingContext*, int32>      InitiallyAddedInputMappingContexts;                // 0x07D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_MenuSystemConfig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_MenuSystemConfig_C")
	}
	static class UPDA_MenuSystemConfig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_MenuSystemConfig_C>();
	}
};

}

