#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_SettingsData

#include "Basic.hpp"

#include "FValueConversionParameters_structs.hpp"
#include "ESettingsApplyMethod_structs.hpp"
#include "FGameUserSettingsParameters_structs.hpp"
#include "EValueDataType_structs.hpp"
#include "ESettingsValueConversion_structs.hpp"
#include "FValueTypes_structs.hpp"
#include "FConsoleCommandParameters_structs.hpp"
#include "FAudioSettingsParameters_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_SettingsData.PDA_SettingsData_C
// 0x00C0 (0x00F0 - 0x0030)
class UPDA_SettingsData_C final : public UPrimaryDataAsset
{
public:
	class FString                                 UniqueName;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESettingsApplyMethod                          ApplyMethod;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESettingsValueConversion                      ValueConversion;                                   // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValueDataType                                DataType;                                          // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFValueTypes                           DefaultValue;                                      // 0x0048(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FFConsoleCommandParameters             ConsoleCommandParameters;                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FFValueConversionParameters            ValueConversionParameters;                         // 0x0080(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FFGameUserSettingsParameters           GameUserSettingsParameters;                        // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFAudioSettingsParameters              AudioSettingsParameters;                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CustomSettingsApplyClass;                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   DeveloperNote;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_SettingsData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_SettingsData_C")
	}
	static class UPDA_SettingsData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_SettingsData_C>();
	}
};

}

