#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_Zombie

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "EN_ZombieType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_Zombie.PDA_Zombie_C
// 0x0050 (0x0080 - 0x0030)
class UPDA_Zombie_C final : public UPrimaryDataAsset
{
public:
	EN_ZombieType                                 EN_ZombieType;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ZombieClass;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   Body;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class USkeletalMesh>>   Clothes;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UChaosClothAsset>> ClothesSimulated;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Helmet;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_Zombie_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_Zombie_C")
	}
	static class UPDA_Zombie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_Zombie_C>();
	}
};

}

