#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_DecisionDialogStyle

#include "Basic.hpp"

#include "EColorPalette_structs.hpp"
#include "PDA_WidgetStyle_classes.hpp"
#include "EFontPalette_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_DecisionDialogStyle.PDA_DecisionDialogStyle_C
// 0x0018 (0x0050 - 0x0038)
class UPDA_DecisionDialogStyle_C final : public UPDA_WidgetStyle_C
{
public:
	EColorPalette                                 BackgroundColor;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 TitleTextColor;                                    // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BodyTextColor;                                     // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BarBackgroundColor;                                // 0x003B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BarFillColor;                                      // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CornerRadius;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFontPalette                                  TitleFontStyle;                                    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFontPalette                                  BodyFontStyle;                                     // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_DecisionDialogStyle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_DecisionDialogStyle_C")
	}
	static class UPDA_DecisionDialogStyle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_DecisionDialogStyle_C>();
	}
};

}

