#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_ButtonStyle

#include "Basic.hpp"

#include "EColorPalette_structs.hpp"
#include "PDA_WidgetStyle_classes.hpp"
#include "EFontPalette_structs.hpp"
#include "FWidgetAnimationData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_ButtonStyle.PDA_ButtonStyle_C
// 0x0080 (0x00B8 - 0x0038)
class UPDA_ButtonStyle_C final : public UPDA_WidgetStyle_C
{
public:
	EColorPalette                                 BackgroundColor;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 TextColor;                                         // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BackgroundHighlightColor;                          // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 TextHighlightColor;                                // 0x003B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BackgroundActiveColor;                             // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 TextActiveColor;                                   // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 BackgroundDisabledColor;                           // 0x003E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorPalette                                 TextDisabledColor;                                 // 0x003F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WidgetHeight;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CornerRadius;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFontPalette                                  FontStyle;                                         // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFWidgetAnimationData                  HighlightAnimation;                                // 0x0058(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFWidgetAnimationData                  UnhighlightAnimation;                              // 0x0080(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      HighlightMaterial;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CornerSharpness;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_ButtonStyle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_ButtonStyle_C")
	}
	static class UPDA_ButtonStyle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_ButtonStyle_C>();
	}
};

}

