#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDA_LevelMetaData

#include "Basic.hpp"

#include "StatusConfigEN_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PDA_LevelMetaData.PDA_LevelMetaData_C
// 0x0078 (0x00A8 - 0x0030)
class UPDA_LevelMetaData_C final : public UPrimaryDataAsset
{
public:
	class FName                                   LevelName;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ThumbnailImage;                                    // 0x0038(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LoadingScreenImage;                                // 0x0060(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FText>                           Texts;                                             // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EStatusConfigEN                               StatusConfig;                                      // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         Level_Sequence_Intro;                              // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PDA_LevelMetaData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PDA_LevelMetaData_C")
	}
	static class UPDA_LevelMetaData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDA_LevelMetaData_C>();
	}
};

}

