#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Remington

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Remington.Remington_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Remington_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function Remington.Remington_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Remington_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.ExecuteUbergraph_Remington
// 0x0018 (0x0018 - 0x0000)
struct Remington_C_ExecuteUbergraph_Remington final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWEP_C*                                 K2Node_Event_Wep;                                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Fire
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Fire final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Holster
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Holster final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Inspect
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Inspect final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Reload
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Reload final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Reload Empty
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Reload_Empty final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Montage Character Unholster
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Montage_Character_Unholster final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Sequence Loop Run
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Sequence_Loop_Run final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Sequence Pose Aim
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Sequence_Pose_Aim final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get First Person Sequence Pose Idle
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_First_Person_Sequence_Pose_Idle final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Mesh Component Magazine
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Mesh_Component_Magazine final
{
public:
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Mesh Component Weapon
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Mesh_Component_Weapon final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Name Socket Third Person
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Name_Socket_Third_Person final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Offset Action Location
// 0x0018 (0x0018 - 0x0000)
struct Remington_C_Get_Offset_Action_Location final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Offset Action Rotation
// 0x0018 (0x0018 - 0x0000)
struct Remington_C_Get_Offset_Action_Rotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};

// Function Remington.Remington_C.Get Rate Of Fire
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Rate_Of_Fire final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Montage Character Fire
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Montage_Character_Fire final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Montage Character Inspect
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Montage_Character_Inspect final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Montage Character Reload
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Montage_Character_Reload final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Montage Character Reload Empty
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Montage_Character_Reload_Empty final
{
public:
	class UAnimMontage*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Loop Weapon Jog
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Loop_Weapon_Jog final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Loop Weapon Sprint
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Loop_Weapon_Sprint final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Loop Weapon Sprint Impulse
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Loop_Weapon_Sprint_Impulse final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Pose Crouching Holstered
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Pose_Crouching_Holstered final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Pose Crouching Unholstered
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Pose_Crouching_Unholstered final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Pose Standing Holstered
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Pose_Standing_Holstered final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Get Third Person Sequence Pose Standing Unholstered
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Get_Third_Person_Sequence_Pose_Standing_Unholstered final
{
public:
	class UAnimSequence*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};

// Function Remington.Remington_C.Init Wep
// 0x0008 (0x0008 - 0x0000)
struct Remington_C_Init_Wep final
{
public:
	class AWEP_C*                                 WEP;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

