#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Effects

#include "Basic.hpp"

#include "ETriggerMethod_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EEffectLayer_structs.hpp"
#include "EEffectType_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_Effects.S_Effects
// 0x0088 (0x0088 - 0x0000)
struct FS_Effects final
{
public:
	bool                                          IsEnabled_18_5F5859E6449CA2118889C29B812D8161;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETriggerMethod                                TriggerMethod_50_78811DED4A74E896F3726B82ADFE2980; // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpecificPercentValue_13_5C754BFC45B9763D27A6A9AB9187390F; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EffectScale_61_63D82B6D464CD3CCEC1B078074C08549;   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EffectTranslation_62_B2FC126540FD38111139ECA600383ADB; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              EffectShear_60_AAC8D1A74D4F67E95F82FE9EB0D3581A;   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectAngle_67_9654D26045ED5561CC56AC9DF3981F59;   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEffectLayer                                  EffectLayer_22_3309B47F49D95F295EC24789EAAF4815;   // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEffectType                                   EffectType_78_DA737BD8465723F56B6C5DAFC5F147B5;    // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumParticles_70_F3941F714B9C03FD09B052B91754A004;  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CustomEffectTexture_37_071362A64918FCBA33D4FF85BB9ABA70; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EffectColor_49_B8696A40425D278129557CB171157594;   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlaybackSpeed_63_895E2BF0490600F327E6D3A40CD1FF43; // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleSpread_77_91AAD9984A826CA627C0E894AAE3D287; // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddRotationtoParticles_76_244A1C394C00164B10A2AB9E13ED2914; // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundEffect_81_D5F6F19D40A0B92BB0598E8C416B50E0;   // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         SoundVolumeMultiplier_85_6B4801114C18FDBC28D92AABF034AFE0; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecayTime_88_B89D47A944D4AEE43F918889E359E9D2;     // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseStretchedParticle_90_1C1A4D3543806DE1B5BD93909DA565BB; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

