#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_PlayerCustomization

#include "Basic.hpp"

#include "ST_DefaultSteamItem_structs.hpp"
#include "EN_ShopItemSupClass_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_Loadout_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_PlayerCustomization.SG_PlayerCustomization_C
// 0x04E0 (0x0508 - 0x0028)
class USG_PlayerCustomization_C final : public USaveGame
{
public:
	TArray<struct FST_DefaultSteamItem>           SAVED_Custom;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	class FString                                 SAVED_UserSteamID;                                 // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           SAVED_Weapons;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TArray<struct FST_DefaultSteamItem>           SAVED_Skin;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	EN_ShopItemSupClass                           SAVED_ItemClassSup;                                // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_DefaultSteamItem>           SAVED_Badge;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TArray<struct FST_Loadout>                    SAVED_Loadout;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SAVED_Actual_Loadout_Index;                        // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Loadout                            SAVED_Actual_Loadout;                              // 0x0098(0x0470)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SG_PlayerCustomization_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SG_PlayerCustomization_C")
	}
	static class USG_PlayerCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_PlayerCustomization_C>();
	}
};

}

