#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_PlayerInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SteamCorePro_structs.hpp"
#include "StreakSatuts_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_PlayerInfo.SG_PlayerInfo_C
// 0x0030 (0x0058 - 0x0028)
class USG_PlayerInfo_C final : public USaveGame
{
public:
	bool                                          FirstLaunch;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastConnection_SAVED;                              // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ConnectionStreak_SAVED;                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StreakReach_SAVED;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamItemDef>                  StreakShop_SAVED;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EStreakSatuts                                 StreakStatus_SAVED;                                // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SG_PlayerInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SG_PlayerInfo_C")
	}
	static class USG_PlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_PlayerInfo_C>();
	}
};

}

