#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Speaker

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Speaker.Speaker_C
// 0x0030 (0x02D8 - 0x02A8)
class ASpeaker_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MusicIndex;                                        // 0x02C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MusicCount;                                        // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePower(bool On_, class AActor* Provider);
	void SetLastSpecialZombieSpawnWave();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void Play_Music__Server_(bool On_);
	void Play_Music__Multicast_(int32 Index_0, bool On_);
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void IsZombieCapReached_(bool* Yes);
	void IncreaseTotalZombiesToSpawnInWave();
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void ExecuteUbergraph_Speaker(int32 EntryPoint);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ElectricalAction();
	void ConnectionInfos(const struct FLinearColor& Color);
	void CanSpawnSpecialZombie(bool* Yes);
	void BossAlreadyInMap_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Speaker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Speaker_C")
	}
	static class ASpeaker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpeaker_C>();
	}
};

}

