#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectatorHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "STR_PCInfo_structs.hpp"
#include "WBP_InteractableMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpectatorHud.SpectatorHud_C
// 0x0368 (0x0740 - 0x03D8)
class USpectatorHud_C final : public UWBP_InteractableMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SpectatorHud_C;                     // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SWITCH;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide;                                              // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               GAMEINFO;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VHS_TEX;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Vhs_C*                             WBP_Vhs;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSTR_PCInfo                            Current_Viewed_Info;                               // 0x0408(0x0318)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FSTR_PCInfo>                    Team_Info;                                         // 0x0720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMediaPlayer*                           MediaPlayerTarget;                                 // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SpectatorHudHidden_;                               // 0x0738(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_SpectatorHud(int32 EntryPoint);
	void Finished_23C14BBB4F513975D5E10A85724891B0();
	void Finished_BA4C84F14F06B18414BD7E9E56752070();
	void HideSpectatorHudAnimation();
	void OnLoaded_A860F0C549D0EDBF7CEF2691542CB4C1(class UObject* Loaded);
	void SwitchPlayers();
	void UpdateStatInfo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SpectatorHud_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpectatorHud_C")
	}
	static class USpectatorHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpectatorHud_C>();
	}
};

}

