#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_BodycamSoundTrack

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_BodycamSoundTrack.ST_BodycamSoundTrack
// 0x0040 (0x0040 - 0x0000)
struct FST_BodycamSoundTrack final
{
public:
	class USoundBase*                             Sound_17_EA76243745CCC4D71C1296BC81EF7334;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 SongName_4_F3E793424B1D44DE32345382284A2614;       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ArtistName_6_5DBCF7774DD8FCC0E54580A1297426A8;     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Link_10_47BEACA5433C0291CCFD4E8DD9B1BFC3;          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon_18_D95F343543CA98C896CC2AA9CFC964DE;          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

