#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DefaultSteamItem

#include "Basic.hpp"

#include "EN_ShopItemClass_structs.hpp"
#include "EN_ShopItemPrice_structs.hpp"
#include "EN_ShopItemType_structs.hpp"
#include "EN_ShopItemSupClass_structs.hpp"
#include "ShopItemPromoRulesEnum_structs.hpp"
#include "ItemQualityEnum_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DefaultSteamItem.ST_DefaultSteamItem
// 0x0160 (0x0160 - 0x0000)
struct FST_DefaultSteamItem final
{
public:
	int32                                         itemdefid_81_720CA68340EE726562444E9FEFFEA124;     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ShopItemType                               type_30_01C75ACB49EC3D242342D8AB67E16188;          // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemPromoRulesEnum                       promo_117_27419B7E43483C262A17D5B37667DD09;        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         drop_interval_135_6529218D483E4A50F1C628BC64FA7710; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bundle_6_D9E8E92B4C91CA1269CE40B3E6D62C6D;         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 icon_url_16_DE4C8CE647755D1F7BC4EC85FC362ECD;      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EN_ShopItemPrice                              price_138_0A2B24D74651E701CCEB2388CB600907;        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemQualityEnum                              itemquality_143_A2D2BF4147F95706D7448C85ECDE862A;  // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          game_hidden_137_447DEFFB4E917030DC3475AAA320D591;  // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         shop_51_F8BB829247F5D153A9C0BCA2888B3511;          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 shopdaystart_66_315E51C44AC3953295496D80F22FF0E8;  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 shopdayend_48_2C00721E46B76D4DAF2927994267E0CC;    // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FColor                                 Color_168_E792573342E4705659E924A99D88DEC9;        // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                Texture_176_890B19F84B5B9416338BAABA2FD3F86C;      // 0x0060(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   displayname_152_689EDE0D42FF53478C3424BE014E9388;  // 0x0088(0x0010)(Edit, BlueprintVisible)
	class FText                                   description_157_9A0376C242ADD935B67760A7295AE6D8;  // 0x0098(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Advantages_165_D543E560463AAD37E86A7D80EEB3D8C6;   // 0x00A8(0x0010)(Edit, BlueprintVisible)
	TArray<class FText>                           Disadvantages_167_3C4982BB4B3102D50C2FA9A10926BFAB; // 0x00B8(0x0010)(Edit, BlueprintVisible)
	EN_ShopItemSupClass                           itemclasssup_93_1C746F5D4541D87AD1517196000CA09C;  // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ShopItemClass                              itemclass_54_E58D587741A5294F71C4BF8F913A5F24;     // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_172_BCE97CF24A41EFE8D141EF9F8E788430; // 0x00D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             StaticMesh_173_64AABDDC488E3924BB9B7FB95329B17A;   // 0x00F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UMaterialInterface>> MaterialSlots_174_18F3DD4E4CC3E45886818A8C09B34F16; // 0x0120(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UTexture>                Icon_175_F2911D9B4B7A1B534907E694B9A0E789;         // 0x0130(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          tradable_20_C23B776D49FF41ED79EEB8AE53231309;      // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          marketable_22_A51D3ABF48FCBD6AD5BD989A00968626;    // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          store_hidden_95_7C790E2A4FFAF23ED12BE8BB860B3040;  // 0x015A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hidden_97_84B213154DA9DFF9B3FF21A610CE7A4A;        // 0x015B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          game_only_99_FF4A37C9412064D6B65CD1AC08065703;     // 0x015C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

