#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Loadout

#include "Basic.hpp"

#include "ST_DefaultSteamItem_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_Loadout.ST_Loadout
// 0x0470 (0x0470 - 0x0000)
struct FST_Loadout final
{
public:
	class FString                                 LoadoutName_19_15A5F81548E71B315B2DA9924325E6C3;   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FST_DefaultSteamItem                   Operator_21_02568017455E5B8A15884AB4BBCA4109;      // 0x0010(0x0160)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           OperatorAttachments_25_8184B7A942CB9C9EEDF160A6B8DB328C; // 0x0170(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FST_DefaultSteamItem                   PrimaryWeapon_4_E7F5F675439493175E2070A8274328F2;  // 0x0180(0x0160)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           PrimaryWeaponAttachments_7_65224125430114F338766D82322F8B2B; // 0x02E0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FST_DefaultSteamItem                   SecondaryWeapon_12_DE08B16B4CAFD7B4051ACFA699D14B23; // 0x02F0(0x0160)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FST_DefaultSteamItem>           SecondaryWeaponAttachments_11_D03B2E7E4BAC38CDAC3B9B921B0226FB; // 0x0450(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FST_DefaultSteamItem>           Equipments_20_F02BA3F04F185D08477B928338DBB9DA;    // 0x0460(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
};

}

