#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_PCStats

#include "Basic.hpp"

#include "STR_KillInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_PCStats.STR_PCStats
// 0x0030 (0x0030 - 0x0000)
struct FSTR_PCStats final
{
public:
	int32                                         Kill_2_9B68EBBF41EF009A7443A5BA123A614E;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Death_5_B7C6FDBC4DDD954FC468B1BACBDDF736;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RankName_24_B21EBB6F41A74122A288B0BB3AC1BEFB;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Global_19_2B68678746474178A949A788D9A9E59B;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score_20_967B75EA4A21E31E9F5CC8888D7B4F4A;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UserConnectionStreak_14_8EF30B644D21DF154AC012ADB4BBCE7C; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_KillInfo>                  KillInfo_18_C07660B540D4692483AD2CB030FDDDB1;      // 0x0020(0x0010)(Edit, BlueprintVisible)
};

}

