#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_WEP_ANIMATION

#include "Basic.hpp"

#include "ALS_OverlayState_structs.hpp"
#include "STR_ANIMATIONS_InOUT_structs.hpp"
#include "STR_ANIMATIONS_structs.hpp"
#include "STR_IK_Values_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_WEP_ANIMATION.STR_WEP_ANIMATION
// 0x0178 (0x0178 - 0x0000)
struct FSTR_WEP_ANIMATION final
{
public:
	TArray<struct FSTR_ANIMATIONS>                Reload_24_F9AA86B04057E84DBFF8DD8F9E26E897;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTR_ANIMATIONS>                StressReload_25_C3E1716349CFC440866D00991694610B;  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTR_ANIMATIONS>                ReloadEmpty_26_935A4A7B44B7A20BB66DEAAB065D4D6D;   // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTR_ANIMATIONS>                StressReloadEmpty_27_3223C94F431F36D518550A81FCE94749; // 0x0030(0x0010)(Edit, BlueprintVisible)
	class UAnimSequence*                          HandOverlay_60_37E74A004FBAC8316DD9FEA1062E3712;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSTR_ANIMATIONS                        Fire_56_4A1D14B94B128E4D76CF1696C77BF7FA;          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_ANIMATIONS>                Inspect_28_15FEE94C4C7ACD1D8BB4FB93DF200859;       // 0x0058(0x0010)(Edit, BlueprintVisible)
	EALS_OverlayState                             AlsOVerlay_22_B2E6F0CC4E608BCD516A7B8A2EF9F7E3;    // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           AimLoc_31_81B20EE94A7958F2F99472B62D68D6CE;        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           AimRot_33_6567D22D4E6CF7FC4C7F3F8772B1DC11;        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           IdleRot_51_250AFD2E438E9B0BB86C65AC8171C89C;       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ADSInTIme_39_E74D36F9478596C143C5C0A4B3A694F9;     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ADSOutTime_41_63DF5BF04A00BD2A761C11861660F122;    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketToAttach_45_32155BBB4F0DFEBD9CF0C28F449D79B3; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_IK_Values                         IkValues_48_E924D66B4ABF969C744078A0737A2F90;      // 0x00A0(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_ANIMATIONS_InOUT                  InOut_55_DDE9D31045DECD5D37EB13BA5CCE11F5;         // 0x0128(0x0020)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_ANIMATIONS>                BoltOpen_64_0912ED514816CD3341BEEA9AC8EB0982;      // 0x0148(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTR_ANIMATIONS>                BoltLoop_66_1047D18F4CAB07154558CA958C57079B;      // 0x0158(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSTR_ANIMATIONS>                BoltEnd_69_28D46F984272BF5C9786F7B4EA580511;       // 0x0168(0x0010)(Edit, BlueprintVisible)
};

}

