#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_WEP

#include "Basic.hpp"

#include "STR_WEP_ANIMATION_structs.hpp"
#include "STR_RECOIL_structs.hpp"
#include "EN_ShopItemClass_structs.hpp"
#include "Engine_structs.hpp"
#include "EN_FireMode_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_WEP.STR_WEP
// 0x0278 (0x0278 - 0x0000)
struct FSTR_WEP final
{
public:
	class FName                                   WepName_12_85F822CF4299B8FB4541D1A1053E2A0B;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           BodyMesh_54_F5703B244B37A1893961B78D49B04470;      // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_RECOIL                            RecoilInfo_14_2F550DD548C99F85FB2D1C911E29083C;    // 0x0030(0x0088)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    MagInfo_25_09949490454397B35E211A8F80A815F5;       // 0x00B8(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FSTR_WEP_ANIMATION                     Animation_23_574905EC43F77C89F6A965AFE119106B;     // 0x00C8(0x0178)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        Damage_17_7F60A88D435DBD7B36C96893C2118EAC;        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RagdollForce_30_AE003A4D4CC8DCBE0647719ACBA8C779;  // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JammedProbability_19_ACA747114DFA5217137A2BA98D90B642; // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              GunShotSounds_34_DD5BD60B4868233227B372A138AB0871; // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              FallingSound_50_37252E4F46066FF57485C38D5BC802B9;  // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EN_FireMode                                   FireMode_53_E7AEF4D24EEC5420D75555A92E651905;      // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemPriority_44_ECD067B44E5D1C6BB96301A82D6D0385;  // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ShopItemClass                              ItemClass_47_030A0C874FF9316298133EA464E2BC3E;     // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowOptic_52_D28D404B43F31E5DEEF5BE9F8F54F7FE;    // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

