#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_PlayerBody

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STR_PlayerBody.STR_PlayerBody
// 0x0020 (0x0020 - 0x0000)
struct FSTR_PlayerBody final
{
public:
	class USkeletalMesh*                          Mesh_2_B5E39DF94167FE3E934867A7AA387EFF;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             Mat_6_93847E4546D1C1719B76BE8CDEE25C82;            // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          Hidden__8_4F16B2A34258586628916B93C54CBA21;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultMesh_10_A549AB64468E36BB965B4C88E0C2DBE7;   // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenLocalView__12_99A77728460F92BCDEF0C09B25EEDFEF; // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

