#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_Rank

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_Rank.STR_Rank
// 0x0038 (0x0038 - 0x0000)
struct FSTR_Rank final
{
public:
	class FText                                   Rank_19_5A0C6400462C36EC0FD955804528F0D2;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         RankInteger_17_4F8985F7416B920CBF873F82C7804564;   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image_5_18E6F1A149CC003E742D48810546CE80;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         RankScoreMin_10_C24493C4402FE8F83B70B5B350BD3545;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Color_18_4A95AC2B422E9F45530600A124E49FC7;         // 0x0024(0x0014)(Edit, BlueprintVisible)
};

}

