#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_SeasonShop

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct STR_SeasonShop.STR_SeasonShop
// 0x0038 (0x0038 - 0x0000)
struct FSTR_SeasonShop final
{
public:
	class FString                                 SteamLeaderboardName_15_A35D672A40CB76FE34B27A9E5D7F0332; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   SeasonName_12_D03C2AFC4FF7E8D6F24E9F97E62D9E16;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Showcase__5_D7EFA2364B4FDDF04BE27CAF55B91EA7;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 itemdefids_9_A37663CB4929B91374211EA7B14A1DFB;     // 0x0028(0x0010)(Edit, BlueprintVisible)
};

}

