#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_TEST

#include "Basic.hpp"

#include "STR_PlayerBody_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_TEST.STR_TEST
// 0x02E0 (0x02E0 - 0x0000)
struct FSTR_TEST final
{
public:
	struct FSTR_PlayerBody                        Vest_3_284ED2824377BC62E3C37196388B5FA1;           // 0x0000(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        VestPatches_5_B6DA05394A85B4F83CB2B3AA7AB4D36A;    // 0x0020(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        VestPouches_8_B533A74044BD108B7C6AFCBC943B2F88;    // 0x0040(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Speaker_10_49CC471648B5004DC47FF8A4141A0544;       // 0x0060(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Blaclava_12_03FAA47143D2C60E906DB49149C1B7A4;      // 0x0080(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Glasses_14_CE3B4E794BE4A6B9969F7C9DB69ADA6A;       // 0x00A0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Headphones_16_07FC73684A394AA8558563B0721898D6;    // 0x00C0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Hat_18_9B29CCE14696033C08B7CBBAD2162A75;           // 0x00E0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        HatPatches_20_91FE3DF94EC21A9DFACBDA968E06A00A;    // 0x0100(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Pants_22_91CAF74E4F811CE1C07236A095F3D9F4;         // 0x0120(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Boots_24_F15E22A84AA00CF17D55C38882622FEF;         // 0x0140(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Mesh_50_381ADFC4434695A9BB941295E2328500;          // 0x0160(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        ShirtPatches_26_A12C620B4F87FF2A6CC391BF02F80447;  // 0x0180(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Gloves_28_205CF5DA44DBEF6E2CBA36BD225CF6C7;        // 0x01A0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Helmet_30_FEF814014F90CDDD7F6CE584FADD13D0;        // 0x01C0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        HelmetPreset_32_C85441E1455C25D73D4FC79EDC557578;  // 0x01E0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        NVG_34_7CAE31474E8B9E77174F04AEEE1CE1A0;           // 0x0200(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        Visor_36_155D9A7942380C285829C3A175024E24;         // 0x0220(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        HelemtPatches_38_45E096354838C3B8AF1C46AB3F371C44; // 0x0240(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        TacticalSHoulders_40_1588A94D4AF548EC4693AF9D13A543D7; // 0x0260(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        TacticalSHouldersPatch_42_D943972342460C3DB141438DAC54E995; // 0x0280(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        WarBelt_44_BF0DB9FD4B0C08985EDF999E236AC8A6;       // 0x02A0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_PlayerBody                        WarBeltPreset_46_6A634F2E4C8430A04E6DC8B02DA10627; // 0x02C0(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

