#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_ZombieMapInfo

#include "Basic.hpp"

#include "EN_ZombieMap_structs.hpp"
#include "STR_MapTheme_structs.hpp"
#include "ActorSpawnProbability_structs.hpp"
#include "STR_SpecialWavesInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_ZombieMapInfo.STR_ZombieMapInfo
// 0x0058 (0x0058 - 0x0000)
struct FSTR_ZombieMapInfo final
{
public:
	EN_ZombieMap                                  ZombieMap_2_E81683F041400D3D99EA1C9DFF1DE21A;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActorSpawnProbability>         EnemyActor_35_AE4C12EC49A048105371BD9F016562AD;    // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FSTR_SpecialWavesInfo                  SpecialWavesInfo_34_F03418084971630B9003C2A6FED658B0; // 0x0018(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSTR_MapTheme                          ZombieMapTheme_31_1F067723476D10B1D493C8832AD3D866; // 0x0038(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}

