#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_GamemodeWinInfo

#include "Basic.hpp"

#include "GameMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_GamemodeWinInfo.STR_GamemodeWinInfo
// 0x00C8 (0x00C8 - 0x0000)
struct FSTR_GamemodeWinInfo final
{
public:
	EGameMode                                     Gamemode_10_D2AF17924EF823C406E8F884E3296EAE;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GamemodeName_57_91E31C194385063752E196962280DEFF;  // 0x0008(0x0010)(Edit, BlueprintVisible)
	class FText                                   GamemodeDesc_59_B29D608143751AC971C814A962F0F6CD;  // 0x0018(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           GamemodeColor_67_FEA96325477D9A86E693EF96251F25AB; // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>> AllowedLevels_99_651A412B46C616EF5057ABA4FF839504; // 0x0038(0x0010)(Edit, BlueprintVisible)
	class USoundCue*                              AnnoucementSound_62_51A2117C4C77649E2A170BB9E80BC4AF; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         RankWin_12_360590724FDBF4E3F1D1D0B17B1CD12F;       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RankLoose_14_E5B39B85464EC720314F9C8E3F4004A8;     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReissadWin_16_BC7374D84675E15A7CF653A159CEF0B2;    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamsGamemode__21_018195884F84291BB8E72E910ABAEA9E; // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RoundBased__26_C051E7FA4E8903540AA15AB9955D9AF9;   // 0x005D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ScoreToWin_34_E11724CE4A6AFA984B705EBE32002975;    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GamemodeTime_24_23102CA8406A1045DAD230BC6399C64A;  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AdjustTimePerKill_50_0764263E4313992FCC253BA3158A51B7; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxKill_29_E90AD68D495497F0DD959C8BB35444DA;       // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChooseTeam_31_88734B714E1A9B2FB763AAB4CAD5C211;    // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlayer_37_0BC34AFC4DF2B3122BF2F189D60E0CA4;     // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinPlayer_39_ADD2EB3B4ED266398AB32D9555452922;     // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowGrenade__43_2B768C8B45DB56CC0B9A1985580427F4; // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChillMode_45_CACBFE844CE2CFE142D325AFF21442D6;     // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DestroyActorDelay_48_3C77C0114DE26D64235070BD67918F88; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TTK_52_B52DAA1A40B9CAA4CD38F486C84EB463;           // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowJoinInProgress_54_4E38F8BE489FEA520F6DF7BE40CD4BC4; // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UniqueRandomWeapons_69_A24DAE0744995601B41BDA9AF6DE7F11; // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowedBots__71_11760ED24D47AA996451DA9A775D433E;  // 0x0093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LockedByPlayingGamemode_GameCountRequired_80_9051A83B4726FDFB9CCCD98EDCB4DC3D; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   WinMessgae_86_88622EE94BC210733888A3B9B1E1549B;    // 0x0098(0x0010)(Edit, BlueprintVisible)
	class FText                                   LooseMessage_88_8DCA39FE4EA47A0B8F88389B14C23BBE;  // 0x00A8(0x0010)(Edit, BlueprintVisible)
	class FText                                   GameEndMessage_91_40441B8345AB6344B049A2A7F0B530D0; // 0x00B8(0x0010)(Edit, BlueprintVisible)
};

}

