#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_MAG

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_MAG.STR_MAG
// 0x0030 (0x0030 - 0x0000)
struct FSTR_MAG final
{
public:
	class UStaticMesh*                            MagMesh_3_36C0D6E749E42F87C9B557B56EEC9B22;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BulletMesh_5_368B325D46E2F6D8AFFFEF837E87D982;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Bullet_11_56419149405762F321C7F1921172D8E4;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProjectilePellet_14_81A341AA4E65135317FFDDAC46FEBCB0; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ShellInfo_17_ED65CB6E41F4113B8BE7AEB238E879C9;     // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor)
	class USoundCue*                              FallingSounds_20_6D690257468FDF40A69488887F65C489; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

