#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SpawnData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SpawnData.Struct_SpawnData
// 0x0078 (0x0078 - 0x0000)
struct FStruct_SpawnData final
{
public:
	TMap<class UClass*, int32>                    TraitList_6_5951F0954EA06BDA52F239A1FFB08884;      // 0x0000(0x0050)(Edit, BlueprintVisible)
	TArray<double>                                AvailableSpeeds_9_45B9E78A40C0D13215B0369E58522442; // 0x0050(0x0010)(Edit, BlueprintVisible)
	int32                                         GroupSize_11_83CBBF194E3D8AFC3161E6B01E494507;     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExpectedHealth_14_F6C3032A4D970E559114149722797B68; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldCommunicateDeath_16_B0EF7E554FA3319851CDA39FFE5764F6; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

