#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STTask_CountMoveToFailed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "StateTreeModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass STTask_CountMoveToFailed.STTask_CountMoveToFailed_C
// 0x0038 (0x0090 - 0x0058)
class USTTask_CountMoveToFailed_C final : public UStateTreeTaskBlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FStateTreeBlueprintPropertyRef         MoveToCount;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         MaxMoveToCount;                                    // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_C*                              Zombie;                                            // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeBlueprintPropertyRef         IsValidZombie;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_STTask_CountMoveToFailed(int32 EntryPoint);
	void ReceiveLatentEnterState(const struct FStateTreeTransitionResult& Transition);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("STTask_CountMoveToFailed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"STTask_CountMoveToFailed_C")
	}
	static class USTTask_CountMoveToFailed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USTTask_CountMoveToFailed_C>();
	}
};

}

