#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Television

#include "Basic.hpp"

#include "EN_ZombieRules_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EN_WaveClass_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Television.Television_C
// 0x0038 (0x02E0 - 0x02A8)
class ATelevision_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   OldTV;                                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          On_;                                               // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaveSoundLoop;                                     // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Waves;                                             // 0x02DC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void UpdatePowerGen__Multicast_(bool On__0);
	void UpdatePower(bool On__0, class AActor* Provider);
	void SetLastSpecialZombieSpawnWave();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void ReceiveBeginPlay();
	void OnRep_Waves();
	void OnRep_On_();
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void IsZombieCapReached_(bool* Yes);
	void IncreaseTotalZombiesToSpawnInWave();
	void HandleWaveStarted(int32 WaveNumber);
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void ExecuteUbergraph_Television(int32 EntryPoint);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void ElectricalAction();
	void ConnectionInfos(const struct FLinearColor& Color);
	void ChangeWaveNumber();
	void CanSpawnSpecialZombie(bool* Yes);
	void BossAlreadyInMap_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Television_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Television_C")
	}
	static class ATelevision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATelevision_C>();
	}
};

}

