#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ObjectRender

#include "Basic.hpp"

#include "S_AnimationsToPlay_structs.hpp"
#include "S_NamesArray_structs.hpp"
#include "Enum_BackgroundType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "AssetRegistry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__EditableTextBox_183_K2Node_ComponentBoundEvent_19_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__EditableTextBox_183_K2Node_ComponentBoundEvent_19_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__EditableTextBox_K2Node_ComponentBoundEvent_21_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__EditableTextBox_K2Node_ComponentBoundEvent_21_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_AnimationsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_AnimationsComboBox_K2Node_ComponentBoundEvent_4_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_AnimationTime_K2Node_ComponentBoundEvent_13_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_AnimationTime_K2Node_ComponentBoundEvent_13_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_BackgroundType_K2Node_ComponentBoundEvent_46_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_BackgroundType_K2Node_ComponentBoundEvent_46_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Blueprints_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Blueprints_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ColorSliders_K2Node_ComponentBoundEvent_45_OnColorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ColorSliders_K2Node_ComponentBoundEvent_45_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ColorSliders_K2Node_ComponentBoundEvent_63_OnColorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ColorSliders_K2Node_ComponentBoundEvent_63_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_CommonCheckbox_K2Node_ComponentBoundEvent_44_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_CommonCheckbox_K2Node_ComponentBoundEvent_44_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_CommonCheckbox_K2Node_ComponentBoundEvent_48_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_CommonCheckbox_K2Node_ComponentBoundEvent_48_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_CommonComboBox_K2Node_ComponentBoundEvent_28_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_CommonComboBox_K2Node_ComponentBoundEvent_28_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ContrastIntensity_K2Node_ComponentBoundEvent_38_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ContrastIntensity_K2Node_ComponentBoundEvent_38_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_EditableBoxPrefix_K2Node_ComponentBoundEvent_29_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_EditableBoxPrefix_K2Node_ComponentBoundEvent_29_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_EditableBoxSuffix_K2Node_ComponentBoundEvent_31_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_EditableBoxSuffix_K2Node_ComponentBoundEvent_31_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ExportFileToFolder_K2Node_ComponentBoundEvent_30_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ExportFileToFolder_K2Node_ComponentBoundEvent_30_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Filter_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Filter_K2Node_ComponentBoundEvent_1_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Filters_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Filters_K2Node_ComponentBoundEvent_0_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_GammaIntensity_K2Node_ComponentBoundEvent_39_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_GammaIntensity_K2Node_ComponentBoundEvent_39_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ImportToProject_K2Node_ComponentBoundEvent_35_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ImportToProject_K2Node_ComponentBoundEvent_35_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_LightColor_1_K2Node_ComponentBoundEvent_75_OnColorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_LightColor_1_K2Node_ComponentBoundEvent_75_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_LightColor_K2Node_ComponentBoundEvent_18_OnColorChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_LightColor_K2Node_ComponentBoundEvent_18_OnColorChanged__DelegateSignature final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_LoadMaterials_K2Node_ComponentBoundEvent_33_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_LoadMaterials_K2Node_ComponentBoundEvent_33_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ObjectMaterialIndex_K2Node_ComponentBoundEvent_57_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ObjectMaterialIndex_K2Node_ComponentBoundEvent_57_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ObjectRender_UI_AutosearchAnims_K2Node_ComponentBoundEvent_68_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ObjectRender_UI_AutosearchAnims_K2Node_ComponentBoundEvent_68_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ObjectRender_UI_SpingboxIconSizeHeight_K2Node_ComponentBoundEvent_87_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ObjectRender_UI_SpingboxIconSizeHeight_K2Node_ComponentBoundEvent_87_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ObjectRender_UI_SpingboxIconSizeWidth_K2Node_ComponentBoundEvent_86_OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ObjectRender_UI_SpingboxIconSizeWidth_K2Node_ComponentBoundEvent_86_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ObjectType_K2Node_ComponentBoundEvent_43_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ObjectType_K2Node_ComponentBoundEvent_43_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_OverwriteFiles_K2Node_ComponentBoundEvent_26_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_OverwriteFiles_K2Node_ComponentBoundEvent_26_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_PixelEffect_1_K2Node_ComponentBoundEvent_67_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_PixelEffect_1_K2Node_ComponentBoundEvent_67_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_PixelEffect_K2Node_ComponentBoundEvent_58_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_PixelEffect_K2Node_ComponentBoundEvent_58_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_PixelEffectBackground_1_K2Node_ComponentBoundEvent_83_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_PixelEffectBackground_1_K2Node_ComponentBoundEvent_83_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Rendering_1_K2Node_ComponentBoundEvent_60_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Rendering_1_K2Node_ComponentBoundEvent_60_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_ShowForeground_K2Node_ComponentBoundEvent_79_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_ShowForeground_K2Node_ComponentBoundEvent_79_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Silhouette_K2Node_ComponentBoundEvent_62_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Silhouette_K2Node_ComponentBoundEvent_62_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_SkeletalMeshes_K2Node_ComponentBoundEvent_41_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_SkeletalMeshes_K2Node_ComponentBoundEvent_41_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_1_K2Node_ComponentBoundEvent_15_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_1_K2Node_ComponentBoundEvent_15_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_2_K2Node_ComponentBoundEvent_16_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_2_K2Node_ComponentBoundEvent_16_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_AberrationOffset_K2Node_ComponentBoundEvent_53_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_AberrationOffset_K2Node_ComponentBoundEvent_53_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_BackgroundRotation_K2Node_ComponentBoundEvent_65_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_BackgroundRotation_K2Node_ComponentBoundEvent_65_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_CameraDistance_K2Node_ComponentBoundEvent_64_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_CameraDistance_K2Node_ComponentBoundEvent_64_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_FieldOfView_1_K2Node_ComponentBoundEvent_50_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_FieldOfView_1_K2Node_ComponentBoundEvent_50_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_ForegroundScale_K2Node_ComponentBoundEvent_81_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_ForegroundScale_K2Node_ComponentBoundEvent_81_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_GlobalBrightness_K2Node_ComponentBoundEvent_17_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_GlobalBrightness_K2Node_ComponentBoundEvent_17_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_GrainIntensity_K2Node_ComponentBoundEvent_51_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_GrainIntensity_K2Node_ComponentBoundEvent_51_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_GrainJitter_K2Node_ComponentBoundEvent_52_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_GrainJitter_K2Node_ComponentBoundEvent_52_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_K2Node_ComponentBoundEvent_14_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_K2Node_ComponentBoundEvent_14_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_K2Node_ComponentBoundEvent_36_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_K2Node_ComponentBoundEvent_36_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_K2Node_ComponentBoundEvent_6_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_K2Node_ComponentBoundEvent_6_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_LighAngle_1_K2Node_ComponentBoundEvent_70_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_LighAngle_1_K2Node_ComponentBoundEvent_70_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_LighAngle_K2Node_ComponentBoundEvent_5_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_LighAngle_K2Node_ComponentBoundEvent_5_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_LightAnglePitch_K2Node_ComponentBoundEvent_77_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_LightAnglePitch_K2Node_ComponentBoundEvent_77_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_MainLightAngle_K2Node_ComponentBoundEvent_74_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_MainLightAngle_K2Node_ComponentBoundEvent_74_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_MainLightAnglePitch_K2Node_ComponentBoundEvent_76_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_MainLightAnglePitch_K2Node_ComponentBoundEvent_76_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_MainLightIntensity_K2Node_ComponentBoundEvent_73_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_MainLightIntensity_K2Node_ComponentBoundEvent_73_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_OcclusionQuality_K2Node_ComponentBoundEvent_72_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_OcclusionQuality_K2Node_ComponentBoundEvent_72_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_OcclusionRadius_K2Node_ComponentBoundEvent_71_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_OcclusionRadius_K2Node_ComponentBoundEvent_71_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_OrthoWidth_K2Node_ComponentBoundEvent_61_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_OrthoWidth_K2Node_ComponentBoundEvent_61_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_PitchRotation_K2Node_ComponentBoundEvent_8_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_PitchRotation_K2Node_ComponentBoundEvent_8_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Slider_RollRotation_K2Node_ComponentBoundEvent_23_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Slider_RollRotation_K2Node_ComponentBoundEvent_23_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_SpingboxIconSizeHeight_1_K2Node_ComponentBoundEvent_59_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_SpingboxIconSizeHeight_1_K2Node_ComponentBoundEvent_59_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_SquaredBackground_K2Node_ComponentBoundEvent_66_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_SquaredBackground_K2Node_ComponentBoundEvent_66_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_SquaredForeground_K2Node_ComponentBoundEvent_80_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_SquaredForeground_K2Node_ComponentBoundEvent_80_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_StaticMeshes_K2Node_ComponentBoundEvent_37_OnSelectionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_StaticMeshes_K2Node_ComponentBoundEvent_37_OnSelectionChanged__DelegateSignature final
{
public:
	class FString                                 ItemSelected;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Temperature_K2Node_ComponentBoundEvent_40_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Temperature_K2Node_ComponentBoundEvent_40_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_Tint_K2Node_ComponentBoundEvent_42_OnChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_Tint_K2Node_ComponentBoundEvent_42_OnChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_TransparentBackground_1_K2Node_ComponentBoundEvent_27_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_TransparentBackground_1_K2Node_ComponentBoundEvent_27_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_TransparentBackground_1_K2Node_ComponentBoundEvent_32_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_TransparentBackground_1_K2Node_ComponentBoundEvent_32_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_TransparentBackground_K2Node_ComponentBoundEvent_24_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_TransparentBackground_K2Node_ComponentBoundEvent_24_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.BndEvt__UI_UseMainLight_K2Node_ComponentBoundEvent_68_OnStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_ObjectRender_C_BndEvt__UI_UseMainLight_K2Node_ComponentBoundEvent_68_OnStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.Can Update Pan on Mouse Down
// 0x0220 (0x0220 - 0x0000)
struct UI_ObjectRender_C_Can_Update_Pan_on_Mouse_Down final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0168(0x00B8)()
};

// Function UI_ObjectRender.UI_ObjectRender_C.Capture Post Process Volume And Light
// 0x00A0 (0x00A0 - 0x0000)
struct UI_ObjectRender_C_Capture_Post_Process_Volume_And_Light final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume_1;        // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.ChangeTab
// 0x0004 (0x0004 - 0x0000)
struct UI_ObjectRender_C_ChangeTab final
{
public:
	int32                                         TabToOpen;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.CreateComboboxOptions
// 0x0048 (0x0048 - 0x0000)
struct UI_ObjectRender_C_CreateComboboxOptions final
{
public:
	TArray<class FName>                           ArrayOptions;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UComboBoxString*                        ComboBox;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function UI_ObjectRender.UI_ObjectRender_C.ExecuteUbergraph_UI_ObjectRender
// 0x17D0 (0x17D0 - 0x0000)
struct UI_ObjectRender_C_ExecuteUbergraph_UI_ObjectRender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_DynamicCast_AsAnim_Sequence_Base;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
