#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerSlotBase

#include "Basic.hpp"

#include "EWidgetStyleState_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.OnPressedSelect
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerSlotBase_C_OnPressedSelect final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerSlotBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.ExecuteUbergraph_WBP_ServerSlotBase
// 0x0108 (0x0108 - 0x0000)
struct WBP_ServerSlotBase_C_ExecuteUbergraph_WBP_ServerSlotBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             K2Node_Event_HighlightState;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlaySound;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyEvent                              K2Node_Event_KeyEvent_3;                           // 0x0008(0x0040)()
	struct FKeyEvent                              K2Node_Event_KeyEvent_2;                           // 0x0048(0x0040)()
	struct FKeyEvent                              K2Node_Event_KeyEvent_1;                           // 0x0088(0x0040)()
	struct FKeyEvent                              K2Node_Event_KeyEvent;                             // 0x00C8(0x0040)()
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.SetWidgetState
// 0x0002 (0x0002 - 0x0000)
struct WBP_ServerSlotBase_C_SetWidgetState final
{
public:
	EWidgetStyleState                             WidgetState_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.ApplyWidgetStyleDisabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerSlotBase_C_ApplyWidgetStyleDisabled final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.ApplyWidgetStyleActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerSlotBase_C_ApplyWidgetStyleActive final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.ApplyWidgetStyleHighlighted
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerSlotBase_C_ApplyWidgetStyleHighlighted final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.OnSetHighlightEffect
// 0x0002 (0x0002 - 0x0000)
struct WBP_ServerSlotBase_C_OnSetHighlightEffect final
{
public:
	EWidgetStyleState                             HighlightState_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlaySound;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.OnPressedRight
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerSlotBase_C_OnPressedRight final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.OnPressedLeft
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerSlotBase_C_OnPressedLeft final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_ServerSlotBase.WBP_ServerSlotBase_C.OnPressedBack
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerSlotBase_C_OnPressedBack final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

}

