#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsPickerSubButton_Silence

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionsPickerSubButton_Silence.WBP_OptionsPickerSubButton_Silence_C.ExecuteUbergraph_WBP_OptionsPickerSubButton_Silence
// 0x0058 (0x0058 - 0x0000)
struct WBP_OptionsPickerSubButton_Silence_C_ExecuteUbergraph_WBP_OptionsPickerSubButton_Silence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_Event_KeyEvent;                             // 0x0008(0x0040)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MenuContainer_C*                   CallFunc_GetOwningContainer_OwningContainer;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButton_Silence.WBP_OptionsPickerSubButton_Silence_C.OnPressedSelect
// 0x0040 (0x0040 - 0x0000)
struct WBP_OptionsPickerSubButton_Silence_C_OnPressedSelect final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_OptionsPickerSubButton_Silence.WBP_OptionsPickerSubButton_Silence_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsPickerSubButton_Silence_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

