#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InteractableUserWidget

#include "Basic.hpp"

#include "WBP_GlobalInteractableUserWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "ENavigationDirection_structs.hpp"
#include "EWidgetStyleState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InteractableUserWidget.WBP_InteractableUserWidget_C
// 0x0110 (0x0470 - 0x0360)
class UWBP_InteractableUserWidget_C : public UWBP_GlobalInteractableUserWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_InteractableUserWidget_C;       // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void()>              OnWidgetClicked;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UPDA_SettingsData_C*                    SettingsData;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             WidgetState;                                       // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionName;                                        // 0x0388(0x0010)(Edit, BlueprintVisible)
	class FText                                   OptionDescription;                                 // 0x0398(0x0010)(Edit, BlueprintVisible)
	ENavigationDirection                          NavigationDirection;                               // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractableUserWidget_C*          UpInteractableWidget;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          DownInteractableWidget;                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          LeftInteractableWidget;                            // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          RightInteractableWidget;                           // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnWidgetFocusReceived;                             // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bPlaySelectSound;                                  // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              OptionImage;                                       // 0x03E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bIsSettingsDirty;                                  // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetActiveOnHighlight;                             // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractableUserWidget_C*          LeftBreakoutWidget;                                // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          RightBreakoutWidget;                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          UpBreakoutWidget;                                  // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          DownBreakoutWidget;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             FallbackState;                                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             HighlightState;                                    // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             PreviousHighlightState;                            // 0x043A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractableMenu_C*                ParentMenuWidget;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Tags;                                              // 0x0448(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnWidgetInitialized;                               // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEndlessNavigation;                                // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void SetWidgetState(EWidgetStyleState WidgetState_0);
	void OnPressedLeft(const struct FKeyEvent& KeyEvent);
	void OnPressedRight(const struct FKeyEvent& KeyEvent);
	void Construct();
	void OnPlayHighlightSound();
	void OverrideWidgetStyleFromConfig();
	void ApplyWidgetStyleDisabled();
	void ApplyWidgetStyleActive();
	void ApplyWidgetStyleHighlighted();
	void ApplyWidgetStyleNormal();
	void ResetSettingsValue();
	void ApplySettingsValue();
	void SetSettingsValue();
	void GetSettingsValue();
	void OnSetHighlightEffect(EWidgetStyleState HighlightState_0, bool bPlaySound);
	void Destruct();
	void FindGridSlotByRowAndColumn(bool NewParam, bool NewParam1);
	void RefreshWidget();
	void GetOwningContainer(class UWBP_MenuContainer_C** OwningContainer);
	void SetSelfAsLastSelectedWidget();
	void HighlightWidget(bool bPlaySound, bool Highlight_);
	void UnhighlightAllAndHighlightSelf(bool bPlaySound, bool Highlight_);
	void SetupEndlessNavigationGrid(int32 MaxRow, int32 MaxColumn);
	void SetupEndlessNavigationUniformGrid(int32 MaxRow, int32 MaxColumn);
	void SetupEndlessNavigationHorizontalVertical();
	void FocusWidget(class UWBP_InteractableUserWidget_C* InWidget);
	void SetupNavigation();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSetupNavigation();
	void OnPressedReset(const struct FKeyEvent& KeyEvent);
	void OnPressedExtra(const struct FKeyEvent& KeyEvent);
	void OnUserWidgetFocusChanged();
	void OnResetHighlightEffect();
	void OnPressedSelect(const struct FKeyEvent& KeyEvent);
	void OnPressedBack(const struct FKeyEvent& KeyEvent);
	void OnPressedUp(const struct FKeyEvent& KeyEvent);
	void OnPressedDown(const struct FKeyEvent& KeyEvent);
	void OnParentMenuSetupComplete();
	void OnPressedApply(const struct FKeyEvent& KeyEvent);
	void ExecuteUbergraph_WBP_InteractableUserWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InteractableUserWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InteractableUserWidget_C")
	}
	static class UWBP_InteractableUserWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InteractableUserWidget_C>();
	}
};

}

