#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WC_BaseWidget

#include "Basic.hpp"

#include "BPE_WeaponSlots_structs.hpp"


namespace SDK::Params
{

// Function WBP_WC_BaseWidget.WBP_WC_BaseWidget_C.GetBPIWeaponActor
// 0x0020 (0x0020 - 0x0000)
struct WBP_WC_BaseWidget_C_GetBPIWeaponActor final
{
public:
	class AActor*                                 Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_WC_BaseWidget.WBP_WC_BaseWidget_C.GetWeaponActorSaveData
// 0x0048 (0x0048 - 0x0000)
struct WBP_WC_BaseWidget_C_GetWeaponActorSaveData final
{
public:
	EBPE_WeaponSlots                              Slot_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDAC_WeaponAttachment_C*                Item;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Weapon_C>         K2Node_DynamicCast_AsBPI_Weapon;                   // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDAC_WeaponAttachment_C*                CallFunc_GetSavedItemForSlot_Item;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

