#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuContainerInstantiator

#include "Basic.hpp"

#include "EInputDeviceType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuContainerInstantiator.WBP_MenuContainerInstantiator_C
// 0x00A0 (0x0370 - 0x02D0)
class UWBP_MenuContainerInstantiator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UUserWidget>             ActiveContainer;                                   // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	EInputDeviceType                              CurrentInputDevice;                                // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Payload;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FirstShownMenu;                                    // 0x0310(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   MenuCameras;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	class ABP_MenuSystemActor_C*                  MenuSystemActor;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsMainMenuLevel;                                   // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDA_MenuSystemConfig_C*                MenuSystemConfig;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   MenuCameras2;                                      // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_MenuContainerInstantiator(int32 EntryPoint);
	void OnLoaded_4DD9395F4260BABDFE5578AEF0CFA4E5(TSubclassOf<class UObject> Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MenuContainerInstantiator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MenuContainerInstantiator_C")
	}
	static class UWBP_MenuContainerInstantiator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuContainerInstantiator_C>();
	}
};

}

