#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainOptionsTabs_Silence

#include "Basic.hpp"

#include "EInputDeviceType_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_InteractableMenu_classes.hpp"
#include "ETransitionAnimation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainOptionsTabs_Silence.WBP_MainOptionsTabs_Silence_C
// 0x0090 (0x0468 - 0x03D8)
class UWBP_MainOptionsTabs_Silence_C final : public UWBP_InteractableMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MainOptionsTabs_Silence_C;      // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Career;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Loadout;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Locker;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MenuCanvasPanel;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Play;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Quit;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Settings;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleScreenButton_Silence_C*       Shop;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputIcon_C*                       WBP_InputIconLeft;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputIcon_C*                       WBP_InputIconRight;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuContainer_C*                   Target;                                            // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableMenu_C*                From_Menu;                                         // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CLDisplay_Hide;                                    // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CLDisplay_Text;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OverrideWidgetStyleFromConfig();
	void OnFailure_648A2C7145735F6CC4767FBCA23D61EC();
	void OnSuccess_648A2C7145735F6CC4767FBCA23D61EC();
	void OnFailure_3A3193DF46FD6EBCDEC311B0F5199E30();
	void OnSuccess_3A3193DF46FD6EBCDEC311B0F5199E30();
	void OnNavigationEnter(class UWBP_InteractableMenu_C* NavigateFromMenu, EInputDeviceType InputDeviceType);
	void OnNavigationExit(TSoftClassPtr<class UClass> ToMenu, const class FString& MenuLayer_0, ETransitionAnimation TransitionAnimation, double TransitionSpeed, class UObject* InPayload);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnFooterButtonBack();
	void OnPressedBack(const struct FKeyEvent& KeyEvent);
	void BndEvt__WBP_MainOptionsTabs_Silence_Lobby_K2Node_ComponentBoundEvent_0_OnWidgetClicked__DelegateSignature();
	void BndEvt__WBP_MainOptionsTabs_Silence_Shop_K2Node_ComponentBoundEvent_4_OnWidgetClicked__DelegateSignature();
	void BndEvt__WBP_MainOptionsTabs_Silence_Locker_K2Node_ComponentBoundEvent_5_OnWidgetClicked__DelegateSignature();
	void BndEvt__WBP_MainOptionsTabs_Silence_Rank_K2Node_ComponentBoundEvent_8_OnWidgetClicked__DelegateSignature();
	void BndEvt__WBP_MainOptionsTabs_Silence_Settings_K2Node_ComponentBoundEvent_9_OnWidgetClicked__DelegateSignature();
	void BndEvt__WBP_MainOptionsTabs_Silence_Quit_K2Node_ComponentBoundEvent_10_OnWidgetClicked__DelegateSignature();
	void OnDecisionDialogAccept();
	void OnDecisionDialogDecline();
	void OnDecisionDialogAutoRevert();
	void OnDecisionDialogCancel();
	void OnDecisionDialogAcceptLobby();
	void CustomEvent_1();
	void CustomEvent_2();
	void CustomEvent_3();
	void BndEvt__WBP_MainOptionsTabs_Silence_Loadout_K2Node_ComponentBoundEvent_1_OnWidgetClicked__DelegateSignature();
	void ExecuteUbergraph_WBP_MainOptionsTabs_Silence(int32 EntryPoint);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MainOptionsTabs_Silence_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MainOptionsTabs_Silence_C")
	}
	static class UWBP_MainOptionsTabs_Silence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainOptionsTabs_Silence_C>();
	}
};

}

