#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsPicker_Silence1

#include "Basic.hpp"

#include "EWidgetStyleState_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionsPicker_Silence1.WBP_OptionsPicker_Silence1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsPicker_Silence1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPicker_Silence1.WBP_OptionsPicker_Silence1_C.SetWidgetState
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsPicker_Silence1_C_SetWidgetState final
{
public:
	EWidgetStyleState                             WidgetState_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPicker_Silence1.WBP_OptionsPicker_Silence1_C.OnPressedLeft
// 0x0040 (0x0040 - 0x0000)
struct WBP_OptionsPicker_Silence1_C_OnPressedLeft final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_OptionsPicker_Silence1.WBP_OptionsPicker_Silence1_C.OnPressedRight
// 0x0040 (0x0040 - 0x0000)
struct WBP_OptionsPicker_Silence1_C_OnPressedRight final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_OptionsPicker_Silence1.WBP_OptionsPicker_Silence1_C.ExecuteUbergraph_WBP_OptionsPicker_Silence1
// 0x0090 (0x0090 - 0x0000)
struct WBP_OptionsPicker_Silence1_C_ExecuteUbergraph_WBP_OptionsPicker_Silence1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWidgetStyleState                             K2Node_Event_WidgetState;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_Event_KeyEvent_1;                           // 0x0008(0x0040)()
	struct FKeyEvent                              K2Node_Event_KeyEvent;                             // 0x0048(0x0040)()
	class UWBP_MenuContainer_C*                   CallFunc_GetOwningContainer_OwningContainer;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

}

