#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OptionsPickerSubButtonBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EWidgetStyleState_structs.hpp"


namespace SDK::Params
{

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.ExecuteUbergraph_WBP_OptionsPickerSubButtonBase
// 0x0010 (0x0010 - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_ExecuteUbergraph_WBP_OptionsPickerSubButtonBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndex_OutIndex;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.GetIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_GetIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.OverrideWidgetStyleFromConfig
// 0x004C (0x004C - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_OverrideWidgetStyleFromConfig final
{
public:
	struct FLinearColor                           CallFunc_GetColorByName_Color;                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_Color_1;                   // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColorByName_Color_2;                   // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorByName_Color_3;                   // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.SetIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_SetIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_OptionsPickerSubButtonBase.WBP_OptionsPickerSubButtonBase_C.SetSubButtonStyle
// 0x0002 (0x0002 - 0x0000)
struct WBP_OptionsPickerSubButtonBase_C_SetSubButtonStyle final
{
public:
	EWidgetStyleState                             WidgetStyleState_0;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

