#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SoundManagerUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FUISound_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SoundManagerUI.WBP_SoundManagerUI_C
// 0x0080 (0x0350 - 0x02D0)
class UWBP_SoundManagerUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FFUISound>                      SoundQueue;                                        // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsProcessingQueue;                                // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDA_MenuSystemConfig_C*                MenuSystemConfig;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        MusicAudioComponent;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 TempNewDeviceID;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentAudioOutputDeviceName;                      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        SearchGameSound;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPlay_;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Row_Name;                                          // 0x032C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Song__;                                            // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Paused_;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Link;                                              // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	class UAudioComponent* AddMusicAudioComponent();
	void ClearBackgroundMusic();
	void ExecuteUbergraph_WBP_SoundManagerUI(int32 EntryPoint);
	void GetLink();
	void OnAudioFinished_Event();
	void OnAudioOutputDeviceSwapCompleted(const struct FSwapAudioOutputResult& SwapResult);
	void OnGetAvailableOutputDevices(const TArray<struct FAudioOutputDeviceInfo>& AvailableDevices);
	void OnGetCurrentAudioOutputDevice(const class FString& CurrentDevice);
	void OnGetCurrentAudioOutputDeviceDuringSwap(const class FString& CurrentDevice);
	void OnObtainAudioOutputDevices(const TArray<struct FAudioOutputDeviceInfo>& AvailableDevices);
	void OnPlayBackgroundMusic(class FName RowName, float StartTime, bool Bypass_Security__);
	void OnPreloadSounds();
	void OnProcessQueue();
	void OnRandomBackgroundMusic();
	void OnSetCurrentAudioOutputDeviceName();
	void OnStartQueueProcessing();
	void OnSwapAudioOutputDevice(const class FString& NewDeviceId);
	void PlayAcceptSound();
	void PlayBackSound();
	void PlayButtonPressSound();
	void PlayCameraSwitchSound();
	void PlayClearInputBindingSound();
	void PlayDecisionDialogPopupSound();
	void PlayDeclineSound();
	void PlayForwardSound();
	void PlayHighlightSound();
	void PlayIngameMenuCloseSound();
	void PlayIngameMenuOpenSound();
	void PlayMenuSound(const struct FFUISound& Sound);
	void PlayNextSong();
	void PlayPause();
	void PlayPreviousSong();
	void PlaySliderSound(double CurrentValueNormalized);
	void PlayValueChangeSound();
	void Replay();
	void StartPlaySearchGameSound();
	void StopSearchGameSound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SoundManagerUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SoundManagerUI_C")
	}
	static class UWBP_SoundManagerUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SoundManagerUI_C>();
	}
};

}

