#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InlineButton_Silence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_ButtonBase_classes.hpp"
#include "EWidgetAnimation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InlineButton_Silence.WBP_InlineButton_Silence_C
// 0x0030 (0x0640 - 0x0610)
class UWBP_InlineButton_Silence_C final : public UWBP_ButtonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_InlineButton_Silence_C;         // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverScale;                                        // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MoveRight;                                         // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionNameText;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__OptionsButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__OptionsButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnPlayHighlightSound();
	void OnPressedSelect(const struct FKeyEvent& KeyEvent);
	void ExecuteUbergraph_WBP_InlineButton_Silence(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InlineButton_Silence_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InlineButton_Silence_C")
	}
	static class UWBP_InlineButton_Silence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InlineButton_Silence_C>();
	}
};

}

