#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuContainer

#include "Basic.hpp"

#include "WBP_GlobalInteractableUserWidget_classes.hpp"
#include "EInputDeviceType_structs.hpp"
#include "Engine_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "ETransitionAnimation_structs.hpp"
#include "FTransitionAnimationMapping_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuContainer.WBP_MenuContainer_C
// 0x0300 (0x0660 - 0x0360)
class UWBP_MenuContainer_C : public UWBP_GlobalInteractableUserWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_MenuContainer_C;                // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftClassPtr<class UClass>>           MenuNavigationStack;                               // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsMainMenuLevel;                                  // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MenuSystemActor_C*                  MenuSystemActor;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class UUserWidget>             MenuBackground;                                    // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FFTransitionAnimationMapping>   TransitionAnimationMappings;                       // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 HighlightedMenuLayer;                              // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class ACameraActor*                           ActiveMenuCamera;                                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   MenuCameras;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	int32                                         LastInteractingLocalPlayerIndex;                   // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ControllerPlatformName;                            // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_SoundManagerUI_C*                  SoundManager;                                      // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInputDeviceType                              ContainerInputDeviceType;                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWBP_InteractableMenu_C> MenuFooterBar;                                     // 0x0410(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsActionCooledDown;                               // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBackCooledDown;                                 // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNavigationCooledDown;                           // 0x043A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43B[0x5];                                      // 0x043B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWBP_InteractableMenu_C> LoadingScreenWidget;                               // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bAllowTransitionBack;                              // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           CanvasPanelRef;                                    // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                MainLayerRef;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                SubTabsLayerRef;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                SubMenuLayerRef;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                DialogLayerRef;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                FooterBarLayerRef;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                LoadingScreenLayerRef;                             // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ForegroundLayerRef;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BackgroundLayerRef;                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   FirstShownMenu;                                    // 0x04B8(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   IntroMenu;                                         // 0x04E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   TitleScreenMenu;                                   // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UObject*                                Payload;                                           // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class FName, struct FEnhancedActionKeyMapping> MenuInputMap;                                // 0x0538(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSoftClassPtr<class UClass>                   Menu_to_Add;                                       // 0x0588(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   SelectionMapMenu;                                  // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   Intro_Menu_Obj_Ref;                                // 0x05D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TArray<class ACameraActor*>                   MenuCameras2;                                      // 0x0600(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	TSoftClassPtr<class UClass>                   MainMenuRef;                                       // 0x0610(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EarnRef;                                           // 0x0638(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetupTransitionAnimationMapping();
	void ExecuteUbergraph_WBP_MenuContainer(int32 EntryPoint);
	void Add_EarnItem_Menu_To_Canvas();
	void GetCombinedInputBindings(TMap<class FName, struct FFEnhanchedActionKeyMappingWithContext>* CombinedInputBindings);
	void SetupMenuInputMap();
	void GetWidgetAnimationFromMapping(ETransitionAnimation TransitionAnimation, class UWidgetAnimation** WidgetAnimationIn, class UWidgetAnimation** WidgetAnimationOut);
	void MenuLayerNameToWidget(const class FString& MenuLayer_0, class UBorder** LayerWidget);
	void OpenFirstShownMenu(TSoftClassPtr<class UClass> ToMenu, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed);
	void OpenMainMenu();
	void SetupMenuContainer();
	class UWBP_InteractableMenu_C* GetMenuOnLayer(const class FString& MenuLayer_0);
	void UpdateAllInputIcons();
	void InitControllerPlatformName();
	void RemoveLoadingScreen();
	void Show_Loading_Screen(class UObject* ReceivedPayload, class UWBP_InteractableMenu_C** LoadingScreen);
	void SetupSoundManager();
	void SetControllerPlatformName(const class FString& ControllerType);
	void SetInputDeviceTypeOnAllMenuLayers(const struct FKey& PressedKey, bool bIsMouseInput);
	void PassInputEventToOtherMenuLayer(const struct FEnhancedActionKeyMapping& KeyMapping, const struct FKeyEvent& KeyEvent, const class FString& SourceMenuLayer, bool* InputHandled);
	void SetAllowNavigationOnAllMenuLayers(bool InAllowNavigation, bool InDontChangeAllowNavigationOfMenu);
	struct FEventReply KeyUp(const struct FGeometry& Geometry, const struct FKeyEvent& KeyEvent);
	struct FEventReply KeyDown(const struct FGeometry& Geometry, const struct FKeyEvent& KeyEvent, bool bPassBlackListedKeysToOtherMenuLayers);
	void Change_Active_Menu_Camera(class ACameraActor* Camera, float BlendTime, EViewTargetBlendFunction BlendFunc, float BlendExp, bool bLockOutgoing, bool Blend_);
	void SetHighlightedMenuLayer(const class FString& MenuLayer_0);
	void TransitionBackFromFooter();
	void TransitionBackFromSpecialMenu();
	void StartMenuTransitionOut(TSoftClassPtr<class UClass> MenuToAdd, const class FString& InMenuLayer, class UBorder* MenuLayerWidget, class UWBP_InteractableMenu_C* InPreviousMenu, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed, class UObject* InPayload);
	void CreateAndShowDecisionDialog(class UWBP_InteractableMenu_C* SourceMenu, const class FText& HeaderText, const class FText& BodyText, const class FText& AcceptText, const class FText& DeclineText, double SecondsUntilRevert, const TDelegate<void()>& Accept, const TDelegate<void()>& Decline, const TDelegate<void()>& AutoRevert, const TDelegate<void()>& Cancel, class UObject* InPayload, class UWBP_DecisionDialog_Silence_C** DecisionDialog);
	void RemoveMenuFooterBar();
	void AddMenuFooterBar(class UWBP_InteractableMenu_C* FromMenu, TArray<struct FFFooterBarButtonData>& InFooterBarData);
	void AddMenuBackground();
	void ClearSublayerMenus();
	void AddMenuDuringTransition(const class FString& InMenuLayer, class UPanelWidget* MenuLayerWidget, TSoftClassPtr<class UClass> MenuToAdd, class UWBP_InteractableMenu_C* InPreviousMenu, class UObject* InPayload, class UWBP_InteractableMenu_C** NewMenu);
	void Add_Menu_To_Canvas(TSoftClassPtr<class UClass> MenuToAdd, const class FString& InMenuLayer, class UWBP_InteractableMenu_C* PreviousMenu, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed, class UObject* InPayload, class UWBP_InteractableMenu_C** NewMenu);
	void TransitionBack(class UWBP_InteractableMenu_C* FromMenu);
	void TransitionToTargetMenu(class UWBP_InteractableMenu_C* FromMenu, TSoftClassPtr<class UClass> ToMenu, const class FString& MenuLayer_0, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed, class UObject* InPayload);
	void OnTransitionOutAnimationFinished(float duration, const class FString& InMenuLayer, class UPanelWidget* MenuLayerWidget, TSoftClassPtr<class UClass> MenuToAdd, class UWBP_InteractableMenu_C* InPreviousMenu, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed, class UObject* InPayload);
	void OnTransitionInAnimationFinished(float duration);
	void OnActionCooldown(float duration);
	void OnNavigationCooldown(float duration);
	void OnBackCooldown(float duration);
	void OnTransitionToTargetMenu(class UWBP_InteractableMenu_C* FromMenu, TSoftClassPtr<class UClass> ToMenu, const class FString& MenuLayer_0, ETransitionAnimation TransitionAnimation, double TransitionAnimationSpeed, class UObject* InPayload);
	void OnPreLoadBaseClasses();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MenuContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MenuContainer_C")
	}
	static class UWBP_MenuContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuContainer_C>();
	}
};

}

