#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LargeTabButton_Silence

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_ButtonBase_classes.hpp"
#include "EWidgetAnimation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LargeTabButton_Silence.WBP_LargeTabButton_Silence_C
// 0x0038 (0x0648 - 0x0610)
class UWBP_LargeTabButton_Silence_C final : public UWBP_ButtonBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_LargeTabButton_Silence_C;       // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MoveRight;                                         // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverScale;                                        // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MenuButton;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               OptionsSizeBox;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OuterBorder;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MainButton_Silence_MainButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_MainButton_Silence_MainButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_LargeTabButton_Silence(int32 EntryPoint);
	void OnPlayHighlightSound();
	void OnPressedLeft(const struct FKeyEvent& KeyEvent);
	void OnPressedRight(const struct FKeyEvent& KeyEvent);
	void OnPressedSelect(const struct FKeyEvent& KeyEvent);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_LargeTabButton_Silence_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_LargeTabButton_Silence_C")
	}
	static class UWBP_LargeTabButton_Silence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LargeTabButton_Silence_C>();
	}
};

}

