#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonBase

#include "Basic.hpp"

#include "FWidgetAnimationData_structs.hpp"
#include "Engine_structs.hpp"
#include "FFontStyle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EWidgetStyleState_structs.hpp"
#include "WBP_InteractableUserWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ButtonBase.WBP_ButtonBase_C
// 0x01A0 (0x0610 - 0x0470)
class UWBP_ButtonBase_C : public UWBP_InteractableUserWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_ButtonBase_C;                   // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           BackgroundColor;                                   // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DisabledColor;                                     // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HighlightColor;                                    // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ButtonRef;                                         // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                OuterBorderRef;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ButtonTextRef;                                     // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxRef;                                        // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextHighlightColor;                                // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextActiveColor;                                   // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextDisabledColor;                                 // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFFontStyle                            TextFontStyle;                                     // 0x0518(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       HighlightAnimation;                                // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFWidgetAnimationData                  HighlightAnimationData;                            // 0x05A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhighlightAnimation;                              // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFWidgetAnimationData                  UnhighlightAnimationData;                          // 0x05D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_ButtonStyle_C*                     StyleData;                                         // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsButtonAnimationActive;                          // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnPressedSelect(const struct FKeyEvent& KeyEvent);
	void ApplyWidgetStyleDisabled();
	void ApplyWidgetStyleActive();
	void ApplyWidgetStyleHighlighted();
	void ApplyWidgetStyleNormal();
	void OverrideWidgetStyleFromConfig();
	void SetWidgetState(EWidgetStyleState WidgetState_0);
	void SetupButtonText();
	void OnPressedBack(const struct FKeyEvent& KeyEvent);
	void OnSetHighlightEffect(EWidgetStyleState HighlightState_0, bool bPlaySound);
	void OnButtonHovered();
	void OnButtonClicked();
	void OnPressedLeft(const struct FKeyEvent& KeyEvent);
	void OnPressedRight(const struct FKeyEvent& KeyEvent);
	void OnPressedDown(const struct FKeyEvent& KeyEvent);
	void OnPressedUp(const struct FKeyEvent& KeyEvent);
	void OnButtonUnHovered();
	void ExecuteUbergraph_WBP_ButtonBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ButtonBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ButtonBase_C")
	}
	static class UWBP_ButtonBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ButtonBase_C>();
	}
};

}

