#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryMenu_Silence

#include "Basic.hpp"

#include "EInputDeviceType_structs.hpp"
#include "ETransitionAnimation_structs.hpp"
#include "FFooterBarButtonData_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.ExecuteUbergraph_WBP_InventoryMenu_Silence
// 0x0110 (0x0110 - 0x0000)
struct WBP_InventoryMenu_Silence_C_ExecuteUbergraph_WBP_InventoryMenu_Silence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_InteractableMenu_C*                K2Node_Event_NavigateFromMenu;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInputDeviceType                              K2Node_Event_InputDeviceType;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   K2Node_Event_ToMenu;                               // 0x0018(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_Event_MenuLayer;                            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ETransitionAnimation                          K2Node_Event_TransitionAnimation;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_TransitionSpeed;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_InPayload;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyEvent                              K2Node_Event_KeyEvent;                             // 0x0070(0x0040)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFFooterBarButtonData                  K2Node_MakeStruct_FFooterBarButtonData;            // 0x00C0(0x0018)(HasGetValueTypeHash)
	TArray<struct FFFooterBarButtonData>          K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	TArray<class UWBP_InteractableUserWidget_C*>  K2Node_Event_MenuFooterBarButtons;                 // 0x00E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UWBP_MenuContainer_C*                   CallFunc_GetOwningContainer_OwningContainer;       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanLaunchURL_ReturnValue;                 // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.OnFooterBarMenuSetupComplete
// 0x0010 (0x0010 - 0x0000)
struct WBP_InventoryMenu_Silence_C_OnFooterBarMenuSetupComplete final
{
public:
	TArray<class UWBP_InteractableUserWidget_C*>  MenuFooterBarButtons;                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.OnNavigationEnter
// 0x0010 (0x0010 - 0x0000)
struct WBP_InventoryMenu_Silence_C_OnNavigationEnter final
{
public:
	class UWBP_InteractableMenu_C*                NavigateFromMenu;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EInputDeviceType                              InputDeviceType;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.OnNavigationExit
// 0x0050 (0x0050 - 0x0000)
struct WBP_InventoryMenu_Silence_C_OnNavigationExit final
{
public:
	TSoftClassPtr<class UClass>                   ToMenu;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 MenuLayer_0;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ETransitionAnimation                          TransitionAnimation;                               // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TransitionSpeed;                                   // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                InPayload;                                         // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.OnPressedBack
// 0x0040 (0x0040 - 0x0000)
struct WBP_InventoryMenu_Silence_C_OnPressedBack final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function WBP_InventoryMenu_Silence.WBP_InventoryMenu_Silence_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_InventoryMenu_Silence_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

