#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InteractableMenu

#include "Basic.hpp"

#include "EInputDeviceType_structs.hpp"
#include "WBP_GlobalInteractableUserWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "EMenuInputWhitelistPreset_structs.hpp"
#include "EWidgetStyleState_structs.hpp"
#include "UMG_structs.hpp"
#include "ETransitionAnimation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InteractableMenu.WBP_InteractableMenu_C
// 0x0078 (0x03D8 - 0x0360)
class UWBP_InteractableMenu_C : public UWBP_GlobalInteractableUserWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_InteractableMenu_C;             // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_InteractableMenu_C*                PreviousMenu;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UWBP_InteractableUserWidget_C*>  InteractableUserWidgets;                           // 0x0370(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UPanelWidget*                           MenuCanvasPanelWidget;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          LastSelectedUserWidget;                            // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          ActiveUserWidget;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InteractableUserWidget_C*          DefaultSelectedUserWidget;                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBenchmarkRunning;                               // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultMenuLayer;                                  // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ReceivedPayload;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bAutoHighlightWidgetOnEnter;                       // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_InteractableUserWidget_C* InteractableUserWidget)> OnFocusChangedInMenu; // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void ExecuteUbergraph_WBP_InteractableMenu(int32 EntryPoint);
	void RefreshAllWidgetsInMenu();
	void SetWhitelistedInput(EMenuInputWhitelistPreset MenuInputWhitelistPreset_0);
	void SetStyleOnWidgetsWithTag(class FName Tag, EWidgetStyleState Widget_Style);
	void GetAllWidgetsInMenuByTag(class FName Tag, TArray<class UWBP_InteractableUserWidget_C*>* Widgets);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply KeyUp(const struct FGeometry& Geometry, const struct FKeyEvent& KeyEvent);
	struct FEventReply KeyDown(const struct FGeometry& Geometry, const struct FKeyEvent& KeyEvent, bool bPassBlackListedKeysToOtherMenuLayers);
	void ResumeGameFromMenu();
	void ClearActiveUserWidget();
	void SetActiveUserWidget(class UWBP_InteractableUserWidget_C* UserWidget);
	void ForwardMenuSetupCompleteToChildren();
	void CheckMenuForDirtyOptions(bool* bIsMenuDirty);
	void TriggerResetSettings();
	void TriggerApplySettings();
	void TriggerLoadSettings();
	void ShowDecisionDialogFromMenu(const class FText& HeaderText, const class FText& BodyText, const class FText& AcceptText, const class FText& DeclineText, double SecondsUntilRevert, const TDelegate<void()>& Accept, const TDelegate<void()>& Decline, const TDelegate<void()>& AutoRevert, const TDelegate<void()>& Cancel, class UObject* InPayload, class UWBP_DecisionDialog_Silence_C** DecisionDialog);
	void SetMenuAndChildReferences(class UPanelWidget* MenuCanvasPanelWidget_0);
	void UpdateDisplayedInputIcons(EInputDeviceType InputDeviceType);
	void GetFirstEnabledInteractableUserWidget(class UWBP_InteractableUserWidget_C** FirstInteractableUserWidget);
	void SetActiveDefaultOrLastSelectedWidget();
	void HighlightDefaultOrLastSelectedWidget();
	void NavigateBackFromSpecialMenu();
	void NavigateBack();
	void ResetAllowNavigation();
	void SetupNavigation();
	void SetInteractableUserWidgetReferences(class UPanelWidget* InPanel);
	void OnSpecialPreConstruct(class UPanelWidget* InMenuCanvasPanel);
	void OnChangeInputDeviceMenuUI(EInputDeviceType NewInputDeviceType);
	void OnEndApply();
	void OnAnyOptionChanged(bool bIsAnyOptionDirty);
	void OnFocusChanged(class UWBP_InteractableUserWidget_C* InteractableUserWidget);
	void PreConstruct(bool IsDesignTime);
	void OnNavigationExit(TSoftClassPtr<class UClass> ToMenu, const class FString& MenuLayer_0, ETransitionAnimation TransitionAnimation, double TransitionSpeed, class UObject* InPayload);
	void OnRunHardwareBenchmark();
	void OnPressedBack(const struct FKeyEvent& KeyEvent);
	void OnMenuSetupComplete();
	void OnFooterBarMenuSetupComplete(const TArray<class UWBP_InteractableUserWidget_C*>& MenuFooterBarButtons);
	void OnPressedApply(const struct FKeyEvent& KeyEvent);
	void OnNavigationEnter(class UWBP_InteractableMenu_C* NavigateFromMenu, EInputDeviceType InputDeviceType);
	void OnPressedExtra(const struct FKeyEvent& KeyEvent);
	void OnPressedReset(const struct FKeyEvent& KeyEvent);
	void OnGameUserSettingsUpdated();
	void OnBenchmarkCompleted();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InteractableMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InteractableMenu_C")
	}
	static class UWBP_InteractableMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InteractableMenu_C>();
	}
};

}

