#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WEP_MAG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "STR_MAG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WEP_MAG.WEP_MAG_C
// 0x0068 (0x0310 - 0x02A8)
class AWEP_MAG_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Body_Mag;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    DT_MAG;                                            // 0x02C0(0x0010)(Edit, BlueprintVisible, Net, NoDestructor, ExposeOnSpawn)
	int32                                         BulletCurrent;                                     // 0x02D0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletMax;                                         // 0x02D4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTR_MAG                               Mag_Info;                                          // 0x02D8(0x0030)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AWEP_C*                                 WEP;                                               // 0x0308(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WEP_MAG_Body_Mag_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__WEP_MAG_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void DestroyMag__Server_();
	void Drop__Mulsticast_();
	void Drop__Server_();
	void ExecuteUbergraph_WEP_MAG(int32 EntryPoint);
	void Init();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WEP_MAG_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WEP_MAG_C")
	}
	static class AWEP_MAG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWEP_MAG_C>();
	}
};

}

