#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALS_RotationMode_structs.hpp"
#include "EN_ZombieRules_structs.hpp"
#include "MovementSettings_structs.hpp"
#include "ALS_Stance_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_Team_structs.hpp"
#include "ALS_MovementAction_structs.hpp"
#include "ALS_MovementState_structs.hpp"
#include "ALS_Gait_structs.hpp"
#include "ALS_ViewMode_structs.hpp"
#include "ALS_OverlayState_structs.hpp"
#include "EN_WaveClass_structs.hpp"
#include "GameMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Zombie.Zombie_C
// 0x0210 (0x0860 - 0x0650)
#pragma pack(push, 0x1)
class alignas(0x10) AZombie_C : public ACharacter
{
public:
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GrabBox;                                           // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWW_SurvivorStatus_C*                   WW_SurvivorStatus;                                 // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWW_RagdollSystem_C*                    WW_RagdollSystem;                                  // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SmoothNewLocation_NewTrack_0_D9FBD1A5420B8C61010AF681039CE288; // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SmoothNewLocation__Direction_D9FBD1A5420B8C61010AF681039CE288; // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SmoothNewLocation;                                 // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastRagdollVelocity;                               // 0x0688(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RagdollLocation;                                   // 0x06A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ServerRagdollPull;                                 // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          MainAnimInstance;                                  // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetToGo;                                        // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Mantle;                                            // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             PlayerKilled;                                      // 0x06D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x06E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMovementSettings                      CurrentMovementSettings;                           // 0x06F8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBeDestroyable_;                                 // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 WeaponsHandle;                                     // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ScreamSoundComponent;                              // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Jumped_;                                           // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSprinter_;                                       // 0x0731(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_732[0x6];                                      // 0x0732(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGM_Zombie_C*                           As_GM_Zombie;                                      // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        NormalSoundComponent;                              // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ZombieSkin;                                        // 0x0748(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          SpecialZombie;                                     // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SpecialZombieSkin;                                 // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Special_Max_Walk_Speed;                            // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpecialHealth;                                     // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HandAttackSocket;                                  // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DistanceAttack;                                    // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttackDamage;                                      // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTargetTick;                                  // 0x0788(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DespawnDistance;                                   // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_Zombie_C*                          PDA_Zombie;                                        // 0x0798(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           SkinSelected;                                      // 0x07A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Debug_;                                            // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x3];                                      // 0x07C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x07CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UClass*>                         ActiveSpawnTraits;                                 // 0x07D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnRagdollStart;                                    // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRagdollEnd;                                      // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IdleUntilPerception;                               // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExpectedHealth;                                    // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldCommunicateDeath;                            // 0x0810(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             _NormalSound;                                      // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ScreamSound;                                       // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ScreamFrequency;                                   // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalZombieScreamFrequency;                       // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SprinterZombieScreamFrequency;                     // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SprinterZombieScreamDistance;                      // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalZombieScreamDistance;                        // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ScreamSoundLooping;                                // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CommunicateDeath();
	void ReceiveBeginPlay();
	void GetMapInfo(struct FSTR_ZombieMapInfo* MapInfo);
	void GetZombieMode(EN_ZombieRules* ZombieMode);
	void GetWaves(int32* CurrentWaves);
	void IsZombieCapReached_(bool* Yes);
	void AreAllWaveZombiesSpawned_(bool* Yes);
	void BossAlreadyInMap_(bool* Yes);
	void CanSpawnSpecialZombie(bool* Yes);
	void IsPlayerWinning(bool* Yes_);
	void GetAllowedMap(TArray<TSoftObjectPtr<class UPDA_LevelMetaData_C>>* AllowedMap);
	void GetReloadPlayRate(double* PlayRate);
	void GetBotsAccuracy(struct FVector* TargetLocation, double* CurrentAccuracy, double* BotSkillThreshold, bool* TargetIsPlayer);
	void GetDeadView(class UCameraComponent** CameraComponent);
	void GetCurrentWeaponsGunGame(class FName* CurrentWeaponsGunGame);
	void GetWep(class AWEP_C** WEP);
	void BPI_Get_Inventory(class UInventory_C** Inventory);
	void Bots_Method_(bool* Bots_Method);
	void GetPcInfo(struct FSTR_PCInfo* PCInfo);
	void GetTeamList(E_Team Team, TArray<struct FSTR_PCInfo>* Info);
	void GetBurnedRef(class USceneComponent** BurnedMesh);
	void GetStarterWeapons(TArray<struct FSTR_Loadout>* Weapons);
	void GetSurvivorStatuts(class UWW_SurvivorStatus_C** SurvivorComponant);
	void GetRagdollSystem(class UWW_RagdollSystem_C** Ragdoll_System);
	void GetTeam(E_Team* Team);
	void IsDead(bool* Dead_);
	void GetMenuSettings(class UBP_MenuControllerComponent_C** Bp_MenuController);
	void IsTalking_(bool* IsTalking__0);
	void IsDestroyabe_(bool* Destroyable_);
	void CanCreateKickVote(bool* CanCreateKickVote_);
	void GetPlayerConnected(TArray<struct FSTR_PCInfo>* PlayerConnected);
	void GetGameMode(struct FSTR_GamemodeWinInfo* GameMode);
	void GetTopScore(TArray<struct FSTR_PCInfo>* TopScore);
	void GetSteamID(class FString* SteamID);
	void GetMutePlayer(TArray<class FString>* MutePlayer);
	void GetPlayerKickVote(TArray<struct FSTR_KickVote>* KickVotePlayer);
	void GetKickedPlayerVoted(TArray<class FString>* KickplayerAlreadyVote);
	void GetServerSteamID(class FString* SteamID);
	void GetHealth(double* Health);
	void GetBlured(double* Blured);
	void GetPlayerSkin(struct FSTR_TEST* Player_Skin, bool* Valid_);
	void Get_BP_Menu_Controller_Component(class UBP_MenuControllerComponent_C** BP_Menu_Controller_Component);
	void Get_Stamina(double* Stamina);
	void GetReady_(bool* IsReady_);
	void GetFlashBangEffect(double* FlashEffect);
	void IsStress(bool* Yes_);
	void CanKickThisPlayer_(const class FString& PlayerId, bool* True_);
	void BPI_Get_RotationMode(EALS_RotationMode* GetRotationMode);
	void BPI_Get_CurrentStates(EMovementMode* PawnMovementMode, EALS_MovementState* MovementState, EALS_MovementState* PrevMovementState, EALS_MovementAction* MovementAction, EALS_RotationMode* RotationMode, EALS_Gait* ActualGait, EALS_Stance* ActualStance, EALS_ViewMode* ViewMode, EALS_OverlayState* OverlayState, EALS_OverlayState* OverlayState__Client_);
	void BPI_Get_EssentialValues(struct FVector* Velocity, struct FVector* Acceleration, struct FVector* MovementInput, bool* IsMoving, bool* HasMovementInput, double* Speed_0, double* MovementInputAmount, struct FRotator* AimingRotation, double* AimYawRate);
	void TooSlow_();
	void Can_Grab(bool* True_);
	void TriggerAttack();
	void AttackHitDetection();
	void GetRandomSpeed();
	void OnRep_ZombieSkin();
	bool CanReachDestination(const struct FVector& PathStart, const struct FVector& PathEnd, double* PathLenght);
	double GetSpeed();
	double GetMappedSpeed();
	void SmoothCharacterRotation(const struct FRotator& Target, double TargetInterpSpeed_Const_, double ActorInterpSpeed_Smooth_);
	void UpdateGroudedRotation();
	void RagdollUpdateLocation();
	void BoneDamage(class FName bone, double Damage, double* DamageFinal);
	void Target_Distance();
	void RagdollUpdate();
	void SmoothNewLocation__FinishedFunc();
	void SmoothNewLocation__UpdateFunc();
	void OnNotifyEnd_51E0283846B84EF1D5A1089E527759EB(class FName NotifyName);
	void OnNotifyBegin_51E0283846B84EF1D5A1089E527759EB(class FName NotifyName);
	void OnInterrupted_51E0283846B84EF1D5A1089E527759EB(class FName NotifyName);
	void OnBlendOut_51E0283846B84EF1D5A1089E527759EB(class FName NotifyName);
	void OnCompleted_51E0283846B84EF1D5A1089E527759EB(class FName NotifyName);
	void NewWaves(int32 Wave, EN_WaveClass EN_WaveClass);
	void EndWave(int32 Wave, EN_WaveClass EN_WaveClass);
	void UpdatePower(bool On_, class AActor* Provider);
	void ConnectionInfos(const struct FLinearColor& Color);
	void ElectricalAction();
	void Set_Zombie_Rules(EN_ZombieRules ZombieMode);
	void RegisterNewZombie();
	void IncreaseTotalZombiesToSpawnInWave();
	void SetLastSpecialZombieSpawnWave();
	void UpdateWarning(const class FString& String);
	void ServerTravel(double Delay, const class FString& Level);
	void UpdateTransitionMap();
	void OnTrySelectTeam(E_Team Team);
	void InitScoreBoard();
	void UpdateMapSelection(class FName Selected_Level_Name, int32 Index_0);
	void UpdateModeInfo();
	void UpdateScore(const struct FSTR_Score& Score);
	void UpdateTeamXP(int32 Rpoints, int32 RanksPoints, bool AccessReward_, bool Winner_);
	void BreakTimer();
	void ClearMap();
	void Slomo(double Slomo_0);
	void KickPlayer(const struct FSTR_KickVote& PlayerInfo);
	void MuteID(const class FString& SteamID);
	void UpdateKickVote(const struct FSTR_PCInfo& Target, bool Yes_);
	void Kick_(const struct FSTR_PCInfo& Target);
	void NewKickVote(const struct FSTR_PCInfo& Target);
	void UpdateGamemode(EGameMode GameMode);
	void IsReady_(bool IsReady__0);
	void Talk(bool IsTalking);
	void OnPlayerDeath(const struct FSTR_PCInfo& PC);
	void Respawn(double duration, const struct FSTR_PCInfo& Info);
	void Set_Bomb(TSoftObjectPtr<class ABombe_C> Bomb);
	void PlaySoundLocal(class USoundCue* Audio);
	void SpawnVoteNextMap_Hud_();
	void AddVoteNextMap(const struct FSTR_VoteNextMapInfo& VoteInfo);
	void InitVoteNextMap();
	void RefreshMapVoterPlayerID();
	void Update_Vote_Timer_Text(double TimerIndex);
	void BPI_Death();
	void BPI_Set_MovementState(EALS_MovementState NewMovementState);
	void BPI_Set_MovementAction(EALS_MovementAction NewMovementAction);
	void BPI_Set_RotationMode(EALS_RotationMode NewRotationMode);
	void BPI_Set_Gait(EALS_Gait NewGait);
	void BPI_Set_ViewMode(EALS_ViewMode NewViewMode);
	void BPI_Set_OverlayState(EALS_OverlayState NewOverlayState);
	void BPI_PlayAnimMontage(class UAnimMontage* AnimMontage, double PlayRate);
	void StopMontage__Replicated_();
	void ApplyPointDamage(double Damage, double RagdollForce, class FName BoneName, const struct FVector& Location, const struct FVector& ShotFromDirection, class AController* ControllerInstigator, bool DisableHeadShot);
	void PassTroughtWindows(const struct FVector& DestLocation, class AActor* Actor);
	void EventRagdollStart();
	void ReceiveDestroyed();
	void PlayMontage__Multicast_();
	void ReceiveRadialDamage(float DamageReceived, const class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void RandomSkin__Server_();
	void RandomSkin__Multicast_(class USkeletalMesh* NewMesh);
	void Play_Anim_Montage__Multicast_(class UAnimMontage* MontageToPlay, float PlayRate);
	void BndEvt__ALS_Base_CharacterBP_Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UpdateTarget();
	void Event_Ragdoll_End();
	void ZombieScream();
	void Attack__multicast_(class UAnimMontage* AnimMontage);
	void Attack__Server_(class UAnimMontage* AnimMontage);
	void Revive(float duration);
	void UpdateGrabBoxCollision(bool Enable_);
	void ActivateTraitByClass(TSubclassOf<class UBP_BaseTraitComponent_C> ComponentClass);
	void DeactivateTraitByClass(TSubclassOf<class UBP_BaseTraitComponent_C> ComponentClass);
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__Zombie_WW_SurvivorStatus_K2Node_ComponentBoundEvent_1_OnDeath__DelegateSignature();
	void Multicast___SpawnScreamSound(class USoundBase* Sound);
	void ResetScreamSoundCooldown();
	void Multicast___SpawnScreamSoundLooping(class USoundBase* Sound);
	void SprinterScreamSoundLooping();
	void ExecuteUbergraph_Zombie(int32 EntryPoint);

	void GetTraitSound(bool bScreamSound, class USoundBase** OutItem) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Zombie_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Zombie_C")
	}
	static class AZombie_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombie_C>();
	}
};
#pragma pack(pop)

}

